[初始化]=(
{设置分辨率 | [1618,947]}
//1为开启功能,0为关闭功能
//战斗
%新人竞技场%={UI|竞技场,新人竞技场}
%自动卡主线%={UI|竞技场,自动卡主线}

)

[UI]=(

{主窗体 | Doro启动！ | 大小=[200,200] | 按键=['运行','取消'] | 对齐模式=0}

{页面 | 分页 | 对齐模式=0 | 选项=['战斗','说明']}

{垂直布局 | 战斗 | 页面='分页.战斗' | 对齐模式=0}

{水平布局 | 水平1 | 布局='战斗' | 对齐模式=0}
{组 | 竞技场 | 布局='水平1' | 对齐模式=0}
{多选 | 竞技场 | 组='竞技场' | 行列=[1,3] | 对齐模式=0 | 选项=['新人竞技场','自动卡主线','冠军竞技场'] | 选中=[0,1,0]}
{水平布局 | 水平2 | 布局='战斗' | 对齐模式=0}
{组 | 异常拦截 | 布局='水平2' | 对齐模式=0}
{单选|异常拦截|组='异常拦截'|行列=[4,3]|对齐模式=0|选项=['编队1：克拉肯(石)','编队2：镜像容器(手)','编队3：茵迪维利亚(衣)','编队4：过激派(头)','编队5：死神(脚)']|选中=[0,0,0,0,0]}
{水平布局 | 水平3 | 布局='战斗' | 对齐模式=0}
{组 | 模拟室 | 布局='水平3' | 对齐模式=0}
{多选|模拟室|组='模拟室'|行列=[1,3]|对齐模式=0|选项=['普通模拟器(需解锁快速模拟)','模拟室超频(默认上次的TAG)']|选中=[]}


)


[主界面]=(
//{找图|返回主页|点击=['T',0,0,50]|延时=1000|范围=[[112,830,176,885]]|图片=['返回主页',85]}
//{组|'新人竞技场'|开关={'新人竞技场'}}
{组 | '自动卡主线' | 开关={'自动卡主线'}}
)
[新人竞技场]=(
{延时 | 3000}
{找图 | 方舟 | 点击=['T',0,0,50] | 延时=1000 | 循环=['F',50,1000] | 范围=[[1034,552,1233,667]] | 图片=['方舟',85]}
{找图 | 竞技场 | 点击=['T',0,0,50] | 延时=1000 | 循环=['F',50,1000] | 范围=[[844,472,1000,650]] | 图片=['竞技场',85]}
{找图 | 新人竞技场 | 点击=['T',0,0,50] | 延时=1000 | 循环=['F',50,1000] | 范围=[[579,453,680,520]] | 图片=['新人竞技场',85]}
//判断是否有免费次数
{找图 | 判断新人竞技场是否有免费次数 | 组=['F判断新人竞技场是否有免费次数'] | 延时=1000 | 范围=[[899,458,1038,560]] | 图片=['新人竞技场免费战斗',85]}
{找图 | 新人竞技场免费战斗 | 点击=['T',0,0,50] | 延时=1000 | 循环=['F',50,1000] | 范围=[[899,458,1038,560]] | 图片=['新人竞技场免费战斗',85]}
{找图 | 新人竞技场进入战斗 | 点击=['T',0,0,50] | 延时=1000 | 循环=['F',50,1000] | 范围=[[729,722,883,768]] | 图片=['新人竞技场进入战斗',85]}
{找图 | 战斗结束标志TAB | 点击=['T',0,0,50] | 偏移=[0,-100] | 延时=1000 | 循环=['F',50,1000] | 跳至=['T','新人竞技场','判断新人竞技场是否有免费次数'] | 范围=[[1526,834,1590,901]] | 图片=['战斗结束标志TAB',85]}
)
[判断新人竞技场是否有免费次数]=(
//关闭新人竞技场
{赋值 | [[{'新人竞技场'},0]]}
{跳转 | '主界面'}
)
[自动卡主线]=(
{找图 | 野外 | 延时=1000 | 跳出='F' | 范围=[[0,9,99,49]] | 图片=['野外',85]}
//{点击|[1100,500,50]}
{点击 | [955,577,50]}

{延时 | 1000}
{找图 | 新人竞技场进入战斗 | 点击=['T',0,0,50] | 延时=1000 | 循环=['F',50,1000] | 范围=[[815,787,1051,879]] | 图片=['新人竞技场进入战斗',85]}
{找图 | 暂停 | 点击=['T',0,0,50] | 延时=1000 | 循环=['F',50,500] | 范围=[[1554,6,1602,56]] | 图片=['暂停',85]}
{找图 | 放弃战斗 | 点击=['T',0,0,50] | 延时=100 | 循环=['F',50,500] | 范围=[[623,811,781,866]] | 图片=['放弃战斗',85]}
{点击 | [10,10,50]}
{点击 | [10,10,50]}
{点击 | [10,10,50]}
{按键 | ['ESC',50]}
{按键 | ['ESC',50]}
{按键 | ['ESC',50]}
//{找图|战斗返回|点击=['T',0,0,50]|延时=1000|循环=['F',50,1000]|范围=[[9,816,136,882]]|图片=['战斗返回',85]}
)

[处理异常]=(

)