[初始化]=(
{设置分辨率 | [1618,947]}
//1为开启功能,0为关闭功能
%战斗开关%={UI|任务总开关,战斗}
%奖励开关%={UI|任务总开关,奖励}
%商店总开关%={UI|任务总开关,商店}
//战斗
%新人竞技场开关%=1
%新人竞技场1%={UI|新人竞技场,打1}
%新人竞技场2%={UI|新人竞技场,打2}
%新人竞技场3%={UI|新人竞技场,打3}

%特殊竞技场开关%={UI|日常奖励,特殊竞技场领取奖励}
%前哨防御领取开关%={UI|日常奖励,前哨防御领取}
%前哨防御歼灭开关%={UI|日常奖励,前哨防御歼灭}
%派遣开关%={UI|日常奖励,派遣}
%付费商店开关%={UI|日常奖励,付费商店}
%咨询开关%={UI|日常奖励,咨询}
%社交点数开关%={UI|日常奖励,社交点数}
%任务奖励开关%={UI|日常奖励,任务奖励}
%任务入口%=1
%邮件开关%={UI|日常奖励,邮件}
%通行证开关%={UI|日常奖励,通行证}

%商店开关%=1
%普通商店开关%=0
%白嫖2次开关%={UI|普通商店,白嫖2次}
%信用点买芯尘盒开关%={UI|普通商店,信用点买芯尘盒}
%竞技场商店开关%=0
%代码手册开关%={UI|竞技场商店,代码手册}
%代码手册宝箱开关%={UI|竞技场商店,代码手册宝箱}
%废铁商店开关%=0
%珠宝开关%={UI|废铁商店,珠宝}
%所有养成资源开关%={UI|废铁商店,所有养成资源}


%企业塔开关%={UI|战斗,企业塔}
//%模拟室开关%={UI|战斗,模拟室X}
//%自动卡主线%={UI|战斗,卡主线X}


//就是利用组跳转功能,把每一个功能做成类似函数调用的效果,具体实现方式是
//1判断当前属于整个代码流程中的什么位置
//2根据当前位置,跳转进入对应的组,在组中完成当前的功能
//3跳出组,回到最开始进入组的位置,继续判断接下来轮到哪一个环节,重复2,3步骤

//然后整个代码遵循3部分结构(算上ui应该算4部分？)
//ui部分
//组判断部分(用于判断现在在哪儿,应该去哪个组)
//组处理部分(具体的功能实现写在这里)
//错误或例外情况处理




)

[UI]=(

{主窗体 | Doro启动！ | 大小=[200,200] | 按键=['运行','取消'] | 对齐模式=0}
{页面 | 分页 | 对齐模式=0 | 选项=['任务','战斗','奖励','商店','说明']}

{垂直布局 | 任务 | 页面='分页.任务' | 对齐模式=0}

{水平布局 | 水平0 | 布局='任务' | 对齐模式=0}

{组 | 任务总开关 | 布局='水平0' | 对齐模式=0}
{多选 | 任务总开关 | 组='任务总开关' | 行列=[4,3] | 对齐模式=0 | 选项=['战斗','奖励','商店'] | 选中=[]}
{标签|任务总开关|布局='任务'|对齐模式=2|样式='color:rgb(0,0,0);font-weight:600;font-size:20px;'}
{标签|勾选则会执行对应分页的任务|布局='任务'|对齐模式=2|样式='color:rgb(0,0,0);font-weight:600;font-size:20px;'}
{标签|不勾选不执行|布局='任务'|对齐模式=2|样式='color:rgb(0,0,0);font-weight:600;font-size:20px;'}

{垂直布局 | 战斗 | 页面='分页.战斗' | 对齐模式=0}

{水平布局 | 水平1 | 布局='战斗' | 对齐模式=0}
{组 | 新人竞技场 | 布局='水平1' | 对齐模式=0}
{单选 | 新人竞技场 | 组='新人竞技场' | 行列=[4,3] | 对齐模式=0 | 选项=['打1','打2','打3'] | 选中=[]}

{水平布局 | 水平2 | 布局='战斗' | 对齐模式=0}
{组 | 战斗 | 布局='水平2' | 对齐模式=0}
{多选 | 战斗 | 组='战斗' | 行列=[4,3] | 对齐模式=0 | 选项=['企业塔','模拟室X','卡主线X'] | 选中=[]}


{垂直布局 | 商店 | 页面='分页.商店' | 对齐模式=0}

{水平布局 | 水平3 | 布局='商店' | 对齐模式=0}
{组 | 普通商店 | 布局='水平3' | 对齐模式=0}
{多选 | 普通商店 | 组='普通商店' | 行列=[4,3] | 对齐模式=0 | 选项=['白嫖2次','信用点买芯尘盒'] | 选中=[]}
{水平布局 | 水平4 | 布局='商店' | 对齐模式=0}
{组 | 竞技场商店 | 布局='水平4' | 对齐模式=0}
{多选 | 竞技场商店 | 组='竞技场商店' | 行列=[4,3] | 对齐模式=0 | 选项=['代码手册','代码手册宝箱'] | 选中=[]}
{水平布局 | 水平5 | 布局='商店' | 对齐模式=0}
{组 | 废铁商店 | 布局='水平5' | 对齐模式=0}
{多选 | 废铁商店 | 组='废铁商店' | 行列=[4,3] | 对齐模式=0 | 选项=['珠宝','所有养成资源'] | 选中=[]}


{垂直布局 | 奖励 | 页面='分页.奖励' | 对齐模式=0}

{水平布局 | 水平6 | 布局='奖励' | 对齐模式=0}
{组 | 日常奖励 | 布局='水平6' | 对齐模式=0}
{多选 | 日常奖励 | 组='日常奖励' | 行列=[4,3] | 对齐模式=0 | 选项=['特殊竞技场领取奖励','前哨防御领取','前哨防御歼灭','派遣','付费商店','咨询','社交点数','任务奖励','邮件','通行证'] | 选中=[]}


{垂直布局 | 说明页 | 页面='分页.说明' | 对齐模式=0}
{标签|系统支持：WIN10及以上,显示缩放100%|布局='说明页'|对齐模式=2|样式='color:rgb(0,0,0);font-weight:600;font-size:20px;'}
{标签|游戏设定：分辨率1600*900,中文,窗口化,低画质|布局='说明页'|对齐模式=2|样式='color:rgb(0,0,0);font-weight:600;font-size:20px;'}
{标签|该脚本为免费分享,禁止售卖/用于代肝|布局='说明页'|对齐模式=2|样式='color:rgb(200,0,0);font-weight:600;font-size:20px;'}
{标签|禁止跳脸宣传,制作视频,散布群号等行为|布局='说明页'|对齐模式=2|样式='color:rgb(200,0,0);font-weight:600;font-size:20px;'}
{标签|一经发现,将停止脚本的一切后续更新,望周知|布局='说明页'|对齐模式=2|样式='color:rgb(200,0,0);font-weight:600;font-size:20px;'}
//{标签|制作人员：千夜,梅友前,歌德,四水年华,稻草人,小函,Vector383,文本,显卡,心华,正逆,茶叶团|布局='说明页'|对齐模式=8|样式='color:rgb(0,0,0);font-weight:600;font-size:20px;'}
{标签|特别鸣谢：脚本测试群的每一位成员|布局='说明页'|对齐模式=8|样式='color:rgb(0,0,0);font-weight:600;font-size:20px;'}
{标签|脚本版本号：内部开发v0.0.1适用游戏版本：v0.0.1|布局='说明页'|对齐模式=9|样式='color:rgb(0,0,0);font-weight:600;font-size:13px;'}

)


[主界面]=(
{组 | '任务初始化'}
{组 | '返回主页'}
//{组|'自动卡主线'}

{组 | '新人竞技场' | 开关={'新人竞技场开关'}}
{组 | '特殊竞技场' | 开关={'特殊竞技场开关'}}
{组 | '企业塔' | 开关={'企业塔开关'}}

{组 | '前哨防御领取' | 开关={'前哨防御领取开关'}}
{组 | '前哨防御歼灭' | 开关={'前哨防御歼灭开关'}}
{组 | '派遣' | 开关={'派遣开关'}}
{组 | '付费商店' | 开关={'付费商店开关'}}
{组 | '咨询' | 开关={'咨询开关'}}
{组 | '社交点数' | 开关={'社交点数开关'}}
{组 | '任务奖励' | 开关={'任务奖励开关'}}
{组 | '邮件' | 开关={'邮件开关'}}
{组 | '通行证' | 开关={'通行证开关'}}
{组 | '商店' | 开关={'商店开关'}}
{组 | '处理异常'}
)
[商店]=(
{延时 | 1000}
{组 | '商店开关初始化'}
{找图 | 奖励 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[718,275,881,415]] | 图片=['奖励',85]}
{找图 | 商店确认 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[889,546,962,589]] | 图片=['商店确认',85]}
{找图 | 商店购买 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[809,693,954,824]] | 图片=['商店购买',85]}
{找图 | 商店入口 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[454,595,525,634]] | 图片=['商店',85]}
{找图 | 百货商店 | 组=['T百货商店'] | 延时=1000 | 范围=[[5,17,75,49]] | 图片=['百货商店',85]}
{找图 | 商店购买道具 | 组=['T百货商店'] | 延时=1000 | 范围=[[748,160,854,200]] | 图片=['商店购买道具',85]}


{跳转 | '商店'}
)
[商店开关初始化]=(
{赋值 | [[{'商店开关'},0]]}
{赋值 | [[{'普通商店开关'},0]]}
{赋值 | [[{'竞技场商店开关'},0]]}
{赋值 | [[{'废铁商店开关'},0]]}
{计算 | [[{'白嫖2次开关'},'+',{'普通商店开关'},{'普通商店开关'}]]}
{计算 | [[{'信用点买芯尘盒开关'},'+',{'普通商店开关'},{'普通商店开关'}]]}
{计算 | [[{'代码手册开关'},'+',{'竞技场商店开关'},{'竞技场商店开关'}]]}
{计算 | [[{'代码手册宝箱开关'},'+',{'竞技场商店开关'},{'竞技场商店开关'}]]}
{计算 | [[{'珠宝开关'},'+',{'废铁商店开关'},{'废铁商店开关'}]]}
{计算 | [[{'所有养成资源开关'},'+',{'废铁商店开关'},{'废铁商店开关'}]]}
{判断 | [[{'普通商店开关'},'大于',0],{赋值=['T',[{'普通商店开关'},1]]}]}
{判断 | [[{'竞技场商店开关'},'大于',0],{赋值=['T',[{'竞技场商店开关'},1]]}]}
{判断 | [[{'废铁商店开关'},'大于',0],{赋值=['T',[{'废铁商店开关'},1]]}]}
{计算 | [[{'普通商店开关'},'+',{'商店开关'},{'商店开关'}]]}
{计算 | [[{'竞技场商店开关'},'+',{'商店开关'},{'商店开关'}]]}
{计算 | [[{'废铁商店开关'},'+',{'商店开关'},{'商店开关'}]]}
{判断 | [[{'商店开关'},'大于',0],{赋值=['T',[{'商店开关'},1]]}]}
{判断 | [[{'商店开关'},'等于',0],{跳转=['T主界面']}]}
)
[百货商店]=(
{组 | '普通商店' | 开关={'普通商店开关'}}
{组 | '竞技场商店' | 开关={'竞技场商店开关'}}
{组 | '废铁商店' | 开关={'废铁商店开关'}}
)
[普通商店]=(
{找图 | 普通商店 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[0,325,63,386]] | 图片=['普通商店',85]}
//出口1：有商品,没货币
{找图 | 商店购买 | 点击=['T',0,0,50] | 延时=500 | 范围=[[809,693,954,824]] | 图片=['商店购买',85]}
{找图 | 商店资金不足 | 组=['T普通商店出口'] | 延时=1000 | 范围=[[745,435,858,470]] | 图片=['商店资金不足',85]}
{找图 | 商店资金不足 | 组=['T废铁商店出口'] | 延时=1000 | 范围=[[745,435,858,470]] | 图片=['商店资金不足',85]}
//出口2：四个位置全部售罄
{组 | '普通商店全部售罄且无免费'}

//{识字|芯尘盒|内容=['芯尘盒']|延时=1000|范围=[[214,433,518,660]]|开关={'信用点买芯尘盒开关'}}
{找图 | 信用点买芯尘盒 | 组=['T信用点买芯尘盒'] | 延时=1000 | 范围=[[374,496,489,576]] | 图片=['商店芯尘盒',85] | 开关={'信用点买芯尘盒开关'}}

{找色 | 白嫖信用点 | 点击=['T',0,0,50] | 偏移=[-30,30] | 延时=1000 | 范围=[[196,441,226,470]] | 颜色=['#FB0B08','3,0,#FE302F/3,3,#FD4500/0,3,#FC4400',80] | 开关={'白嫖2次开关'}}
{找色 | 免费 | 点击=['T',0,0,50] | 偏移=[-100,15] | 延时=1000 | 范围=[[277,375,342,422]] | 颜色=['#FF5100','1,0,#FF5100/-1,7,#FE5100/1,7,#FF5200',80]}

{跳转 | '商店'}
)
[信用点买芯尘盒]=(
{找图 | 信用点图标 | 点击=['T',0,0,50] | 跳出='F' | 延时=1000 | 范围=[[390,608,432,645]] | 图片=['信用点图标',85]}
)
[普通商店出口]=(
{赋值 | [[{'白嫖2次开关'},0]]}
{赋值 | [[{'信用点买芯尘盒开关'},0]]}
)
[普通商店全部售罄且无免费]=(
{找色 | 免费 | 跳出='T' | 延时=300 | 范围=[[277,375,342,422]] | 颜色=['#FF5100','1,0,#FF5100/-1,7,#FE5100/1,7,#FF5200',80]}
{找图 | 商品售罄 | 跳出='F' | 延时=300 | 范围=[[111,528,203,582]] | 图片=['商品售罄',80] | 开关={'白嫖2次开关'}}
{找图 | 商品售罄 | 跳出='F' | 延时=300 | 范围=[[378,519,486,590]] | 图片=['商品售罄',80] | 开关={'信用点买芯尘盒开关'}}

{组 | '普通商店出口'}
)

[竞技场商店]=(
{找图 | 竞技场商店 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[6,545,62,591]] | 图片=['竞技场商店',85]}
//出口1：有商品,没货币
{找图 | 商店购买 | 点击=['T',0,0,50] | 延时=500 | 范围=[[809,693,954,824]] | 图片=['商店购买',85]}
{找图 | 商店资金不足 | 组=['T竞技场商店出口'] | 延时=1000 | 范围=[[745,435,858,470]] | 图片=['商店资金不足',85]}
{找图 | 商店资金不足 | 组=['T废铁商店出口'] | 延时=1000 | 范围=[[745,435,858,470]] | 图片=['商店资金不足',85]}
//出口2：四个位置全部售罄
{组 | '竞技场全部售罄'}

{找图 | 代码手册 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[379,473,752,587]] | 图片=['水冷','铁甲','电击','燃烧',90] | 开关={'代码手册开关'}}
{找图 | 代码手册宝箱 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[783,473,888,571]] | 图片=['代码宝箱',90] | 开关={'代码手册宝箱开关'}}
{跳转 | '商店'}
)
[竞技场商店出口]=(
{赋值 | [[{'代码手册开关'},0]]}
{赋值 | [[{'代码手册宝箱开关'},0]]}
)
[竞技场全部售罄]=(
{找图 | 商品售罄 | 跳出='F' | 延时=300 | 范围=[[404,524,452,569]] | 图片=['商品售罄',80] | 开关={'代码手册开关'}}
{找图 | 商品售罄 | 跳出='F' | 延时=300 | 范围=[[534,523,597,575]] | 图片=['商品售罄',80] | 开关={'代码手册开关'}}
{找图 | 商品售罄 | 跳出='F' | 延时=300 | 范围=[[664,518,737,581]] | 图片=['商品售罄',80] | 开关={'代码手册开关'}}
{找图 | 商品售罄 | 跳出='F' | 延时=300 | 范围=[[801,521,878,585]] | 图片=['商品售罄',80] | 开关={'代码手册宝箱开关'}}
{组 | '竞技场商店出口'}
)

[废铁商店]=(
{找图 | 废铁商店 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[8,684,62,738]] | 图片=['废铁商店',85]}
//出口1：有商品,没货币
{找图 | 商店购买 | 点击=['T',0,0,50] | 延时=500 | 范围=[[809,693,954,824]] | 图片=['商店购买',85]}
{找图 | 商店资金不足 | 组=['T废铁商店出口'] | 延时=1000 | 范围=[[745,435,858,470]] | 图片=['商店资金不足',85]}
{找图 | 商店资金不足 | 组=['T废铁商店出口'] | 延时=1000 | 范围=[[745,435,858,470]] | 图片=['商店资金不足',85]}
//出口2：四个位置全部售罄
{组 | '废铁全部售罄'}

{找图 | 废铁珠宝 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[83,435,231,602]] | 图片=['商店珠宝',85] | 开关={'珠宝开关'}}
{找图 | 所有养成资源开关 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[894,427,1589,591],[78,587,228,799]] | 图片=['商店芯尘盒','商店战斗数据','商店信用点',85] | 开关={'所有养成资源开关'}}
{跳转 | '商店'}
)
[废铁商店出口]=(
{赋值 | [[{'珠宝开关'},0]]}
{赋值 | [[{'所有养成资源开关'},0]]}
)
[废铁全部售罄]=(
{找图 | 商品售罄 | 跳出='F' | 延时=300 | 范围=[[113,520,195,584]] | 图片=['商品售罄',80] | 开关={'珠宝开关'}}
{找图 | 商品售罄 | 跳出='F' | 延时=300 | 范围=[[925,525,1027,579]] | 图片=['商品售罄',80] | 开关={'所有养成资源开关'}}
{找图 | 商品售罄 | 跳出='F' | 延时=300 | 范围=[[1061,525,1156,587]] | 图片=['商品售罄',80] | 开关={'所有养成资源开关'}}
{找图 | 商品售罄 | 跳出='F' | 延时=300 | 范围=[[1199,521,1287,585]] | 图片=['商品售罄',80] | 开关={'所有养成资源开关'}}
{找图 | 商品售罄 | 跳出='F' | 延时=300 | 范围=[[1342,531,1430,584]] | 图片=['商品售罄',80] | 开关={'所有养成资源开关'}}
{找图 | 商品售罄 | 跳出='F' | 延时=300 | 范围=[[1477,530,1566,582]] | 图片=['商品售罄',80] | 开关={'所有养成资源开关'}}
{找图 | 商品售罄 | 跳出='F' | 延时=300 | 范围=[[109,743,202,800]] | 图片=['商品售罄',80] | 开关={'所有养成资源开关'}}
{组 | '废铁商店出口'}
)

[新人竞技场]=(
{延时 | 1000}
{组 | '新人竞技场开关初始化'}
{找图 | 进入方舟 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[1034,552,1233,667]] | 图片=['进入方舟',85]}
{找图 | 进入竞技场 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[844,472,1000,650]] | 图片=['进入竞技场',85]}
{找图 | 进入新人竞技场 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[579,453,680,520]] | 图片=['进入新人竞技场',85]}
{找图 | 新人竞技场免费战斗 | 组=['T新人竞技场免费战斗'] | 延时=1000 | 范围=[[899,458,1038,560]] | 图片=['新人竞技场免费战斗',85]}
{找图 | 新人竞技场进入战斗 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[729,722,883,768]] | 图片=['新人竞技场进入战斗',85]}
{找图 | 战斗结束标志TAB | 点击=['T',0,0,50] | 偏移=[0,-100] | 延时=1000 | 范围=[[1526,834,1590,901]] | 图片=['战斗结束标志TAB',85]}
{找图 | 新人竞技场无免费战斗 | 组=['T新人竞技场无免费战斗'] | 延时=1000 | 范围=[[652,80,981,190]] | 图片=['新人竞技场FLAG',85]}
{找图 | 竞技场赛季结束 | 组=['T新人竞技场赛季结束'] | 延时=1000 | 范围=[[720,421,881,489]] | 图片=['竞技场赛季结束',85]}
{跳转 | '新人竞技场'}
)
[新人竞技场开关初始化]=(
{赋值 | [[{'新人竞技场开关'},0]]}
{计算 | [[{'新人竞技场1'},'+',{'新人竞技场开关'},{'新人竞技场开关'}]]}
{计算 | [[{'新人竞技场2'},'+',{'新人竞技场开关'},{'新人竞技场开关'}]]}
{计算 | [[{'新人竞技场3'},'+',{'新人竞技场开关'},{'新人竞技场开关'}]]}
{判断 | [[{'新人竞技场开关'},'等于',0],{跳转=['T主界面']}]}
)
[新人竞技场免费战斗]=(
{找图 | 新人竞技场免费战斗1 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[901,453,1046,528]] | 图片=['新人竞技场免费战斗',85] | 开关={'新人竞技场1'}}
{找图 | 新人竞技场免费战斗2 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[910,586,1035,654]] | 图片=['新人竞技场免费战斗',85] | 开关={'新人竞技场2'}}
{找图 | 新人竞技场免费战斗3 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[910,721,1049,775]] | 图片=['新人竞技场免费战斗',85] | 开关={'新人竞技场3'}}
)
[新人竞技场无免费战斗]=(
{找图 | 新人竞技场免费战斗 | 跳出='T' | 延时=1000 | 范围=[[898,458,1057,809]] | 图片=['新人竞技场免费战斗',85]}
//新人竞技场
{组 | '新人竞技场开关'}
{跳转 | '主界面'}
)
[新人竞技场赛季结束]=(
{组 | '新人竞技场开关'}
{跳转 | '主界面'}
)

[特殊竞技场]=(
{延时 | 1000}
{找图 | 进入方舟 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[1034,552,1233,667]] | 图片=['进入方舟',85]}
{找图 | 进入竞技场 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[844,472,1000,650]] | 图片=['进入竞技场',85]}
{找图 | 进入特殊竞技场 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[811,447,913,520]] | 图片=['进入特殊竞技场',85]}
{找图 | 特殊竞技场FLAG | 点击=['T',0,0,50] | 延时=1000 | 范围=[[717,118,905,212]] | 图片=['特殊竞技场FLAG',85]}
{找图 | 进入特殊竞技场 | 组=['T进入特殊竞技场'] | 延时=1000 | 范围=[[811,447,913,520]] | 图片=['进入特殊竞技场',85]}
{找图 | 特殊竞技场FLAG | 组=['T特殊竞技场标志'] | 延时=1000 | 范围=[[717,118,905,212]] | 图片=['特殊竞技场FLAG',85]}
{找图 | 特殊竞技场领取按钮 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[801,775,991,854]] | 图片=['特殊竞技场领取按钮',85]}
{找图 | 特殊竞技场奖励 | 组=['T特殊竞技场奖励'] | 延时=1000 | 范围=[[718,275,881,415]] | 图片=['奖励',85]}
{找图 | 竞技场赛季结束 | 组=['T特殊竞技场赛季结束'] | 延时=1000 | 范围=[[720,421,881,489]] | 图片=['竞技场赛季结束',85]}
{跳转 | '特殊竞技场'}
)
[特殊竞技场奖励]=(
{找图 | 奖励 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[718,275,881,415]] | 图片=['奖励',85]}
{组 | '特殊竞技场开关'}
)
[特殊竞技场赛季结束]=(
{组 | '特殊竞技场开关'}
{跳转 | '主界面'}
)

[前哨防御领取]=(
{延时 | 1000}
{找图 | 进入前哨防御 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[422,727,472,773]] | 图片=['进入前哨防御',85]}
{找图 | 获得奖励 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[830,744,972,801]] | 图片=['获得奖励',85]}
{找图 | 前哨防御点击领取奖励 | 组=['T前哨防御点击领取奖励'] | 延时=1000 | 范围=[[718,275,881,415]] | 图片=['奖励',85]}
{找图 | 指挥官升级 | 点击=['T',0,0,50] | 偏移=[0,-100] | 延时=1000 | 范围=[[747,417,864,453]] | 图片=['指挥官升级',85]}
//{找图|一举歼灭|点击=['T',0,0,50]|延时=1000|范围=[[627,748,773,796]]|图片=['一举歼灭',85]}
{跳转 | '前哨防御领取'}
)
[前哨防御点击领取奖励]=(
{找图 | 奖励 | 点击=['T',0,0,50] | 偏移=[0,-100] | 延时=1000 | 范围=[[718,275,881,415]] | 图片=['奖励',85]}
{组 | '前哨防御领取开关'}
)

[前哨防御歼灭]=(
{延时 | 1000}
{找图 | 指挥官升级 | 点击=['T',0,0,50] | 偏移=[0,-100] | 延时=1000 | 范围=[[747,417,864,453]] | 图片=['指挥官升级',85]}
{找图 | 奖励 | 点击=['T',0,0,50] | 偏移=[0,-100] | 延时=1000 | 范围=[[718,275,881,415]] | 图片=['奖励',85]}
{找图 | 进行歼灭 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[830,675,942,714]] | 图片=['进行歼灭',85]}
{找图 | 进入前哨防御 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[422,727,472,773]] | 图片=['进入前哨防御',85]}
{找图 | 一举歼灭 | 组=['T一举歼灭红点'] | 延时=1000 | 范围=[[627,748,773,796]] | 图片=['一举歼灭',85]}
{跳转 | '前哨防御歼灭'}
)
[一举歼灭红点]=(
{找色 | 通行证红点 | 点击=['T',0,0,50] | 偏移=[-10,10] | 延时=1000 | 跳出='T' | 范围=[[786,741,813,761]] | 颜色=['#FB0B08','3,0,#FE302F/3,3,#FD4500/0,3,#FC4400',80]}
{找色 | 通行证红点 | 组=['F前哨防御歼灭开关'] | 延时=1000 | 范围=[[786,741,813,761]] | 颜色=['#FB0B08','3,0,#FE302F/3,3,#FD4500/0,3,#FC4400',80]}
)

[企业塔]=(
{延时 | 1000}
{找图 | 进入方舟 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[1034,552,1233,667]] | 图片=['进入方舟',85]}
{找图 | 进入无限之塔 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[901,369,1009,425]] | 图片=['进入无限之塔',85]}
{找图 | 红点 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[662,502,1057,530]] | 图片=['红点',85]}
{找图 | 企业塔进入战斗 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[876,810,1010,851]] | 图片=['企业塔进入战斗',85]}
{找图 | 直接前往目前位置 | 点击=['T',0,0,50] | 组=['T点击当前层数'] | 延时=2000 | 范围=[[1540,153,1592,223]] | 图片=['直接前往目前位置',85]}
{找图 | 企业塔下一关 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[1413,827,1593,886]] | 图片=['企业塔下一关',85]}
{找图 | 企业塔下一关灰 | 组=['T企业塔下一关灰'] | 延时=1000 | 范围=[[1410,818,1592,902]] | 图片=['企业塔下一关灰',85]}
//找到无限塔再判断是否有红点
{找图 | 无限之塔标志 | 组=['T无限之塔标志'] | 延时=1000 | 范围=[[691,58,945,157]] | 图片=['无限之塔标志',85]}
{跳转 | '企业塔'}
)
[点击当前层数]=(
{找图 | 点击当前层数 | 点击=['T',0,0,50] | 偏移=[-765,185] | 延时=1000 | 范围=[[1540,153,1592,223]] | 图片=['直接前往目前位置',85]}
)
[企业塔下一关灰]=(
{找图 | 企业塔下一关灰 | 点击=['T',0,0,50] | 偏移=[0,-100] | 延时=1000 | 范围=[[1410,818,1592,902]] | 图片=['企业塔下一关灰',85]}
{找图 | 直接前往目前位置 | 循环=['F',100,1000] | 延时=1000 | 范围=[[1540,153,1592,223]] | 图片=['直接前往目前位置',85]}
{组 | '返回主页'}
)
[无限之塔标志]=(
//有红点跳出
{找图 | 企业塔无红点 | 跳出='T' | 延时=1000 | 范围=[[662,502,1057,530]] | 图片=['红点',85]}
{组 | '企业塔开关'}
)

[派遣]=(
{延时 | 1000}
{找图 | 进入前哨基地 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[370,669,466,749]] | 图片=['进入前哨基地',85]}
{找图 | 奖励 | 点击=['T',0,0,50] | 偏移=[0,-100] | 延时=3000 | 范围=[[718,275,881,415]] | 图片=['奖励',85]}
{找图 | 派遣公告栏标志 | 组=['T派遣公告栏标志'] | 延时=1000 | 范围=[[589,114,767,163]] | 图片=['派遣公告栏标志',85]}
{找图 | 进入派遣公告栏 | 点击=['T',0,0,50] | 延时=3000 | 范围=[[764,827,837,887]] | 图片=['进入派遣公告栏',85]}
{找图 | 派遣公告栏标志 | 组=['T派遣公告栏标志'] | 延时=1000 | 范围=[[589,114,767,163]] | 图片=['派遣公告栏标志',85]}
{找图 | 派遣确认 | 组=['T派遣确认'] | 延时=1000 | 范围=[[805,742,917,789]] | 图片=['派遣确认',85]}
{跳转 | '派遣'}
)
[派遣公告栏标志]=(
{找图 | 派遣全部领取 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[878,736,1012,788]] | 图片=['派遣全部领取',85]}
{找图 | 全部派遣 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[738,742,863,783]] | 图片=['全部派遣',85]}
{找图 | 全部派遣灰 | 组=['T派遣开关'] | 延时=1000 | 范围=[[732,743,861,784]] | 图片=['全部派遣灰',85]}
)
[派遣确认]=(
{找图 | 派遣确认 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[805,742,917,789]] | 图片=['派遣确认',85]}
{组 | '派遣开关'}
)

[付费商店]=(
{延时 | 1000}
//全程点红点
{找色 | 进入付费商店 | 点击=['T',0,0,50] | 偏移=[-30,30] | 延时=1000 | 范围=[[525,529,545,547]] | 颜色=['#FB0B08','3,0,#FE302F/3,3,#FD4500/0,3,#FC4400',80]}
{找色 | 普通礼包 | 点击=['T',0,0,50] | 偏移=[-30,30] | 延时=1000 | 范围=[[121,172,146,198]] | 颜色=['#FB0B08','3,0,#FE302F/3,3,#FD4500/0,3,#FC4400',80]}
{找色 | 每日每周每月 | 点击=['T',0,0,50] | 偏移=[-30,30] | 延时=1000 | 范围=[[271,234,590,254]] | 颜色=['#FB0B08','3,0,#FE302F/3,3,#FD4500/0,3,#FC4400',80]}
{找色 | 免费礼包 | 点击=['T',0,0,50] | 偏移=[-30,30] | 延时=1000 | 范围=[[119,295,181,345]] | 颜色=['#FB0B08','3,0,#FE302F/3,3,#FD4500/0,3,#FC4400',80]}
{找色 | 奖励 | 点击=['T',0,0,50] | 偏移=[0,-100] | 延时=1000 | 范围=[[718,275,881,415]] | 颜色=['#FB0B08','3,0,#FE302F/3,3,#FD4500/0,3,#FC4400',80]}
{找图 | 普通礼包标志 | 组=['T普通礼包标志'] | 延时=1000 | 范围=[[729,63,885,108]] | 图片=['普通礼包标志',85]}
{找图 | 付费商店入口 | 组=['T付费商店入口'] | 延时=1000 | 范围=[[427,541,526,580]] | 图片=['付费商店入口',85]}
{找图 | 奖励 | 点击=['T',0,0,50] | 偏移=[0,-100] | 延时=1000 | 范围=[[718,275,881,415]] | 图片=['奖励',85]}
{跳转 | '付费商店'}
)
[普通礼包标志]=(
{找色 | 普通礼包无红点 | 跳出='T' | 延时=1000 | 范围=[[121,172,146,198]] | 颜色=['#FB0B08','3,0,#FE302F/3,3,#FD4500/0,3,#FC4400',80]}
{组 | '付费商店开关'}
)
[付费商店入口]=(
{找色 | 入口无红点 | 跳出='T' | 延时=1000 | 范围=[[525,529,545,547]] | 颜色=['#FB0B08','3,0,#FE302F/3,3,#FD4500/0,3,#FC4400',80]}
{组 | '付费商店开关'}
)

[咨询]=(
{延时 | 1000}
{找图 | 进入咨询 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[1440,80,1595,137]] | 图片=['进入咨询',85]}
{找图 | 进入妮姬 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[583,795,665,888]] | 图片=['进入妮姬',85]}
{找图 | 好感等级 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[95,265,206,317]] | 图片=['好感等级',85]}
{找图 | 开始咨询 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[864,668,953,757]] | 图片=['开始咨询',85]}
{找图 | 确认 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[814,542,957,592]] | 图片=['确认',85]}
{找图 | 咨询中标志 | 点击=['T',0,0,50] | 偏移=[-100,0] | 组=['T咨询选项'] | 延时=1000 | 范围=[[1226,1,1343,47]] | 图片=['咨询中标志',85]}
{找图 | 开始咨询灰 | 点击=['T',0,0,50] | 组=['T开始咨询灰'] | 延时=1000 | 范围=[[855,660,954,759]] | 图片=['开始咨询灰',85]}

{跳转 | '咨询'}
)
[咨询选项]=(
{按键 | ['1',50]}
{延时 | 500}
{按键 | [']',50]}
)
[开始咨询灰]=(
{找图 | 咨询次数已用完 | 组=['T咨询次数已用完'] | 延时=1000 | 范围=[[710,424,880,457]] | 图片=['咨询次数已用完',85]}
{找图 | 咨询右 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[1549,356,1591,431]] | 图片=['咨询右',85]}
)
[咨询次数已用完]=(
{组 | '咨询开关'}
)

[社交点数]=(
{延时 | 1000}
{找图 | 赠送 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[889,753,975,788]] | 图片=['赠送',85]}
{找图 | 赠送灰 | 组=['T赠送灰'] | 延时=1000 | 范围=[[889,753,975,788]] | 图片=['赠送灰',85]}
{找图 | 确认 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[814,542,957,592]] | 图片=['确认',85]}
{找图 | 好友 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[1533,260,1584,326]] | 图片=['好友',85]}
{跳转 | '社交点数'}
)
[赠送灰]=(
{点击 | [20,800,50]}
{组 | '社交点数开关'}
)

[任务奖励]=(
{延时 | 1000}
{找图 | 任务界面 | 组=['T任务标志'] | 延时=1000 | 范围=[[752,69,857,123]] | 图片=['任务标志',85]}
{找图 | 奖励 | 点击=['T',0,0,50] | 偏移=[0,-100] | 延时=1000 | 范围=[[718,275,881,415]] | 图片=['奖励',85]}
//{找图|任务红点|点击=['T',0,0,50]|延时=1000|范围=[[1588,213,1588,213]]|图片=['任务红点',85]}
{找图 | 任务入口 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[1527,191,1584,256]] | 图片=['任务',85] | 开关={'任务入口'}}

{跳转 | '任务奖励'}
)
[任务标志]=(
{赋值 | [[{'任务入口'},0]]}
{找图 | 任务全部领取 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[904,799,1011,831]] | 图片=['任务全部领取',85]}
{找图 | 有奖励未领取 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[661,135,1039,162]] | 图片=['红点1','红点2',85]}
{找图 | 无任务奖励 | 组=['F无任务奖励'] | 延时=1000 | 范围=[[661,135,1039,162]] | 图片=['红点1','红点2',85]}
)
[无任务奖励]=(
{点击 | [20,800,50]}
{组 | '任务奖励开关'}
)

[邮件]=(
{延时 | 1000}
{找图 | 邮件全部领取灰 | 组=['T邮件全部领取灰'] | 延时=1000 | 范围=[[843,751,985,789]] | 图片=['邮件全部领取灰',85]}
{找图 | 奖励 | 点击=['T',0,0,50] | 偏移=[0,-100] | 延时=1000 | 范围=[[718,275,881,415]] | 图片=['奖励',85]}
{找图 | 邮件全部领取 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[836,748,988,786]] | 图片=['邮件全部领取',85]}
{找图 | 有邮件 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[1536,11,1558,32]] | 图片=['红点1','红点2',85]}
{找图 | 邮件入口 | 组=['T邮件入口'] | 延时=1000 | 范围=[[1506,6,1563,52]] | 图片=['邮件入口',85]}
{跳转 | '邮件'}
)
[邮件入口]=(
{找图 | 有邮件 | 跳出='T' | 延时=1000 | 范围=[[1536,11,1558,32]] | 图片=['红点1','红点2',85]}
{组 | '邮件开关'}
)
[邮件全部领取灰]=(
{点击 | [20,800,50]}
{组 | '邮件开关'}
)

[通行证]=(
{延时 | 1000}
//{找图|有奖励|点击=['T',0,0,50]|延时=1000|范围=[[1418,133,1443,152]]|图片=['红点','红点1','红点2','任务红点',85]}
{找色 | 通行证切换按钮红点 | 组=['T通行证切换按钮红点'] | 延时=1000 | 范围=[[1415,132,1448,152]] | 颜色=['#FB0B08','3,0,#FE302F/3,3,#FD4500/0,3,#FC4400',80]}
{找色 | 奖励和任务红点 | 组=['T奖励和任务'] | 延时=1000 | 范围=[[742,264,1038,297]] | 颜色=['#FB0B08','3,0,#FE302F/3,3,#FD4500/0,3,#FC4400',80]}
{找图 | 奖励 | 点击=['T',0,0,50] | 偏移=[0,-100] | 延时=1000 | 范围=[[718,275,881,415]] | 图片=['奖励',85]}
{找图 | 通行证升级 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[739,406,863,443]] | 图片=['通行证升级',85]}
{找图 | 通行证切换按钮 | 组=['T通行证切换按钮无红点'] | 延时=1000 | 范围=[[1401,134,1438,174]] | 图片=['通行证切换按钮',95]}
{跳转 | '通行证'}
)
[奖励和任务]=(
{找色 | 奖励和任务红点 | 点击=['T',0,0,50] | 偏移=[-100,20] | 延时=1000 | 范围=[[742,264,1038,297]] | 颜色=['#FB0B08','3,0,#FE302F/3,3,#FD4500/0,3,#FC4400',80]}
{找图 | 通行证领取 | 点击=['T',0,0,50] | 偏移=[0,50] | 延时=1000 | 范围=[[751,781,851,811]] | 图片=['通行证领取',85]}
)
[通行证切换按钮红点]=(
{找色 | 通行证切换按钮红点 | 点击=['T',0,0,50] | 偏移=[-10,10] | 延时=1000 | 范围=[[1415,132,1448,152]] | 颜色=['#FB0B08','3,0,#FE302F/3,3,#FD4500/0,3,#FC4400',80]}
{找色 | 通行证红点 | 点击=['T',0,0,50] | 偏移=[-10,10] | 延时=1000 | 范围=[[1579,115,1598,133]] | 颜色=['#FB0B08','3,0,#FE302F/3,3,#FD4500/0,3,#FC4400',80]}
)
[通行证切换按钮无红点]=(
{找图 | 通行证切换按钮 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[1401,134,1438,174]] | 图片=['通行证切换按钮',95]}
{找色 | 通行证红点 | 跳出='T' | 延时=1000 | 范围=[[1579,115,1598,133]] | 颜色=['#FB0B08','3,0,#FE302F/3,3,#FD4500/0,3,#FC4400',80]}
{找图 | 通行证切换按钮 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[1401,134,1438,174]] | 图片=['通行证切换按钮',95]}
{找色 | 通行证红点 | 跳出='T' | 延时=1000 | 范围=[[1579,115,1598,133]] | 颜色=['#FB0B08','3,0,#FE302F/3,3,#FD4500/0,3,#FC4400',80]}
{组 | '通行证开关'}
)

[自动卡主线]=(
{找图 | 野外 | 延时=2000 | 跳出='F' | 范围=[[0,9,99,49]] | 图片=['野外','地1区',85]}
//{点击|[1100,500,50]}
{点击 | [500,510,50]}

{延时 | 2000}
{找图 | 新人竞技场进入战斗 | 点击=['T',0,0,50] | 延时=1000 | 循环=['F',50,1000] | 范围=[[815,787,1051,879]] | 图片=['新人竞技场进入战斗',85]}
{找图 | 暂停 | 点击=['T',0,0,50] | 延时=1000 | 循环=['F',50,500] | 范围=[[1554,6,1602,56]] | 图片=['暂停',85]}
{找图 | 放弃战斗 | 点击=['T',0,0,50] | 延时=100 | 循环=['F',50,500] | 范围=[[623,811,781,866]] | 图片=['放弃战斗',85]}
{点击 | [10,10,50]}
{点击 | [10,10,50]}
{点击 | [10,10,50]}
{按键 | ['ESC',50]}
{按键 | ['ESC',50]}
{按键 | ['ESC',50]}
//{找图|战斗返回|点击=['T',0,0,50]|延时=1000|循环=['F',50,1000]|范围=[[9,816,136,882]]|图片=['战斗返回',85]}
)

[新人竞技场开关]=(
{组 | '返回主页'}
{赋值 | [[{'新人竞技场1'},0]]}
{赋值 | [[{'新人竞技场2'},0]]}
{赋值 | [[{'新人竞技场3'},0]]}

{计算 | [[{'新人竞技场1'},'+',{'新人竞技场2'},{'新人竞技场开关'}]]}
{计算 | [[{'新人竞技场3'},'+',{'新人竞技场开关'},{'新人竞技场开关'}]]}
{跳转 | '主界面'}
)
[特殊竞技场开关]=(
{组 | '返回主页'}
{赋值 | [[{'特殊竞技场开关'},0]]}
{跳转 | '主界面'}
)
[前哨防御领取开关]=(
{组 | '返回主页'}
{赋值 | [[{'前哨防御领取开关'},0]]}
{跳转 | '主界面'}
)
[前哨防御歼灭开关]=(
{组 | '返回主页'}
{点击 | [20,800,50]}
{赋值 | [[{'前哨防御歼灭开关'},0]]}
{跳转 | '主界面'}
)
[企业塔开关]=(
{组 | '返回主页'}
{赋值 | [[{'企业塔开关'},0]]}
{跳转 | '主界面'}
)
[派遣开关]=(
{组 | '返回主页'}
{赋值 | [[{'派遣开关'},0]]}
{跳转 | '主界面'}
)
[付费商店开关]=(
{组 | '返回主页'}
{赋值 | [[{'付费商店开关'},0]]}
{跳转 | '主界面'}
)
[咨询开关]=(
{组 | '返回主页'}
{赋值 | [[{'咨询开关'},0]]}
{跳转 | '主界面'}
)
[社交点数开关]=(
{组 | '返回主页'}
{赋值 | [[{'社交点数开关'},0]]}
{跳转 | '主界面'}
)
[任务奖励开关]=(
{组 | '返回主页'}
{赋值 | [[{'任务奖励开关'},0]]}
{跳转 | '主界面'}
)
[邮件开关]=(
{组 | '返回主页'}
{赋值 | [[{'邮件开关'},0]]}
{跳转 | '主界面'}
)
[通行证开关]=(
{组 | '返回主页'}
{赋值 | [[{'通行证开关'},0]]}
{跳转 | '主界面'}
)
[停止脚本]=(
{赋值 | [[{'脚本开关'},0]]}
{计算 | [[{'新人竞技场开关'},'+',{'脚本开关'},{'脚本开关'}]]}
{计算 | [[{'企业塔开关'},'+',{'脚本开关'},{'脚本开关'}]]}

{计算 | [[{'特殊竞技场开关'},'+',{'脚本开关'},{'脚本开关'}]]}
{计算 | [[{'前哨防御领取开关'},'+',{'脚本开关'},{'脚本开关'}]]}
{计算 | [[{'前哨防御歼灭开关'},'+',{'脚本开关'},{'脚本开关'}]]}
{计算 | [[{'派遣开关'},'+',{'脚本开关'},{'脚本开关'}]]}
{计算 | [[{'付费商店开关'},'+',{'脚本开关'},{'脚本开关'}]]}
{计算 | [[{'咨询开关'},'+',{'脚本开关'},{'脚本开关'}]]}
{计算 | [[{'社交点数开关'},'+',{'脚本开关'},{'脚本开关'}]]}
{计算 | [[{'任务奖励开关'},'+',{'脚本开关'},{'脚本开关'}]]}
{计算 | [[{'邮件开关'},'+',{'脚本开关'},{'脚本开关'}]]}
{计算 | [[{'通行证开关'},'+',{'脚本开关'},{'脚本开关'}]]}

{计算 | [[{'商店开关'},'+',{'脚本开关'},{'脚本开关'}]]}
{判断 | [[{'脚本开关'},'小于等于',0],{跳出='F'}]}
{停止 | 脚本}
)
[任务初始化]=(

{判断 | [[{'战斗开关'},'等于',0],{组=['T战斗开关']}]}
{判断 | [[{'奖励开关'},'等于',0],{组=['T奖励开关']}]}
{判断 | [[{'商店总开关'},'等于',0],{组=['T商店总开关']}]}
)
[战斗开关]=(
{赋值 | [[{'新人竞技场开关'},0]]}
{赋值 | [[{'企业塔开关'},0]]}
)
[奖励开关]=(
{赋值 | [[{'特殊竞技场开关'},0]]}
{赋值 | [[{'前哨防御领取开关'},0]]}
{赋值 | [[{'前哨防御歼灭开关'},0]]}
{赋值 | [[{'派遣开关'},0]]}
{赋值 | [[{'付费商店开关'},0]]}
{赋值 | [[{'咨询开关'},0]]}
{赋值 | [[{'社交点数开关'},0]]}
{赋值 | [[{'任务奖励开关'},0]]}
{赋值 | [[{'邮件开关'},0]]}
{赋值 | [[{'通行证开关'},0]]}
)
[商店总开关]=(
{赋值 | [[{'商店开关'},0]]}
)
[返回主页]=(
//{按键|['ESC',50]}
{找图 | 返回主页 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[107,828,180,885]] | 图片=['返回主页',85]}
{点击 | [20,800,50]}
)
[处理异常]=(

//{组|'返回主页'}
{组 | '停止脚本'}
{跳转 | '主界面'}
)