[初始化]=(
{设置分辨率 | [1618,947]}
//1为开启功能,0为关闭功能
//战斗
%新人竞技场战斗开关%=1
%新人竞技场1%={UI|新人竞技场,打1}
%新人竞技场2%={UI|新人竞技场,打2}
%新人竞技场3%={UI|新人竞技场,打3}
%特殊竞技场领取奖励开关%={UI|奖励,特殊竞技场领取奖励}
%前哨防御领取奖励开关%={UI|奖励,前哨防御领取奖励}
%前哨防御一键歼灭开关%={UI|奖励,前哨防御一键歼灭}
%企业塔开关%={UI|战斗,企业塔}
%模拟室开关%={UI|战斗,模拟室}


%自动卡主线%={UI|奖励,卡主线}


//就是利用组跳转功能,把每一个功能做成类似函数调用的效果,具体实现方式是
//1判断当前属于整个代码流程中的什么位置
//2根据当前位置,跳转进入对应的组,在组中完成当前的功能
//3跳出组,回到最开始进入组的位置,继续判断接下来轮到哪一个环节,重复2,3步骤

//然后整个代码遵循3部分结构(算上ui应该算4部分？)
//ui部分
//组判断部分(用于判断现在在哪儿,应该去哪个组)
//组处理部分(具体的功能实现写在这里)
//错误或例外情况处理




)

[UI]=(

{主窗体 | Doro启动！ | 大小=[200,200] | 按键=['运行','取消'] | 对齐模式=0}

{页面 | 分页 | 对齐模式=0 | 选项=['战斗','说明']}

{垂直布局 | 战斗 | 页面='分页.战斗' | 对齐模式=0}

{水平布局 | 水平1 | 布局='战斗' | 对齐模式=0}
{组 | 新人竞技场 | 布局='水平1' | 对齐模式=0}
{多选 | 新人竞技场 | 组='新人竞技场' | 行列=[4,3] | 对齐模式=0 | 选项=['打1','打2','打3'] | 选中=[0,1,0]}
{水平布局 | 水平2 | 布局='战斗' | 对齐模式=0}
{组 | 奖励 | 布局='水平2' | 对齐模式=0}
{多选 | 奖励 | 组='奖励' | 行列=[4,3] | 对齐模式=0 | 选项=['卡主线','特殊竞技场领取奖励','前哨防御领取奖励','前哨防御一键歼灭'] | 选中=[0,0,0,0]}
{水平布局 | 水平3 | 布局='战斗' | 对齐模式=0}
{组 | 战斗相关 | 布局='水平3' | 对齐模式=0}
{多选 | 战斗相关 | 组='战斗相关' | 行列=[4,3] | 对齐模式=0 | 选项=['企业塔','模拟室'] | 选中=[]}

{垂直布局 | 说明页 | 页面='分页.说明' | 对齐模式=0}
{标签|系统支持：WIN10及以上,显示缩放100%|布局='说明页'|对齐模式=2|样式='color:rgb(0,0,0);font-weight:600;font-size:20px;'}
{标签|游戏设定：分辨率1600*900,中文,窗口化,低画质|布局='说明页'|对齐模式=2|样式='color:rgb(0,0,0);font-weight:600;font-size:20px;'}
{标签|该脚本为免费分享,禁止售卖/用于代肝|布局='说明页'|对齐模式=2|样式='color:rgb(200,0,0);font-weight:600;font-size:20px;'}
{标签|禁止跳脸宣传,制作视频,散布群号等行为|布局='说明页'|对齐模式=2|样式='color:rgb(200,0,0);font-weight:600;font-size:20px;'}
{标签|一经发现,将停止脚本的一切后续更新,望周知|布局='说明页'|对齐模式=2|样式='color:rgb(200,0,0);font-weight:600;font-size:20px;'}
//{标签|制作人员：千夜,梅友前,歌德,四水年华,稻草人,小函,Vector383,文本,显卡,心华,正逆,茶叶团|布局='说明页'|对齐模式=8|样式='color:rgb(0,0,0);font-weight:600;font-size:20px;'}
{标签|特别鸣谢：脚本测试群的每一位成员|布局='说明页'|对齐模式=8|样式='color:rgb(0,0,0);font-weight:600;font-size:20px;'}
{标签|脚本版本号：内部开发v0.0.1适用游戏版本：v0.0.1|布局='说明页'|对齐模式=9|样式='color:rgb(0,0,0);font-weight:600;font-size:13px;'}

)


[主界面]=(
//{找图|返回主页|点击=['T',0,0,50]|延时=1000|范围=[[112,830,176,885]]|图片=['返回主页',85]}

{组 | '新人竞技场战斗' | 开关={'新人竞技场战斗开关'}}
{组 | '企业塔战斗' | 开关={'企业塔战斗开关'}}

{组 | '特殊竞技场领取奖励' | 开关={'特殊竞技场领取奖励开关'}}
{组 | '前哨防御领取奖励' | 开关={'前哨防御领取奖励开关'}}
//{组|'前哨防御一键歼灭'|开关={'前哨防御一键歼灭开关'}}

//{组|'自动卡主线'|开关={'自动卡主线'}}
{组 | '处理异常'}
)

[新人竞技场战斗]=(
{找图 | 进入方舟 | 组=['T进入方舟'] | 延时=1000 | 范围=[[1034,552,1233,667]] | 图片=['进入方舟',85]}
{找图 | 进入竞技场 | 组=['T进入竞技场'] | 延时=1000 | 范围=[[844,472,1000,650]] | 图片=['进入竞技场',85]}
{找图 | 进入新人竞技场 | 组=['T进入新人竞技场'] | 延时=1000 | 范围=[[579,453,680,520]] | 图片=['进入新人竞技场',85]}
{找图 | 新人竞技场免费战斗 | 组=['T新人竞技场免费战斗'] | 延时=1000 | 范围=[[899,458,1038,560]] | 图片=['新人竞技场免费战斗',85]}
{找图 | 新人竞技场进入战斗 | 组=['T新人竞技场进入战斗'] | 延时=1000 | 范围=[[729,722,883,768]] | 图片=['新人竞技场进入战斗',85]}
{找图 | 战斗结束标志TAB | 组=['T战斗结束标志TAB'] | 延时=1000 | 范围=[[1526,834,1590,901]] | 图片=['战斗结束标志TAB',85]}
{找图 | 新人竞技场无免费战斗 | 组=['T新人竞技场无免费战斗'] | 延时=1000 | 范围=[[652,80,981,190]] | 图片=['新人竞技场FLAG',85]}
{组 | '处理异常'}
{跳转 | '新人竞技场战斗'}
)
[进入方舟]=(
{找图 | 进入方舟 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[1034,552,1233,667]] | 图片=['进入方舟',85]}
)
[进入竞技场]=(
{找图 | 进入竞技场 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[844,472,1000,650]] | 图片=['进入竞技场',85]}
)
[进入新人竞技场]=(
{找图 | 进入新人竞技场 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[579,453,680,520]] | 图片=['进入新人竞技场',85]}
)
[新人竞技场免费战斗]=(
{找图 | 新人竞技场免费战斗1 | 组=['T新人竞技场免费战斗'] | 延时=1000 | 范围=[[899,458,1038,560]] | 图片=['新人竞技场免费战斗',85] | 开关={'新人竞技场1'}}
{找图 | 新人竞技场免费战斗2 | 组=['T新人竞技场免费战斗'] | 延时=1000 | 范围=[[899,458,1038,560]] | 图片=['新人竞技场免费战斗',85] | 开关={'新人竞技场2'}}
{找图 | 新人竞技场免费战斗3 | 组=['T新人竞技场免费战斗'] | 延时=1000 | 范围=[[899,458,1038,560]] | 图片=['新人竞技场免费战斗',85] | 开关={'新人竞技场3'}}
)
[新人竞技场进入战斗]=(
{找图 | 新人竞技场进入战斗 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[729,722,883,768]] | 图片=['新人竞技场进入战斗',85]}
)
[战斗结束标志TAB]=(
{找图 | 战斗结束标志TAB | 点击=['T',0,0,50] | 偏移=[0,-100] | 延时=1000 | 范围=[[1526,834,1590,901]] | 图片=['战斗结束标志TAB',85]}
)
[新人竞技场无免费战斗]=(
{找图 | 新人竞技场免费战斗 | 跳出='T' | 延时=1000 | 范围=[[899,458,1038,560]] | 图片=['新人竞技场免费战斗',85]}
//新人竞技场
{组 | '新人竞技场战斗开关'}
{跳转 | '主界面'}
)

[特殊竞技场领取奖励]=(
{找图 | 进入方舟 | 组=['T进入方舟'] | 延时=1000 | 范围=[[1034,552,1233,667]] | 图片=['进入方舟',85]}
{找图 | 进入竞技场 | 组=['T进入竞技场'] | 延时=1000 | 范围=[[844,472,1000,650]] | 图片=['进入竞技场',85]}
{找图 | 进入特殊竞技场 | 组=['T进入特殊竞技场'] | 延时=1000 | 范围=[[811,447,913,520]] | 图片=['进入特殊竞技场',85]}
{找图 | 特殊竞技场FLAG | 组=['T特殊竞技场FLAG'] | 延时=1000 | 范围=[[717,118,905,212]] | 图片=['特殊竞技场FLAG',85]}
{找图 | 特殊竞技场领取按钮 | 组=['T特殊竞技场领取按钮'] | 延时=1000 | 范围=[[801,775,991,854]] | 图片=['特殊竞技场领取按钮',85]}
{找图 | 特殊竞技场奖励 | 组=['T特殊竞技场奖励'] | 延时=1000 | 范围=[[746,321,854,393]] | 图片=['奖励',85]}
{组 | '处理异常'}
{跳转 | '特殊竞技场领取奖励'}
)
[进入特殊竞技场]=(
{找图 | 进入特殊竞技场 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[811,447,913,520]] | 图片=['进入特殊竞技场',85]}
)
[特殊竞技场FLAG]=(
{找图 | 特殊竞技场FLAG | 点击=['T',0,0,50] | 延时=1000 | 范围=[[717,118,905,212]] | 图片=['特殊竞技场FLAG',85]}
)
[特殊竞技场领取按钮]=(
{找图 | 特殊竞技场领取按钮 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[801,775,991,854]] | 图片=['特殊竞技场领取按钮',85]}
)
[特殊竞技场奖励]=(
{找图 | 奖励 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[746,321,854,393]] | 图片=['奖励',85]}
{组 | '特殊竞技场领取奖励开关'}
)

[前哨防御领取奖励]=(
{找图 | 进入前哨防御 | 组=['T进入前哨防御'] | 延时=1000 | 范围=[[422,727,472,773]] | 图片=['进入前哨防御',85]}
{找图 | 前哨防御获得奖励 | 组=['T前哨防御获得奖励'] | 延时=1000 | 范围=[[830,744,972,801]] | 图片=['获得奖励',85]}
{找图 | 前哨防御点击领取奖励 | 组=['T前哨防御点击领取奖励'] | 延时=1000 | 范围=[[746,321,854,393]] | 图片=['奖励',85]}
//{找图|一举歼灭|点击=['T',0,0,50]|延时=1000|范围=[[627,748,773,796]]|图片=['一举歼灭',85]}
{组 | '处理异常'}
{跳转 | '前哨防御领取奖励'}
)
[进入前哨防御]=(
{找图 | 进入前哨防御 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[422,727,472,773]] | 图片=['进入前哨防御',85]}
)
[前哨防御获得奖励]=(
{找图 | 获得奖励 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[830,744,972,801]] | 图片=['获得奖励',85]}
)
[前哨防御点击领取奖励]=(
{找图 | 奖励 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[746,321,854,393]] | 图片=['奖励',85]}
{组 | '前哨防御领取奖励开关'}
)

[企业塔战斗]=(
{找图 | 进入方舟 | 组=['T进入方舟'] | 延时=1000 | 范围=[[1034,552,1233,667]] | 图片=['进入方舟',85]}
{找图 | 进入无限之塔 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[901,369,1009,425]] | 图片=['进入无限之塔',85]}
//找红点
{找图 | 直接前往目前位置 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[1540,153,1592,223]] | 图片=['直接前往目前位置',85]}
{组 | '处理异常'}
{跳转 | '企业塔战斗'}
)
[进入无限之塔]=(
{找图 | 进入无限之塔 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[901,369,1009,425]] | 图片=['进入无限之塔',85]}
)
[企业塔无红点]=(
{组 | '企业塔战斗开关'}
)

[自动卡主线]=(
{找图 | 野外 | 延时=2000 | 跳出='F' | 范围=[[0,9,99,49]] | 图片=['野外','地1区',85]}
//{点击|[1100,500,50]}
{点击 | [1120,464,50]}

{延时 | 2000}
{找图 | 新人竞技场进入战斗 | 点击=['T',0,0,50] | 延时=1000 | 循环=['F',50,1000] | 范围=[[815,787,1051,879]] | 图片=['新人竞技场进入战斗',85]}
{找图 | 暂停 | 点击=['T',0,0,50] | 延时=1000 | 循环=['F',50,500] | 范围=[[1554,6,1602,56]] | 图片=['暂停',85]}
{找图 | 放弃战斗 | 点击=['T',0,0,50] | 延时=100 | 循环=['F',50,500] | 范围=[[623,811,781,866]] | 图片=['放弃战斗',85]}
{点击 | [10,10,50]}
{点击 | [10,10,50]}
{点击 | [10,10,50]}
{按键 | ['ESC',50]}
{按键 | ['ESC',50]}
{按键 | ['ESC',50]}
//{找图|战斗返回|点击=['T',0,0,50]|延时=1000|循环=['F',50,1000]|范围=[[9,816,136,882]]|图片=['战斗返回',85]}
)

[新人竞技场战斗开关]=(
{赋值 | [[{'新人竞技场1'},0]]}
{赋值 | [[{'新人竞技场2'},0]]}
{赋值 | [[{'新人竞技场3'},0]]}

{计算 | [[{'新人竞技场1'},'+',{'新人竞技场2'},{'新人竞技场战斗开关'}]]}
{计算 | [[{'新人竞技场3'},'+',{'新人竞技场战斗开关'},{'新人竞技场战斗开关'}]]}
{跳转 | '主界面'}
)
[特殊竞技场领取奖励开关]=(
{赋值 | [[{'特殊竞技场领取奖励开关'},0]]}
{跳转 | '主界面'}
)
[前哨防御领取奖励开关]=(
{赋值 | [[{'前哨防御领取奖励开关'},0]]}
{跳转 | '主界面'}
)
[企业塔战斗开关]=(
{赋值 | [[{'企业塔战斗开关'},0]]}
{跳转 | '主界面'}
)
[停止脚本]=(
{赋值 | [[{'脚本开关'},0]]}
{计算 | [[{'新人竞技场战斗开关'},'+',{'脚本开关'},{'脚本开关'}]]}
{计算 | [[{'特殊竞技场领取奖励开关'},'+',{'脚本开关'},{'脚本开关'}]]}
{计算 | [[{'前哨防御领取奖励开关'},'+',{'脚本开关'},{'脚本开关'}]]}

{判断 | [[{'脚本开关'},'小于等于',0],{跳出='F'}]}
{停止 | 脚本}
)
[返回主页]=(
{找图 | 返回主页 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[107,828,180,885]] | 图片=['返回主页',85]}
)
[处理异常]=(
{组 | '返回主页'}
{组 | '停止脚本'}
{跳转 | '主界面'}
)