
[初始化]=(
//致谢感谢脚本群里各位一起制作脚本的千夜,梅友前,歌德,四水年华,稻草人,小函,Vector383,文本,显卡,心华,正逆,茶叶团等大佬,以及各位群友的支持
{设置分辨率 | [1618,947]}
//1为开启功能,0为关闭功能
%升级自动换门票%={UI|初始选项,升级自动换门票}
%结算时截图%={UI|初始选项,结算时截图}
%三层开关%={UI|初始选项,3层退开关}

%EGO礼物优先级判断%={UI|EGO相关,EGO礼物优先级}
%战斗释放特定EGO%={UI|EGO相关,战斗释放特定EGO}
%第五层开始释放EGO%={UI|EGO相关,第五层开始释放EGO}
%EGO在战斗中只释放一次%={UI|EGO相关,EGO在战斗中只释放一次}

//人物是用的你上一次默认的
//刷纽本开关
%纽本开关%={UI|功能开关,纽本开关}
//刷经验本开关
%经验本开关%={UI|功能开关,经验本开关}
//刷地牢开关,
%地牢开关%={UI|功能开关,地牢开关}
//以上三个都关闭时,停止脚本
%脚本开关%=1
%选人跳过%=0

%经验本次数%={UI|经验本次数选择}
%纽本次数%={UI|纽本次数选择}
%地牢次数%={UI|地牢次数选择}
%鼠标速度%={UI|鼠标速度}

//特定选人变量
%变量_角色1_人格%={UI|下拉框_角色1_选择人格,LCB}
%变量_角色2_人格%={UI|下拉框_角色2_选择人格,LCB}
%变量_角色3_人格%={UI|下拉框_角色3_选择人格,LCB}
%变量_角色4_人格%={UI|下拉框_角色4_选择人格,LCB}
%变量_角色5_人格%={UI|下拉框_角色5_选择人格,LCB}
%变量_角色6_人格%={UI|下拉框_角色6_选择人格,LCB}
%变量_角色7_人格%={UI|下拉框_角色7_选择人格,LCB}
%变量_角色8_人格%={UI|下拉框_角色8_选择人格,LCB}
%变量_角色9_人格%={UI|下拉框_角色9_选择人格,LCB}
%变量_角色10_人格%={UI|下拉框_角色10_选择人格,LCB}
%变量_角色11_人格%={UI|下拉框_角色11_选择人格,LCB}
%变量_角色12_人格%={UI|下拉框_角色12_选择人格,LCB}

//特定选人顺序变量
%变量_角色1_优先级%={UI|下拉框_第1顺位_选择角色,LCB}
%变量_角色2_优先级%={UI|下拉框_第2顺位_选择角色,LCB}
%变量_角色3_优先级%={UI|下拉框_第3顺位_选择角色,LCB}
%变量_角色4_优先级%={UI|下拉框_第4顺位_选择角色,LCB}
%变量_角色5_优先级%={UI|下拉框_第5顺位_选择角色,LCB}
%变量_角色6_优先级%={UI|下拉框_第6顺位_选择角色,LCB}
%变量_角色7_优先级%={UI|下拉框_第7顺位_选择角色,LCB}
%变量_角色8_优先级%={UI|下拉框_第7顺位_选择角色,LCB}
%变量_角色9_优先级%={UI|下拉框_第9顺位_选择角色,LCB}
%变量_角色10_优先级%={UI|下拉框_第10顺位_选择角色,LCB}
%变量_角色11_优先级%={UI|下拉框_第11顺位_选择角色,LCB}
%变量_角色12_优先级%={UI|下拉框_第12顺位_选择角色,LCB}

//特定EGO顺序变量
%变量_EGO1_优先级%={UI|下拉框_第1顺位_选择EGO,EGO_空}
%变量_EGO2_优先级%={UI|下拉框_第2顺位_选择EGO,EGO_空}
%变量_EGO3_优先级%={UI|下拉框_第3顺位_选择EGO,EGO_空}
%变量_EGO4_优先级%={UI|下拉框_第4顺位_选择EGO,EGO_空}
%变量_EGO5_优先级%={UI|下拉框_第5顺位_选择EGO,EGO_空}
%变量_EGO6_优先级%={UI|下拉框_第6顺位_选择EGO,EGO_空}

//用于释放EGO时多点一次小头像
%头像X%=0
%头像Y%=0

%金苹果次数%=0
%液袋次数%=0
%赤眼开次数%=0
%狐雨次数%=0
%电狼兔子次数%=0
%尸体袋次数%=0
%李箱终末次数%=0
%执行次数%=0
%黑枝次数%=0

%侵蚀延时%=50
)


[UI]=(

{主窗体 | 边狱公司 | 大小=[200,200] | 按键=['运行','取消'] | 对齐模式=0}
{页面 | 分页 | 对齐模式=0 | 选项=['设置页','说明']}
{垂直布局 | 设置页 | 页面='分页.设置页' | 对齐模式=0}
{水平布局 | 水平1 | 布局='设置页' | 对齐模式=0}
{组 | 初始选项 | 布局='水平1' | 对齐模式=0}
{多选 | 初始选项 | 组='初始选项' | 行列=[4,3] | 对齐模式=0 | 选项=['升级自动换门票','结算时截图','3层退开关'] | 选中=[1,1,1]}

{水平布局 | 水平2 | 布局='设置页' | 对齐模式=0}
{组 | EGO相关 | 布局='水平2' | 对齐模式=0}
{多选 | EGO相关 | 组='EGO相关' | 行列=[4,3] | 对齐模式=0 | 选项=['EGO礼物优先级','战斗释放特定EGO','第五层开始释放EGO','EGO在战斗中只释放一次'] | 选中=[1,1,1,1]}

{水平布局 | 水平3 | 布局='设置页' | 对齐模式=0}
{组 | 功能选择 | 布局='水平3' | 对齐模式=0}
{多选 | 功能开关 | 组='功能选择' | 行列=[1,3] | 对齐模式=0 | 选项=['地牢开关','经验本开关','纽本开关'] | 选中=[]}

{水平布局 | 水平4 | 布局='设置页' | 对齐模式=0}
{组 | 镜像地牢/经验本/纽本次数选择 | 布局='水平4' | 对齐模式=0}
{网格布局 | 网格1 | 组='镜像地牢/经验本/纽本次数选择' | 对齐模式=1 | 行列=[2,3]}
{编辑框 | 地牢次数选择 | 布局='网格1' | 对齐模式=0 | 模式=0 | 提示='地牢次数'}
{编辑框 | 经验本次数选择 | 布局='网格1' | 对齐模式=0 | 模式=0 | 提示='经验本次数'}
{编辑框 | 纽本次数选择 | 布局='网格1' | 对齐模式=0 | 模式=0 | 提示='纽本次数'}

{垂直布局 | 说明页 | 页面='分页.说明' | 对齐模式=0}
{标签|系统支持：WIN10及以上,显示缩放125%|布局='说明页'|对齐模式=2|样式='color:rgb(0,0,0);font-weight:600;font-size:20px;'}
{标签|游戏设定：分辨率1600*900,日语,窗口化,低画质|布局='说明页'|对齐模式=2|样式='color:rgb(0,0,0);font-weight:600;font-size:20px;'}
{标签|该脚本为免费分享,禁止售卖/用于代肝|布局='说明页'|对齐模式=2|样式='color:rgb(200,0,0);font-weight:600;font-size:20px;'}
{标签|禁止跳脸宣传,制作视频,散布群号等行为|布局='说明页'|对齐模式=2|样式='color:rgb(200,0,0);font-weight:600;font-size:20px;'}
{标签|一经发现,将停止脚本的一切后续更新,望周知|布局='说明页'|对齐模式=2|样式='color:rgb(200,0,0);font-weight:600;font-size:20px;'}
//{标签|制作人员：千夜,梅友前,歌德,四水年华,稻草人,小函,Vector383,文本,显卡,心华,正逆,茶叶团|布局='说明页'|对齐模式=8|样式='color:rgb(0,0,0);font-weight:600;font-size:20px;'}
{标签|特别鸣谢：全自动镜本脚本测试群的每一位成员|布局='说明页'|对齐模式=8|样式='color:rgb(0,0,0);font-weight:600;font-size:20px;'}
{标签|脚本版本号：内部开发1.7.6适用游戏版本：1.16.0|布局='说明页'|对齐模式=9|样式='color:rgb(0,0,0);font-weight:600;font-size:13px;'}
//{标签|脚本版本号：1.8适用版本：1.4.0|布局='说明页'|对齐模式=9|样式='color:rgb(0,0,0);font-weight:600;font-size:13px;'}


)


[主界面]=(
//{打印变量|['地牢次数']}
{组 | '经验本准备' | 开关={'经验本开关'}}
{组 | '纽本准备' | 开关={'纽本开关'}}
{组 | '镜本准备' | 开关={'地牢开关'}}
{组 | '镜本' | 开关={'地牢开关'}}
{组 | '处理错误'}

)

[镜本]=(
{延时 | 1000}
{找图 | 重连 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[797,542,1063,627]] | 图片=['重连',85]}
{找图 | EGO礼物选择 | 组=['TEGO礼物选择'] | 延时=111 | 范围=[[1299,658,1558,795]] | 图片=['EGO礼物选择',85]}
{找图 | 选人 | 组=['T选人'] | 延时=111 | 范围=[[242,189,1361,706]] | 图片=['选人',85]}
{找图 | 首次选人 | 组=['T首次选人'] | 延时=111 | 范围=[[200,143,1403,747]] | 图片=['首次选人',80]}


{找图 | 角色EGO选择 | 组=['T角色EGO选择'] | 延时=111 | 范围=[[482,79,801,191]] | 图片=['角色EGO选择',85]}
{找图 | 结算 | 组=['T结算'] | 延时=111 | 范围=[[1198,95,1480,214],[510,125,1086,250]] | 图片=['战斗胜利','战斗败北','探查完',85]}
{找图 | 战斗选人 | 组=['T战斗选人'] | 延时=111 | 范围=[[1326,103,1463,177]] | 图片=['战斗选人',80]}
{找图 | 战斗中标志 | 组=['T战斗中标志'] | 延时=111 | 范围=[[1298,4,1594,160]] | 图片=['战斗中标志',85]}

{找图 | 商店 | 组=['T商店'] | 延时=111 | 范围=[[248,115,670,443]] | 图片=['商店',85]}
{找图 | 休息站 | 组=['T休息站'] | 延时=1000 | 范围=[[334,229,610,458]] | 图片=['休息站',85]}
{找图 | 问号 | 组=['T问号'] | 延时=111 | 范围=[[364,40,514,155]] | 图片=['问号','问号2',85]}
{找图 | 地图界面 | 组=['T地图界面'] | 延时=111 | 范围=[[1423,11,1587,173]] | 图片=['地图界面',80]}
//在后面加右下角的ego名字
{找图 | EGO_长按加速 | 组=['TEGO_长按加速'] | 延时=111 | 范围=[[1256,750,1602,906]] | 图片=['EGO_狐雨_文字','EGO_狐雨_文字2','EGO_液袋_文字','EGO_死体袋_文字','EGO_死体袋_文字2','EGO_黑枝_文字',85]}
{找图 | 三层退出 | 组=['T三层就退'] | 开关={'三层开关'} | 延时=111 | 范围=[[1168,432,1589,788]] | 图片=['七人',85]}
{跳转 | '处理错误'}
)

[镜本准备]=(
//镜像地牢
{找图 | 镜像地牢主页 | 点击=['T',0,0,50] | 跳出='F' | 延时=1000 | 范围=[[1028,751,1174,863]] | 图片=['主页1','主页2',85]}

//自动体力换门票按钮
{组 | '升级自动换门票' | 开关={'升级自动换门票'}}
//运转席
{点击 | [1096,804,50] | 延时=1000}
//入场
{点击 | [447,427,50] | 延时=1000}
//第二个镜子
{点击 | [700,427,50] | 延时=1000}


//是否重新开车
{找图 | 重新开车 | 组=['T重新开车','F开车'] | 延时=500 | 范围=[[583,445,989,659]] | 图片=['重新开车',85]}
{跳转 | '主界面'}
)
[经验本准备]=(
//自动体力换门票按钮
{组 | '升级自动换门票' | 开关={'升级自动换门票'}}

{找图 | 经验本结算 | 组=['T经验本结算'] | 延时=200 | 范围=[[1198,95,1480,214],[510,125,1086,250]] | 图片=['战斗胜利','战斗败北','探查完',85]}
{判断 | [[{'经验本次数'},'小于等于',0],{操作开关=['T',['开车准备','经验本开关',0]] | 跳出='T'}]}
{找图 | 经验本战斗中 | 组=['T经验本战斗中'] | 延时=200 | 范围=[[1298,4,1594,160]] | 图片=['战斗中标志',85]}
{找图 | 经验本准备 | 点击=['T',0,0,50] | 跳出='F' | 延时=1000 | 范围=[[1028,751,1174,863]] | 图片=['主页1','主页2',85]}
//运转席
{点击 | [1096,804,50] | 延时=1000}
//入场
{点击 | [582,213,50] | 延时=1000}
//入经验本
{点击 | [198,331,50] | 延时=1000}
//第3个经验本
{点击 | [1393,591,50] | 延时=1000}

{移动 | [300,300,10,3] | 延时=5000}
//确实5个人
{找图 | 经验本战斗选人找图 | 组=['T经验本战斗处理'] | 延时=200 | 范围=[[1300,126,1580,612]] | 图片=['经验本战斗选人找图',85]}
//{跳出|'TF'}
)

[纽本准备]=(
//自动体力换门票按钮
{组 | '升级自动换门票' | 开关={'升级自动换门票'}}

{找图 | 纽本结算 | 组=['T纽本结算'] | 延时=200 | 范围=[[1198,95,1480,214],[510,125,1086,250]] | 图片=['战斗胜利','战斗败北','探查完',85]}
{找图 | 纽本问号 | 组=['T纽本问号'] | 延时=200 | 范围=[[364,40,514,155]] | 图片=['问号','问号2',85]}
{判断 | [[{'纽本次数'},'小于等于',0],{操作开关=['T',['开车准备','经验本开关',0]] | 跳出='T'}]}
{找图 | 纽本战斗中 | 组=['T纽本战斗中'] | 延时=200 | 范围=[[1298,4,1594,160]] | 图片=['战斗中标志',85]}
{找图 | 纽本准备 | 点击=['T',0,0,50] | 跳出='F' | 延时=1000 | 范围=[[1028,751,1174,863]] | 图片=['主页1','主页2',85]}
//运转席
{点击 | [1096,804,50] | 延时=1000}
//入场
{点击 | [582,213,50] | 延时=1000}
//入纽本
{点击 | [202,434,50] | 延时=1000}
//第个1纽本
{点击 | [477,589,50] | 延时=1000}
//进入
{点击 | [853,523,50] | 延时=1000}

{移动 | [300,300,10,3] | 延时=5000}
//确实5个人
{找图 | 经验本战斗选人找图 | 组=['T经验本战斗处理'] | 延时=200 | 范围=[[1300,126,1580,612]] | 图片=['经验本战斗选人找图',85]}
//{跳出|'TF'}
)


[经验本战斗处理]=(
{找图 | 五人 | 点击=['T',1432,728,50] | 延时=5000 | 范围=[[1270,523,1560,801]] | 图片=['五人',90]}

{找图 | 经验本战斗中 | 跳转=['T经验本战斗中'] | 延时=200 | 范围=[[1298,4,1594,160]] | 图片=['战斗中标志',85] | 开关={'经验本开关'}}

{找图 | 纽本战斗中 | 跳转=['T纽本战斗中'] | 延时=200 | 范围=[[1298,4,1594,160]] | 图片=['战斗中标志',85] | 开关={'纽本开关'}}
{跳转 | '经验本战斗处理'}
)

[升级自动换门票]=(
{找色 | 体力条 | 点击=['T',0,0,50] | 跳出='F' | 延时=1000 | 范围=[[435,823,605,859]] | 颜色=['#01EF56','5,7,#01B940',80]}
//选第一页
{点击 | [636,282,50] | 延时=500}
//选全部制作
{点击 | [1007,416,50] | 延时=500}
//确认
{点击 | [958,670,50] | 延时=500}
//点击空白处
{点击 | [1380,673,50] | 延时=700}
{跳出 | 'TF'}
)

[开车]=(
//入场
{点击 | [958,602,50] | 延时=500}

{跳转 | '主界面'}

)

[重新开车]=(
//再开
{点击 | [801,494,50] | 延时=500}
{跳转 | '主界面'}
)

[小退]=(
//设置
{点击 | [1539,60,50] | 延时=500}
//小退
{点击 | [864,606,50] | 延时=500}
//确定
{点击 | [864,606,50] | 延时=500}
{跳转 | '主界面'}
)

[首次选人]=(
{找图 | 保存阵容 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[1390,16,1590,104]] | 图片=['保存阵容',80]}

{点击 | [946,615,50] | 延时=5000}

{找图 | 通用确认按钮 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[419,125,1568,871]] | 图片=['确认','确认2','买入',85]}

{跳出 | 'TF'}
)

[选人]=(
{找图 | 选人 | 跳出='F' | 延时=50 | 范围=[[242,189,1361,706]] | 图片=['选人',85]}

//1.李箱、2.浮士德、3.堂吉诃德、4.良秀、5.默尔索、6.鸿璐、7.希斯克利夫、8.以实玛利、9.罗佳、10.辛克莱、11.奥提斯、12.格里高尔

//选人时按以下顺序依次选择

{找图 | 找图_角色_第1顺位 | 点击=['T',0,0,50] | 延时=500 | 范围=[[233,177,1393,737]] | 图片=[{'变量_角色1_优先级'},85]}
{找图 | 找图_角色_第2顺位 | 点击=['T',0,0,50] | 延时=500 | 范围=[[233,177,1393,737]] | 图片=[{'变量_角色2_优先级'},85]}
{找图 | 找图_角色_第3顺位 | 点击=['T',0,0,50] | 延时=500 | 范围=[[233,177,1393,737]] | 图片=[{'变量_角色3_优先级'},85]}
{找图 | 找图_角色_第4顺位 | 点击=['T',0,0,50] | 延时=500 | 范围=[[233,177,1393,737]] | 图片=[{'变量_角色4_优先级'},85]}
{找图 | 找图_角色_第5顺位 | 点击=['T',0,0,50] | 延时=500 | 范围=[[233,177,1393,737]] | 图片=[{'变量_角色5_优先级'},85]}
{找图 | 找图_角色_第6顺位 | 点击=['T',0,0,50] | 延时=500 | 范围=[[233,177,1393,737]] | 图片=[{'变量_角色6_优先级'},85]}
{找图 | 找图_角色_第7顺位 | 点击=['T',0,0,50] | 延时=500 | 范围=[[233,177,1393,737]] | 图片=[{'变量_角色7_优先级'},85]}
{找图 | 找图_角色_第8顺位 | 点击=['T',0,0,50] | 延时=500 | 范围=[[233,177,1393,737]] | 图片=[{'变量_角色8_优先级'},85]}
{找图 | 找图_角色_第9顺位 | 点击=['T',0,0,50] | 延时=500 | 范围=[[233,177,1393,737]] | 图片=[{'变量_角色9_优先级'},85]}
{找图 | 找图_角色_第10顺位 | 点击=['T',0,0,50] | 延时=500 | 范围=[[233,177,1393,737]] | 图片=[{'变量_角色10_优先级'},85]}
{找图 | 找图_角色_第11顺位 | 点击=['T',0,0,50] | 延时=500 | 范围=[[233,177,1393,737]] | 图片=[{'变量_角色11_优先级'},85]}
{找图 | 找图_角色_第12顺位 | 点击=['T',0,0,50] | 延时=500 | 范围=[[233,177,1393,737]] | 图片=[{'变量_角色12_优先级'},85]}

//确定
{点击 | [1416,747,50] | 延时=800}
//点人
{点击 | [805,400,50] | 延时=800}


//最终确定
{点击 | [1416,747,50] | 延时=500}
{点击 | [1416,747,50] | 延时=500}

{跳转 | '镜本'}

)

[选择特定人格]=(

//LA-注:把图片的命名都改规范一点,例如'希斯克里夫_R社',这样就可以直接引用下拉框的变量(值和图片同名),在这里就只需要一次赋值就行不用做判断
//如果要增加不同同步等级的找图,可以把图片命名为'希斯克利夫_R社_1',1表示同步等级为1
//判断里面赋值,右边的值写图片名称,根据这个找图,LCB在这里没实现,不过没找到图默认选LCB,后面再优化
//另外,人格名称建议根据完整的名称命名,视觉观感更好一些(doge)

{组 | {'变量_角色1_优先级'}}
{组 | {'变量_角色2_优先级'}}
{组 | {'变量_角色3_优先级'}}
{组 | {'变量_角色4_优先级'}}
{组 | {'变量_角色5_优先级'}}
{组 | {'变量_角色6_优先级'}}
{组 | {'变量_角色7_优先级'}}
{组 | {'变量_角色8_优先级'}}
{组 | {'变量_角色9_优先级'}}
{组 | {'变量_角色10_优先级'}}
{组 | {'变量_角色11_优先级'}}
{组 | {'变量_角色12_优先级'}}
{找图 | 三层退出 | 组=['T三层就退'] | 开关={'三层开关'} | 延时=111 | 范围=[[1168,432,1589,788]] | 图片=['七人',85]}
{跳出 | 'TF'}
)



[EGO礼物优先级判断]=(
{找图 | EGO礼物选择 | 跳出='F' | 延时=50 | 范围=[[1299,658,1558,795]] | 图片=['EGO礼物选择',85]}
{移动 | [800,800,50]}
//最高优先
{找图 | 月的记忆 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['月的记忆',85]}

{找图 | 蓝色打火机 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['蓝色打火机',85] | 开关={'战斗释放特定EGO'}}
{找图 | 堕落 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['倒错症',85] | 开关={'战斗释放特定EGO'}}
{找图 | 千纸鹤 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['千纸鹤',85] | 开关={'战斗释放特定EGO'}}
{找图 | 盛大款待 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['盛大款待',85] | 开关={'战斗释放特定EGO'}}
{找图 | 雾化器 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['雾化器',85]}
{找图 | 快感 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['快感',85]}
{找图 | 暴雨 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['暴雨',85]}
{找图 | 硬币 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['硬币',85]}
{找图 | 狐雨 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['狐雨',85]}
{找图 | 绯蛾日蚀 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['绯蛾日蚀',85]}
{找图 | 卡米拉 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['卡米拉',85]}
{找图 | 最低星 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['最低星',85]}
{找图 | 石板 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['石板',85]}

{找图 | 仲冬夜的噩梦 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['真东的夜的噩梦',85]}
{找图 | 荆棘之路 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['荆棘之路',85]}
{找图 | 骸骨 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['骸骨',85]}
{找图 | 今日的表情 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['今日的表情',85]}
{找图 | 贪婪之锤 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['贪婪之锤',85]}


//金钱增长类
{找图 | 黄金壶 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['黄金壶',85]}
{找图 | 贪婪之锤 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['贪婪之锤',85]}
{找图 | 缘之碎片 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['缘之碎片',85]}

//生命回复类
{找图 | 急救箱 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['急救箱',85]}
//{找图|镇痛剂|点击=['T',0,0,50]|跳转=['TEGO礼物选择确定']|延时=200|范围=[[337,219,1264,436]]|图片=['镇痛剂',85]}
//{找图|血袋|点击=['T',0,0,50]|跳转=['TEGO礼物选择确定']|延时=200|范围=[[337,219,1264,436]]|图片=['血袋',85]}
//{找图|归途|点击=['T',0,0,50]|跳转=['TEGO礼物选择确定']|延时=200|范围=[[337,219,1264,436]]|图片=['归途',85]}
//{找图|石板|点击=['T',0,0,50]|跳转=['TEGO礼物选择确定']|延时=200|范围=[[337,219,1264,436]]|图片=['石板',85]}
//{找图|生存之道|点击=['T',0,0,50]|跳转=['TEGO礼物选择确定']|延时=200|范围=[[337,219,1264,436]]|图片=['生存之道',85]}
//{找图|偏见|点击=['T',0,0,50]|跳转=['TEGO礼物选择确定']|延时=200|范围=[[337,219,1264,436]]|图片=['偏见',85]}

//AOE类
{找图 | 灰色风衣 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['灰色风衣',85]}
{找图 | 狐雨 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['狐雨',85]}
{找图 | 绯蛾日蚀 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['绯蛾日蚀',85]}

//特殊功效类

{找图 | 硬币 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['硬币',85]}
{找图 | 卡米拉 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['卡米拉',85]}
{找图 | 水晶球 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['水晶球',85]}
{找图 | 信心 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['信心',85]}

//资源类
{找图 | 盛大款待 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['盛大款待',85] | 开关={'战斗释放特定EGO'}}
//{找图|瓶中孩童|点击=['T',0,0,50]|跳转=['TEGO礼物选择确定']|延时=200|范围=[[337,219,1264,436]]|图片=['瓶中孩童',85]|开关={'战斗释放特定EGO'}}
{找图 | 蓝色打火机 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['蓝色打火机',85] | 开关={'战斗释放特定EGO'}}
{找图 | 堕落 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['倒错症',85] | 开关={'战斗释放特定EGO'}}
{找图 | 千纸鹤 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['千纸鹤',85] | 开关={'战斗释放特定EGO'}}
//{找图|磁盘碎片|点击=['T',0,0,50]|跳转=['TEGO礼物选择确定']|延时=200|范围=[[337,219,1264,436]]|图片=['磁盘碎片',85]|开关={'战斗释放特定EGO'}}

//攻防强化增伤类
{找图 | 幻痛 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['幻痛',85]}
{找图 | 血汗泪 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['血汗泪',85]}
{找图 | 虚幻之猎 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['虚幻之猎',85]}
{找图 | 骸骨 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['骸骨',85]}
{找图 | 染血挂坠 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['染血挂坠',85]}
//{找图|电气羊|点击=['T',0,0,50]|跳转=['TEGO礼物选择确定']|延时=200|范围=[[337,219,1264,436]]|图片=['电气羊',85]}
{找图 | 今日的表情 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['今日的表情',85]}
{找图 | 大器晚成 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['大器晚成',85]}
{找图 | 特别契约 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['特别契约',85]}

//DEBUFF类

//{找图|黏糊糊淤泥|点击=['T',0,0,50]|跳转=['TEGO礼物选择确定']|延时=200|范围=[[337,219,1264,436]]|图片=['黏糊糊淤泥',85]}
//{找图|诅咒人偶|点击=['T',0,0,50]|跳转=['TEGO礼物选择确定']|延时=200|范围=[[337,219,1264,436]]|图片=['诅咒人偶',85]}

//破裂类
{找图 | 快感 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['快感',85]}
{找图 | 电池 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['电池',85]}
{找图 | 护身符 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['护身符',85]}
{找图 | 雷枝 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['雷枝',85]}
{找图 | 荆棘陷阱 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['荆棘陷阱',85]}
//{找图|损坏左轮|点击=['T',0,0,50]|跳转=['TEGO礼物选择确定']|延时=200|范围=[[337,219,1264,436]]|图片=['损坏左轮',85]}
{找图 | 蔷薇头冠 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['蔷薇头冠',85]}

//深潜类
{找图 | 融化的时针发条 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['融化的时针发条',85]}
{找图 | 头骨碎片 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['头骨碎片',85]}
{找图 | 红色指令 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['红色指令',85]}
{找图 | 荆棘之路 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['荆棘之路',85]}
{找图 | 无头肖像画 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['无头肖像画',85]}
{找图 | 仲冬夜的噩梦 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['真东的夜的噩梦',85]}
{找图 | 美的感觉 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['美的感觉',85]}
//理智伤害类
{找图 | 最低星 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['最低星',85]}

//震动类
{找图 | 震动型腕轮 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['震动型腕轮',85]}
{找图 | 融化的眼球 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['融化的眼球',85]}
{找图 | 苦艾酒 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['苦艾酒',85]}
{找图 | 辉光管 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['辉光管',85]}
{找图 | 暴雨 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['暴雨',85]}

//火类
//{找图|火的鳞片|点击=['T',0,0,50]|跳转=['TEGO礼物选择确定']|延时=200|范围=[[337,219,1264,436]]|图片=['火的鳞片',85]}
//{找图|燃烧落羽|点击=['T',0,0,50]|跳转=['TEGO礼物选择确定']|延时=200|范围=[[337,219,1264,436]]|图片=['燃烧落羽',85]}
//{找图|电路板|点击=['T',0,0,50]|跳转=['TEGO礼物选择确定']|延时=200|范围=[[337,219,1264,436]]|图片=['电路板',85]}
{找图 | 土归土 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['土归土',85]}
//{找图|烧焦圆盘|点击=['T',0,0,50]|跳转=['TEGO礼物选择确定']|延时=200|范围=[[337,219,1264,436]]|图片=['烧焦圆盘',85]}
//{找图|狱炎火蝶之梦|点击=['T',0,0,50]|跳转=['TEGO礼物选择确定']|延时=200|范围=[[337,219,1264,436]]|图片=['狱炎火蝶之梦',85]}
//{找图|尘归尘|点击=['T',0,0,50]|跳转=['TEGO礼物选择确定']|延时=200|范围=[[337,219,1264,436]]|图片=['尘归尘',85]}

//呼吸类
{找图 | 雾化器 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['雾化器',85]}
//{找图|石坟|点击=['T',0,0,50]|跳转=['TEGO礼物选择确定']|延时=200|范围=[[337,219,1264,436]]|图片=['石坟',85]}
{找图 | 烟管 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['烟管',85]}
//{找图|四叶草|点击=['T',0,0,50]|跳转=['TEGO礼物选择确定']|延时=200|范围=[[337,219,1264,436]]|图片=['四叶草',85]}
//{找图|回忆项链|点击=['T',0,0,50]|跳转=['TEGO礼物选择确定']|延时=200|范围=[[337,219,1264,436]]|图片=['回忆项链',85]}
//{找图|试剂盒|点击=['T',0,0,50]|跳转=['TEGO礼物选择确定']|延时=200|范围=[[337,219,1264,436]]|图片=['试剂盒',85]}
//{找图|明镜止水|点击=['T',0,0,50]|跳转=['TEGO礼物选择确定']|延时=200|范围=[[337,219,1264,436]]|图片=['明镜止水',85]}

//流血类
{找图 | 血棉花 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['血棉花',85]}
{找图 | 玩偶 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['玩偶',85]}
//{找图|烟与铁丝网|点击=['T',0,0,50]|跳转=['TEGO礼物选择确定']|延时=200|范围=[[337,219,1264,436]]|图片=['烟与铁丝网',85]}
{找图 | 甲虫 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['甲虫',85]}
{找图 | 生锈铁钉 | 点击=['T',0,0,50] | 跳转=['TEGO礼物选择确定'] | 延时=200 | 范围=[[337,219,1264,436]] | 图片=['生锈铁钉',85]}
//{找图|生锈美工刀|点击=['T',0,0,50]|跳转=['TEGO礼物选择确定']|延时=200|范围=[[337,219,1264,436]]|图片=['生锈美工刀',85]}


//充电类
//{找图|充电式手套|点击=['T',0,0,50]|跳转=['TEGO礼物选择确定']|延时=200|范围=[[337,219,1264,436]]|图片=['充电式手套',85]}
//{找图|避雷针|点击=['T',0,0,50]|跳转=['TEGO礼物选择确定']|延时=200|范围=[[337,219,1264,436]]|图片=['避雷针',85]}
//{找图|携带电源|点击=['T',0,0,50]|跳转=['TEGO礼物选择确定']|延时=200|范围=[[337,219,1264,436]]|图片=['携带电源',85]}
//{找图|履历书|点击=['T',0,0,50]|跳转=['TEGO礼物选择确定']|延时=200|范围=[[337,219,1264,436]]|图片=['履历书',85]}
//{找图|充电护腕|点击=['T',0,0,50]|跳转=['TEGO礼物选择确定']|延时=200|范围=[[337,219,1264,436]]|图片=['充电护腕',85]}
//{找图|夜视镜|点击=['T',0,0,50]|跳转=['TEGO礼物选择确定']|延时=200|范围=[[337,219,1264,436]]|图片=['夜视镜',85]}
//{找图|员工证|点击=['T',0,0,50]|跳转=['TEGO礼物选择确定']|延时=200|范围=[[337,219,1264,436]]|图片=['员工证',85]}


//{找图|破裂|点击=['T',0,0,50]|偏移=[0,-100]|跳转=['TEGO礼物选择确定']|延时=200|范围=[[337,219,1264,436]]|图片=['破裂',85]}


//判断是否为白棉花和水晶球

//{找图|水晶球|跳转=['TEGO礼物选择-水晶球']|延时=200|范围=[[292,188,602,700]]|图片=['水晶球',85]}
{找图 | 白棉花 | 跳转=['TEGO礼物选择-白棉花'] | 延时=200 | 范围=[[292,188,602,700]] | 图片=['白棉花',85]}

{跳出 | 'TF'}

)


[EGO礼物选择]=(
{找图 | EGO礼物选择 | 跳出='F' | 延时=50 | 范围=[[1299,658,1558,795]] | 图片=['EGO礼物选择',85]}
{组 | 'EGO礼物优先级判断' | 开关={'EGO礼物优先级判断'}}

//选第一个
{点击 | [820,353,50] | 延时=500}
{点击 | [646,353,50] | 延时=500}
{点击 | [443,353,50] | 延时=500}
{组 | 'EGO礼物选择确定'}
{跳出 | 'TF'}
)
[EGO礼物选择确定]=(
//确定EGO
{点击 | [1412,725,50] | 延时=500}
//移动鼠标到正常位置
{点击 | [1199,70,50] | 延时=500}

{跳转 | '镜本'}

)
[EGO礼物选择-白棉花]=(
{找图 | 水晶球 | 点击=['T',1140,353,50] | 延时=200 | 范围=[[641,186,949,703]] | 图片=['水晶球',85]}
//选第二个
{点击 | [810,353,50] | 延时=500}
{点击 | [810,353,50] | 延时=500}
{组 | 'EGO礼物选择确定'}
)

[EGO礼物选择-水晶球]=(
{找图 | 白棉花 | 点击=['T',1140,353,50] | 延时=200 | 范围=[[641,186,949,703]] | 图片=['白棉花',85]}
//选第二个
{点击 | [1200,353,50] | 延时=500}
{点击 | [992,353,50] | 延时=500}
{点击 | [820,353,50] | 延时=500}
{组 | 'EGO礼物选择确定'}
)

[地图界面]=(
{找图 | 地图界面 | 跳出='F' | 延时=50 | 范围=[[1423,11,1587,173]] | 图片=['地图界面',80]}
{找图 | 获得EGO | 点击=['T',0,0,50] | 延时=200 | 范围=[[621,588,989,739]] | 图片=['确认',85]}

{组 | '寻路'}
{跳转 | '镜本'}
)

[三层就退]=(
{找图 | 退回 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[24,3,424,186]] | 图片=['退回',85]}
{点击 | [1538,60,50] | 延时=1000}
{点击 | [618,541,50] | 延时=1000}
{点击 | [945,611,50] | 延时=1500}
{按键 | ['F12',50] | 开关={'结算时截图'}}
{点击 | [1444,723,50] | 延时=1000}
{点击 | [1436,733,50] | 延时=1000}
{点击 | [1069,691,50] | 延时=1000}
{点击 | [959,619,50] | 延时=1000}
{点击 | [146,800,50] | 延时=1000}
)

[寻路]=(
{延时 | 1000}
{比色 | 黑屏等待 | 延时=2000 | 颜色=['663,351,#000000/782,333,#000000/938,351,#000000/693,423,#000000/788,423,#000000/921,423,#000000/661,543,#000000/797,531,#000000/907,523,#000000',90]}
{找图 | 通用确认 | 点击=['T',0,0,500,'2L'] | 延时=1000 | 范围=[[419,125,1568,871]] | 图片=['确认','确认1','确认2',85]}
{找图 | 通用确认 | 点击=['T',0,0,500,'2L'] | 延时=1000 | 范围=[[419,125,1568,871]] | 图片=['确认','确认1','确认2',85]}

{找图 | 火车头 | 跳转=['T进门'] | 延时=200 | 范围=[[690,332,909,543]] | 图片=['火车中心',85]}
{找色 | 火车头 | 跳转=['F火车偏移'] | 延时=200 | 范围=[[120,181,615,766]] | 颜色=['#FFFF00','1,19,#7C0000/-1,33,#810000/1,45,#FFBB00/-28,86,#410000/-6,86,#040001/16,88,#F3B300/-22,110,#FFBB00/-3,111,#050101/15,112,#040001',80]}


{移动 | [817,460,{'鼠标速度'},5] | 延时=300}
{点击 | [817,460,10,'L',0,50] | 延时=300}
{找图 | 入场 | 跳转=['T入场'] | 延时=100 | 范围=[[1226,649,1558,819]] | 图片=['入场',85]}
{移动 | [1165,458,{'鼠标速度'},5] | 延时=300}
{点击 | [1165,458,10,'L',0,50] | 延时=300}
{找图 | 入场 | 跳转=['T入场'] | 延时=100 | 范围=[[1226,649,1558,819]] | 图片=['入场',85]}
{移动 | [817,165,{'鼠标速度'},5] | 延时=300}
{点击 | [817,165,10,'L',0,50] | 延时=300}
{找图 | 入场 | 跳转=['T入场'] | 延时=100 | 范围=[[1226,649,1558,819]] | 图片=['入场',85]}

{移动 | [1555,855,{'鼠标速度'},5] | 延时=300}
{点击 | [1555,855,50,'L',1] | 延时=500}
{点击 | [1555,555,50,'L',2] | 延时=1000}
{移动 | [817,720,{'鼠标速度'},5] | 延时=300}
{点击 | [817,720,10,'L',0,50] | 延时=300}
{找图 | 入场 | 跳转=['T入场'] | 延时=100 | 范围=[[1226,649,1558,819]] | 图片=['入场',85]}

{移动 | [1200,780,{'鼠标速度'},5] | 延时=300}
{点击 | [1200,780,50,'L',1] | 延时=500}
{点击 | [1550,780,50,'L',2] | 延时=1000}
{移动 | [11,360,{'鼠标速度'},5] | 延时=300}
{点击 | [11,360,10] | 延时=300}
{找图 | 入场 | 跳转=['T入场'] | 延时=100 | 范围=[[1226,649,1558,819]] | 图片=['入场',85]}
{移动 | [11,100,{'鼠标速度'},5] | 延时=300}
{点击 | [11,100,10,'L',0,50] | 延时=300}
{找图 | 入场 | 跳转=['T入场'] | 延时=100 | 范围=[[1226,649,1558,819]] | 图片=['入场',85]}
{移动 | [11,720,{'鼠标速度'},5] | 延时=300}
{点击 | [11,720,10,'L',0,50] | 延时=300}
{找图 | 入场 | 跳转=['T入场'] | 延时=100 | 范围=[[1226,649,1558,819]] | 图片=['入场',85]}

{移动 | [1555,855,{'鼠标速度'},5] | 延时=300}
{点击 | [1555,855,50,'L',1] | 延时=500}
{点击 | [1555,555,50,'L',2] | 延时=1000}
{移动 | [900,720,{'鼠标速度'},5] | 延时=300}
{点击 | [900,720,10,'L',0,50] | 延时=300}
{找图 | 入场 | 跳转=['T入场'] | 延时=100 | 范围=[[1226,649,1558,819]] | 图片=['入场',85]}

{跳转 | '小退'}
)

[火车偏移]=(
{移动 | [802,459,{'鼠标速度'},5] | 延时=400}
{点击 | [802,459,10] | 延时=400}
{找图 | 入场 | 跳转=['T入场'] | 延时=100 | 范围=[[1226,649,1558,819]] | 图片=['入场',85]}

{移动 | [806,228,{'鼠标速度'},5] | 延时=400}
{点击 | [806,228,10] | 延时=400}
{找图 | 入场 | 跳转=['T入场'] | 延时=100 | 范围=[[1226,649,1558,819]] | 图片=['入场',85]}

{移动 | [799,747,{'鼠标速度'},5] | 延时=400}
{点击 | [799,747,10] | 延时=400}
{找图 | 入场 | 跳转=['T入场'] | 延时=100 | 范围=[[1226,649,1558,819]] | 图片=['入场',85]}

{跳转 | '小退'}
)

[进门]=(
{移动 | [700,400,50,5] | 延时=400}
{找图 | 火车头 | 点击=['T',0,0,10,'L',0,500] | 延时=400 | 范围=[[690,332,909,543]] | 图片=['火车中心',85]}
{找图 | 入场 | 点击=['T',0,0,50] | 跳转=['T镜本'] | 延时=1000 | 范围=[[1226,649,1558,819]] | 图片=['入场',85]}

{移动 | [1161,460,{'鼠标速度'},5] | 延时=400}
{点击 | [1161,460,10] | 延时=400}
{找图 | 入场 | 跳转=['T入场'] | 延时=100 | 范围=[[1226,649,1558,819]] | 图片=['入场',85]}
{移动 | [466,460,{'鼠标速度'},5] | 延时=400}
{点击 | [466,460,10] | 延时=400}
{找图 | 入场 | 跳转=['T入场'] | 延时=100 | 范围=[[1226,649,1558,819]] | 图片=['入场',85]}
{移动 | [1160,230,{'鼠标速度'},5] | 延时=400}
{点击 | [1160,230,10] | 延时=400}
{找图 | 入场 | 跳转=['T入场'] | 延时=100 | 范围=[[1226,649,1558,819]] | 图片=['入场',85]}

{移动 | [1160,115,{'鼠标速度'},5] | 延时=400}
{点击 | [1160,115,10] | 延时=400}
{找图 | 入场 | 跳转=['T入场'] | 延时=100 | 范围=[[1226,649,1558,819]] | 图片=['入场',85]}

{移动 | [1159,750,{'鼠标速度'},5] | 延时=400}
{点击 | [1159,750,5] | 延时=400}
{找图 | 入场 | 跳转=['T入场'] | 延时=100 | 范围=[[1226,649,1558,819]] | 图片=['入场',85]}

{移动 | [1183,595,{'鼠标速度'},5] | 延时=400}
{点击 | [1183,595,10] | 延时=400}
{找图 | 入场 | 跳转=['T入场'] | 延时=100 | 范围=[[1226,649,1558,819]] | 图片=['入场',85]}

{移动 | [465,230,{'鼠标速度'},5] | 延时=400}
{点击 | [465,230,10] | 延时=400}
{找图 | 入场 | 跳转=['T入场'] | 延时=100 | 范围=[[1226,649,1558,819]] | 图片=['入场',85]}
{移动 | [464,750,{'鼠标速度'},5] | 延时=400}
{点击 | [464,750,5] | 延时=400}
{找图 | 入场 | 跳转=['T入场'] | 延时=100 | 范围=[[1226,649,1558,819]] | 图片=['入场',85]}

{移动 | [1148,343,{'鼠标速度'},5] | 延时=400}
{点击 | [1148,343,10] | 延时=400}
{找图 | 入场 | 跳转=['T入场'] | 延时=100 | 范围=[[1226,649,1558,819]] | 图片=['入场',85]}

{移动 | [1227,883,{'鼠标速度'},5] | 延时=400}
{点击 | [1227,883,10] | 延时=400}
{找图 | 入场 | 跳转=['T入场'] | 延时=100 | 范围=[[1226,649,1558,819]] | 图片=['入场',85]}
{跳转 | '寻路'}
)
[入场]=(
{点击 | [1425,735,30] | 延时=100}
{点击 | [1425,735,30] | 延时=100 | 开关={'选人跳过'}}
{跳转 | '镜本'}
)
[人数超过上限]=(
{点击 | [371,290,50] | 延时=200}
{点击 | [529,292,50] | 延时=200}
{点击 | [700,288,50] | 延时=200}
{点击 | [875,288,50] | 延时=200}
{点击 | [1034,288,50] | 延时=200}
{跳出 | 'TF'}
)

[战斗选人]=(
{组 | 'EGO计数重置'}
{找图 | 人数超过上限 | 组=['T人数超过上限'] | 延时=200 | 范围=[[1338,613,1452,684]] | 图片=['人多了','人又多了','人还是多了',95]}
{找图 | 战斗满员 | 点击=['T',1435,740,50] | 跳至=['T','镜本','战斗中标志'] | 延时=10000 | 范围=[[1353,629,1434,673]] | 图片=['七人','六人','五人','四人','三人',95]}
{组 | '选择特定人格'}
{点击 | [800,40,50] | 延时=500}

//保留防止识图不准
//第1个
//{找图|重新选人|点击=['F',371,290,50]|延时=100|范围=[[294,282,447,321]]|图片=['重新选人',85]}
//第2个
//{找图|重新选人|点击=['F',529,292,50]|延时=100|范围=[[456,281,613,319]]|图片=['重新选人',85]}
//第3个
//{找图|重新选人|点击=['F',700,288,50]|延时=100|范围=[[620,280,780,321]]|图片=['重新选人',85]}
//第4个
//{找图|重新选人|点击=['F',875,288,50]|延时=100|范围=[[788,280,946,319]]|图片=['重新选人',85]}
//第5个
//{找图|重新选人|点击=['F',1034,288,50]|延时=100|范围=[[954,281,1107,321]]|图片=['重新选人',85]}
//第6个
//{找图|重新选人|点击=['F',1198,287,50]|延时=100|范围=[[1106,281,1297,320]]|图片=['重新选人',85]}
//第7个
//{找图|重新选人|点击=['F',366,526,50]|延时=100|范围=[[287,530,447,588]]|图片=['重新选人',85]}
//第8个
//{找图|重新选人|点击=['F',534,517,50]|延时=100|范围=[[448,530,621,613]]|图片=['重新选人',85]}
//第9个
//{找图|重新选人|点击=['F',698,513,50]|延时=100|范围=[[623,530,791,582]]|图片=['重新选人',85]}
//战斗开始
{点击 | [1435,740,50] | 延时=500}
{找图 | 三层退出 | 组=['T三层就退'] | 开关={'三层开关'} | 延时=111 | 范围=[[1168,432,1589,788]] | 图片=['七人',85]}
{跳转 | '镜本'}
)

[战斗中标志]=(
{找图 | 战斗中标志 | 跳出='F' | 延时=10 | 范围=[[1298,4,1594,160]] | 图片=['战斗中标志',85]}
{组 | '普通战斗'}
{跳出 | 'TF'}
)

[经验本战斗中]=(
{延时 | 1000}
{找色 | 胜率 | 点击=['T',0,0,50] | 延时=200 | 范围=[[709,615,1598,774]] | 颜色=['#F8B065','14,1,#F7AF64/38,-5,#F7AF64/38,10,#F8B065/13,8,#F8B065',95]}

{找色 | 胜率 | 点击=['T',0,0,50] | 偏移=[-100,20] | 延时=200 | 范围=[[709,615,1598,774]] | 颜色=['#F8B065','14,1,#F7AF64/38,-5,#F7AF64/38,10,#F8B065/13,8,#F8B065',95]}

{找图 | T经验本结算 | 组=['T经验本结算'] | 延时=1000 | 范围=[[1198,95,1480,214],[510,125,1086,250]] | 图片=['战斗胜利','战斗败北','探查完',85]}
{跳转 | '经验本战斗中'}
)

[纽本战斗中]=(
{延时 | 1000}
{找色 | 胜率 | 点击=['T',0,0,50] | 延时=200 | 范围=[[709,615,1598,774]] | 颜色=['#F8B065','14,1,#F7AF64/38,-5,#F7AF64/38,10,#F8B065/13,8,#F8B065',95]}

{找色 | 胜率 | 点击=['T',0,0,50] | 偏移=[-100,20] | 延时=200 | 范围=[[709,615,1598,774]] | 颜色=['#F8B065','14,1,#F7AF64/38,-5,#F7AF64/38,10,#F8B065/13,8,#F8B065',95]}
{找图 | 纽本问号 | 组=['T纽本问号'] | 延时=200 | 范围=[[364,40,514,155]] | 图片=['问号','问号2',85]}
{找图 | 纽本结算 | 组=['T纽本结算'] | 延时=1000 | 范围=[[1198,95,1480,214],[510,125,1086,250]] | 图片=['战斗胜利','战斗败北','探查完',85]}
{跳转 | '纽本战斗中'}
)

[普通战斗]=(
{组 | '战斗释放特定EGO' | 开关={'战斗释放特定EGO'}}
{找色 | 胜率 | 点击=['T',0,0,50] | 偏移=[50,0] | 延时=200 | 范围=[[709,615,1598,774]] | 颜色=['#F8B065','14,1,#F7AF64/38,-5,#F7AF64/38,10,#F8B065/13,8,#F8B065',95]}
{找色 | 开始战斗 | 点击=['T',0,0,50] | 偏移=[-100,20] | 延时=200 | 范围=[[709,615,1598,774]] | 颜色=['#F8B065','14,1,#F7AF64/38,-5,#F7AF64/38,10,#F8B065/13,8,#F8B065',95]}
{找色 | 胜率 | 点击=['T',0,0,50] | 偏移=[50,0] | 延时=200 | 范围=[[709,615,1598,774]] | 颜色=['#F8B065','14,1,#F7AF64/38,-5,#F7AF64/38,10,#F8B065/13,8,#F8B065',95]}
{找色 | 开始战斗 | 点击=['T',0,0,50] | 偏移=[-100,20] | 延时=200 | 范围=[[709,615,1598,774]] | 颜色=['#F8B065','14,1,#F7AF64/38,-5,#F7AF64/38,10,#F8B065/13,8,#F8B065',95]}
{移动 | [1200,900,10]}
{找图 | 卡住退出 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[672,477,934,511]] | 图片=['卡住退出',85]}
{跳转 | '镜本'}
)

[EGO_长按加速]=(
{点击 | [1500,888,50,'L',1] | 延时=8000}
{点击 | [1500,888,50,'L',2] | 延时=100}
{跳出 | 'TF'}
)
[EGO计数重置]=(
{赋值 | [[{'金苹果次数'},0]]}
{赋值 | [[{'液袋次数'},0]]}
{赋值 | [[{'赤眼开次数'},0]]}
{赋值 | [[{'狐雨次数'},0]]}
{赋值 | [[{'电狼兔子次数'},0]]}
{赋值 | [[{'尸体袋次数'},0]]}
{赋值 | [[{'李箱终末次数'},0]]}
{赋值 | [[{'执行次数'},0]]}
{赋值 | [[{'黑枝次数'},0]]}
{跳出 | 'TF'}
)

[战斗释放特定EGO]=(

//此处预留其他战斗释放特定EGO
{找图 | 镜子第五层 | 跳出='F' | 延时=10 | 范围=[[902,365,1412,592]] | 图片=['镜子第五层','镜子第五层2','镜子第五层3',85] | 开关={'第五层开始释放EGO'}}
{组 | {'变量_EGO1_优先级'}}
{组 | {'变量_EGO2_优先级'}}
{组 | {'变量_EGO3_优先级'}}
{组 | {'变量_EGO4_优先级'}}
{组 | {'变量_EGO5_优先级'}}
{组 | {'变量_EGO6_优先级'}}
//{组|{'变量_EGO7_优先级'}}
//{组|{'变量_EGO8_优先级'}}
//{组|{'变量_EGO9_优先级'}}
//{组|{'变量_EGO10_优先级'}}
//{组|{'变量_EGO11_优先级'}}
//{组|{'变量_EGO12_优先级'}}

{跳出 | 'TF'}
)


[EGO_选择指定ego]=(
{点击 | [{'头像X'},{'头像Y'},50] | 延时=100}
{点击 | [{'头像X'},{'头像Y'},1000] | 延时=500}
{跳出 | 'TF'}
)
[EGO_金苹果]=(
{判断 | [[{'金苹果次数'},'大于等于',1],{跳出='T'}] | 开关={'EGO在战斗中只释放一次'}}
{延时 | 500}
{找色 | EGO_怠惰 | 跳出='F' | 延时=10 | 范围=[[1552,249,1557,273]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找色 | EGO_暴食 | 跳出='F' | 延时=10 | 范围=[[1552,290,1557,313]] | 颜色=['#E9B980','0,1,#E8B87F',80]}

{找图 | 格里高尔_旧G公司 | 赋值=['T',[{'头像X'},{'X'}],[{'头像Y'},{'Y'}]] | 组=['TEGO_选择指定ego'] | 范围=[[205,790,1417,871]] | 图片=['格里高尔_旧G公司_小头像1','格里高尔_旧G公司_小头像2','格里高尔_二协会_小头像',85]}

{找图 | EGO_金苹果 | 点击=['T',0,0,50,'2L'] | 计算=['T',[{'金苹果次数'},'+',1,{'金苹果次数'}]] | 延时=500 | 范围=[[4,2,1586,884]] | 图片=['EGO_金苹果',80]}
{点击 | [1500,800,50] | 延时=500}
{跳出 | 'TF'}
)

[EGO_表象]=(
{判断 | [[{'表象次数'},'大于等于',1],{跳出='T'}] | 开关={'EGO在战斗中只释放一次'}}
{延时 | 500}
{找色 | EGO_暴食 | 跳出='F' | 延时=10 | 范围=[[1552,290,1557,313]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找色 | EGO_傲慢 | 跳出='F' | 延时=10 | 范围=[[1552,371,1557,393]] | 颜色=['#E9B980','0,1,#E8B87F',80]}

{找图 | 浮士德_N公司 | 赋值=['T',[{'头像X'},{'X'}],[{'头像Y'},{'Y'}]] | 组=['TEGO_选择指定ego'] | 范围=[[205,790,1417,871]] | 图片=['浮士德_N公司_小头像1','浮士德_L公司_小头像1','浮士德_七协会_小头像',85]}

{找图 | EGO_表象 | 点击=['T',0,0,50,'2L'] | 计算=['T',[{'表象次数'},'+',1,{'表象次数'}]] | 延时=500 | 范围=[[4,2,1586,884]] | 图片=['EGO_表象',80]}
{点击 | [1500,800,50] | 延时=500}
{跳出 | 'TF'}
)

[EGO_液袋]=(
{判断 | [[{'液袋次数'},'大于等于',1],{跳出='T'}] | 开关={'EGO在战斗中只释放一次'}}
{延时 | 500}
{找色 | EGO_嫉妒 | 跳出='F' | 延时=10 | 范围=[[1552,411,1557,435]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找色 | EGO_抑郁 | 跳出='F' | 延时=10 | 范围=[[1552,330,1557,353]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找色 | EGO_涩涩 | 跳出='F' | 延时=10 | 范围=[[1552,209,1557,233]] | 颜色=['#E9B980','0,1,#E8B87F',80]}

{找图 | 浮士德_L公司 | 赋值=['T',[{'头像X'},{'X'}],[{'头像Y'},{'Y'}]] | 组=['TEGO_选择指定ego'] | 范围=[[205,790,1417,871]] | 图片=['浮士德_L公司_小头像1','浮士德_N公司_小头像1','浮士德_七协会_小头像',185]}

{找图 | 浮士德_液袋 | 点击=['T',0,0,50,'2L'] | 计算=['T',[{'液袋次数'},'+',1,{'液袋次数'}]] | 延时=500 | 范围=[[4,2,1586,884]] | 图片=['浮士德_液袋',80]}
{点击 | [1500,800,50] | 延时=500}
{跳出 | 'TF'}
)

[EGO_赤眼开]=(
{判断 | [[{'赤眼开次数'},'大于等于',1],{跳出='T'}] | 开关={'EGO在战斗中只释放一次'}}
{延时 | 500}
{找色 | EGO_暴怒 | 跳出='F' | 延时=10 | 范围=[[1552,168,1557,193]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找色 | EGO_色欲 | 跳出='F' | 延时=10 | 范围=[[1552,209,1557,233]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找色 | EGO_怠惰 | 跳出='F' | 延时=10 | 范围=[[1552,249,1557,273]] | 颜色=['#E9B980','0,1,#E8B87F',80]}

{找图 | 良秀_地狱鸡 | 赋值=['T',[{'头像X'},{'X'}],[{'头像Y'},{'Y'}]] | 组=['TEGO_选择指定ego'] | 范围=[[205,790,1417,871]] | 图片=['良秀_地狱鸡_小头像1','良秀_地狱鸡_小头像2','良秀_地狱鸡_小头像3','良秀_W公司_小头像',85]}

{找图 | EGO_赤眼开 | 点击=['T',0,0,50,'2L'] | 计算=['T',[{'赤眼开次数'},'+',1,{'赤眼开次数'}]] | 延时=500 | 范围=[[4,2,1586,884]] | 图片=['EGO_赤眼开',80]}
{点击 | [1500,800,50] | 延时=500}
{跳出 | 'TF'}
)

[EGO_狐雨]=(
{判断 | [[{'狐雨次数'},'大于等于',1],{跳出='T'}] | 开关={'EGO在战斗中只释放一次'}}
{延时 | 500}
{找色 | EGO_怠惰 | 跳出='F' | 延时=10 | 范围=[[1552,249,1557,273]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找色 | EGO_暴食 | 跳出='F' | 延时=10 | 范围=[[1552,290,1557,313]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找色 | EGO_忧郁 | 跳出='F' | 延时=10 | 范围=[[1552,330,1557,353]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找色 | EGO_傲慢 | 跳出='F' | 延时=10 | 范围=[[1552,371,1557,393]] | 颜色=['#E9B980','0,1,#E8B87F',80]}

{找图 | 李箱_檀香梅 | 赋值=['T',[{'头像X'},{'X'}],[{'头像Y'},{'Y'}]] | 组=['TEGO_选择指定ego'] | 范围=[[205,790,1417,871]] | 图片=['李箱_檀香梅_小头像_1','李箱_檀香梅_小头像_2',85]}

{找图 | EGO_狐雨 | 点击=['T',0,0,50,'2L'] | 计算=['T',[{'狐雨次数'},'+',1,{'狐雨次数'}]] | 延时=500 | 范围=[[4,2,1586,884]] | 图片=['EGO_狐雨',80]}
{点击 | [1500,800,50] | 延时=500}
{跳出 | 'TF'}
)

[EGO_电狼_兔子]=(
{判断 | [[{'电狼兔子次数'},'大于等于',1],{跳出='T'}] | 开关={'EGO在战斗中只释放一次'}}
{延时 | 500}
{找色 | EGO_暴怒 | 跳出='F' | 延时=10 | 范围=[[1552,168,1557,193]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找色 | EGO_色欲 | 跳出='F' | 延时=10 | 范围=[[1552,209,1557,233]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找色 | EGO_嫉妒 | 跳出='F' | 延时=10 | 范围=[[1552,209,1557,233]] | 颜色=['#E9B980','0,1,#E8B87F',80]}

{找图 | 希斯克里夫_R公司 | 赋值=['T',[{'头像X'},{'X'}],[{'头像Y'},{'Y'}]] | 组=['TEGO_选择指定ego'] | 范围=[[205,790,1417,871]] | 图片=['希斯克里夫_R公司_小头像1','希斯克里夫_R公司_小头像2',85]}

{找图 | EGO_电狼_兔子 | 点击=['T',0,0,50,'2L'] | 计算=['T',[{'电狼兔子次数'},'+',1,{'电狼兔子次数'}]] | 延时=500 | 范围=[[4,2,1586,884]] | 图片=['EGO_电狼_兔子',80]}
{点击 | [1500,800,50] | 延时=500}
{跳出 | 'TF'}
)
[EGO_尸体袋]=(
{判断 | [[{'尸体袋次数'},'大于等于',1],{跳出='T'}] | 开关={'EGO在战斗中只释放一次'}}
{延时 | 500}
{找色 | EGO_嫉妒 | 跳出='F' | 延时=10 | 范围=[[1552,209,1557,233]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找色 | EGO_色欲 | 跳出='F' | 延时=10 | 范围=[[1552,209,1557,233]] | 颜色=['#E9B980','0,1,#E8B87F',80]}

{找图 | 希斯克里夫_R公司 | 赋值=['T',[{'头像X'},{'X'}],[{'头像Y'},{'Y'}]] | 组=['TEGO_选择指定ego'] | 范围=[[205,790,1417,871]] | 图片=['希斯克里夫_R公司_小头像1','希斯克里夫_R公司_小头像2',85]}

{找图 | EGO_尸体袋 | 点击=['T',0,0,50,'2L'] | 计算=['T',[{'尸体袋次数'},'+',1,{'尸体袋次数'}]] | 延时=500 | 范围=[[4,2,1586,884]] | 图片=['EGO_尸体袋',80]}
{点击 | [1500,800,50] | 延时=500}
{跳出 | 'TF'}
)
[EGO_李箱终末火柴之光]=(
{判断 | [[{'李箱终末次数'},'大于等于',1],{跳出='T'}] | 开关={'EGO在战斗中只释放一次'}}
{延时 | 500}
{找色 | EGO_暴怒 | 跳出='F' | 延时=10 | 范围=[[1552,168,1557,193]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找色 | EGO_怠惰 | 跳出='F' | 延时=10 | 范围=[[1552,290,1557,313]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找色 | EGO_暴食 | 跳出='F' | 延时=10 | 范围=[[1552,290,1557,313]] | 颜色=['#E9B980','0,1,#E8B87F',80]}

{找图 | 李箱_檀香梅 | 赋值=['T',[{'头像X'},{'X'}],[{'头像Y'},{'Y'}]] | 组=['TEGO_选择指定ego'] | 范围=[[205,790,1417,871]] | 图片=['李箱_檀香梅_小头像_1','李箱_檀香梅_小头像_2',85]}
{找图 | EGO_李箱终末火柴之光 | 点击=['T',0,0,50,'2L'] | 计算=['T',[{'李箱终末次数'},'+',1,{'李箱终末次数'}]] | 延时=500 | 范围=[[4,2,1586,884]] | 图片=['EGO_李箱终末火柴之光',80]}
{点击 | [1500,800,50] | 延时=500}
{跳出 | 'TF'}
)
[EGO_执行]=(
{判断 | [[{'执行次数'},'大于等于',1],{跳出='T'}] | 开关={'EGO在战斗中只释放一次'}}
{延时 | 500}
{找色 | EGO_怠惰 | 跳出='F' | 延时=10 | 范围=[[1552,249,1557,273]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找色 | EGO_忧郁 | 跳出='F' | 延时=10 | 范围=[[1552,330,1557,353]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找色 | EGO_傲慢 | 跳出='F' | 延时=10 | 范围=[[1552,371,1557,393]] | 颜色=['#E9B980','0,1,#E8B87F',80]}

{找图 | 默尔索_N公司 | 赋值=['T',[{'头像X'},{'X'}],[{'头像Y'},{'Y'}]] | 组=['TEGO_选择指定ego'] | 范围=[[205,790,1417,871]] | 图片=['默尔索_N公司_小头像1','默尔索_N公司_小头像2','默尔索_R公司_小头像',85]}

{找图 | EGO_执行 | 点击=['T',0,0,50,'2L'] | 计算=['T',[{'执行次数'},'+',1,{'执行次数'}]] | 延时=500 | 范围=[[4,2,1586,884]] | 图片=['EGO_执行',80]}
{点击 | [1500,800,50] | 延时=500}
{跳出 | 'TF'}
)

[EGO_黑枝]=(
{判断 | [[{'黑枝次数'},'大于等于',1],{跳出='T'}] | 开关={'EGO在战斗中只释放一次'}}
{延时 | 500}
{找色 | EGO_暴食 | 跳出='F' | 延时=10 | 范围=[[1552,290,1557,313]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找色 | EGO_色欲 | 跳出='F' | 延时=10 | 范围=[[1552,209,1557,233]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找色 | EGO_忧郁 | 跳出='F' | 延时=10 | 范围=[[1552,330,1557,353]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找色 | EGO_傲慢 | 跳出='F' | 延时=10 | 范围=[[1552,371,1557,393]] | 颜色=['#E9B980','0,1,#E8B87F',80]}

{找图 | 奥提斯_七协会 | 赋值=['T',[{'头像X'},{'X'}],[{'头像Y'},{'Y'}]] | 组=['TEGO_选择指定ego'] | 范围=[[205,790,1417,871]] | 图片=['奥提斯_七协会_小头像1','奥提斯_七协会_小头像2','奥提斯_臼齿_小头像',85]}

{找图 | EGO_黑枝 | 点击=['T',0,0,50,'2L'] | 计算=['T',[{'黑枝次数'},'+',1,{'黑枝次数'}]] | 延时=500 | 范围=[[4,2,1586,884]] | 图片=['EGO_黑枝',80]}
{点击 | [1500,800,50] | 延时=500}
{跳出 | 'TF'}
)
[EGO_空]=(
{跳出 | 'TF'}
)
//此处预留其他战斗释放特定EGO

[问号]=(
{找图 | 问号 | 跳出='F' | 延时=50 | 范围=[[364,40,514,155]] | 图片=['问号','问号2',85]}
//{跳转|'问号'}
{点击 | [888,44,50] | 延时=100}
{点击 | [888,44,50] | 延时=100}
{点击 | [888,44,50] | 延时=100}
{组 | '特殊异想体事件'}
//选第一个选项
{点击 | [888,44,50] | 延时=100}
{点击 | [888,44,50] | 延时=100}
{点击 | [1119,267,50] | 延时=100}

//{点击|[1314,776,50]}
{找图 | 投硬币 | 组=['T投硬币'] | 延时=50 | 范围=[[1111,4,1349,215]] | 图片=['投硬币','投硬币2',85]}
{找色 | 红按钮 | 点击=['T',0,0,50] | 延时=500 | 范围=[[1244,704,1597,897]] | 颜色=['#A93625','-1,15,#AB3521/166,2,#973022/166,17,#8F2E20',80]}
{点击 | [1400,800,50] | 延时=500}
{找图 | 地图界面 | 组=['T地图界面'] | 延时=111 | 范围=[[1423,11,1587,173]] | 图片=['地图界面',80]}
{跳转 | '镜本'}
)

[投硬币]=(
{找图 | 非常高 | 点击=['T',0,0,50] | 偏移=[0,50] | 组=['F投硬币2'] | 延时=500 | 范围=[[40,740,758,788]] | 图片=['非常高','高','普通',85]}
{找色 | 红按钮 | 点击=['T',0,0,50] | 延时=3000 | 范围=[[1244,704,1597,897]] | 颜色=['#A93625','-1,15,#AB3521/166,2,#973022/166,17,#8F2E20',80]}
{点击 | [1400,800,50] | 延时=500}
{跳出 | 'TF'}
)
[投硬币2]=(
//选第一个人
{点击 | [100,800,50] | 延时=100}
//选第二个人
{点击 | [200,800,50] | 延时=100}
//选第三个人
{点击 | [300,800,50] | 延时=100}
{跳出 | 'TF'}
)


[纽本问号]=(
{找图 | 问号 | 跳出='F' | 延时=50 | 范围=[[364,40,514,155]] | 图片=['问号','问号2',85]}
{找图 | 问号 | 点击=['T',0,0,50] | 延时=700 | 范围=[[364,40,514,155]] | 图片=['问号','问号2',85]}

{赋值 | [[{'特殊异想体事件'},1]]}

//选第一个选项
{点击 | [1119,267,50] | 延时=500}

//skip
{点击 | [888,44,50] | 延时=500}
{找色 | 红按钮 | 点击=['T',0,0,50] | 延时=700 | 范围=[[1244,704,1597,897]] | 颜色=['#A93625','-1,15,#AB3521/166,2,#973022/166,17,#8F2E20',80]}
//skip
{点击 | [888,44,50] | 延时=500}
{找图 | 高 | 点击=['T',0,0,100] | 偏移=[0,50] | 延时=500 | 范围=[[40,740,758,788]] | 图片=['高',85]}
{找图 | 非常高 | 点击=['T',0,0,50] | 偏移=[0,50] | 延时=500 | 范围=[[40,740,758,788]] | 图片=['非常高',85]}
{找色 | 红按钮 | 点击=['T',0,0,50] | 延时=500 | 范围=[[1244,704,1597,897]] | 颜色=['#A93625','-1,15,#AB3521/166,2,#973022/166,17,#8F2E20',80]}
//选第一个人
{点击 | [100,800,50] | 延时=100}
//选第二个人
{点击 | [200,800,50] | 延时=100}
//选第三个人
{点击 | [300,800,50] | 延时=100}
//选第四个人
{点击 | [400,800,50] | 延时=100}
//选第五个人
{点击 | [500,800,50] | 延时=100}
//选第六个人
{点击 | [600,800,50] | 延时=100}

{找色 | 红按钮 | 点击=['T',0,0,50] | 延时=500 | 范围=[[1244,704,1597,897]] | 颜色=['#A93625','-1,15,#AB3521/166,2,#973022/166,17,#8F2E20',80]}
//skip
{点击 | [888,44,50] | 延时=500}
//skip
{点击 | [888,44,50] | 延时=500}
//skip
{点击 | [888,44,50] | 延时=500}
{找色 | 红按钮 | 点击=['T',0,0,50] | 延时=500 | 范围=[[1244,704,1597,897]] | 颜色=['#A93625','-1,15,#AB3521/166,2,#973022/166,17,#8F2E20',80]}
{点击 | [973,616,50] | 延时=1000}
{跳出 | 'TF'}
)

[特殊异想体事件]=(
{找图 | 妖精躲雨 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[823,311,1513,455]] | 图片=['妖精躲雨',85]}
{找图 | 清洁机器人 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[823,311,1513,455]] | 图片=['清洁机器人',85]}
{找图 | 三骷髅 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[830,79,1494,586]] | 图片=['三骷髅',85]}
{找图 | 祈祷 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[840,310,1475,436]] | 图片=['祈祷',85]}
{找图 | 运势事件 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[840,310,1475,436]] | 图片=['运势事件',85]}
{找图 | 卡米拉事件 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[839,117,1488,541]] | 图片=['卡米拉事件',85]}
{找图 | 夜视镜事件 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[852,309,1481,450]] | 图片=['夜视镜事件',95]}
{找色 | 火蛾 | 点击=['T',1135,379,50] | 延时=1000 | 范围=[[165,191,785,424]] | 颜色=['#FDFD8F','3,1,#FDFDFB/17,3,#FDFDFB/149,86,#FDFD54/170,86,#FD7B23/194,86,#FDA92B/225,79,#FDFD54/431,50,#FDFD87/443,50,#FDFDFB/471,51,#FDFDCF',80]}
{找色 | 树 | 点击=['T',1135,379,50] | 延时=1000 | 范围=[[100,106,795,581]] | 颜色=['#554597','90,2,#8587D3/205,-4,#F9DFFB/285,39,#161629/420,-12,#9F6DF3/558,-32,#27152E/273,95,#0F101E/147,138,#201F19/405,147,#1F1E19',80]}
{找图 | 强化解除 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[889,358,1171,455]] | 图片=['强化解除',85]}
//{识字|粉舞鞋|点击=['T',0,0,50]|内容=['拒否']|延时=1000|范围=[[865,321,1068,434]]}
//{找图|粉舞鞋|点击=['T',0,0,50]|延时=500|范围=[[882,340,1052,406]]|图片=['拒绝',85]}
{找图 | 粉舞鞋 | 点击=['T',1158,365,50] | 延时=1000 | 范围=[[843,121,1481,438]] | 图片=['粉舞鞋',85]}
{找图 | 日历 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[880,230,1145,293]] | 图片=['日历',85]}
{找图 | 日历 | 点击=['T',0,0,50] | 偏移=[0,50] | 延时=1000 | 范围=[[880,230,1145,293]] | 图片=['日历',85]}
{找图 | 白棉花事件 | 点击=['T',1135,379,50] | 延时=1000 | 范围=[[80,133,810,638]] | 图片=['白棉花事件',85]}
{找图 | 狐狸伞 | 点击=['T',1135,379,50] | 延时=1000 | 范围=[[154,176,684,413]] | 图片=['狐狸伞',85]}
{找图 | 蓝蛙 | 点击=['T',1135,379,50] | 延时=1000 | 范围=[[183,168,692,419]] | 图片=['蓝蛙',85]}
{找图 | 血瀑布 | 点击=['T',1135,379,50] | 延时=1000 | 范围=[[127,156,699,410]] | 图片=['血瀑布',85]}
{找图 | 笑脸 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[839,302,1507,429]] | 图片=['笑脸',85]}
{找图 | 血酒 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[840,310,1475,436]] | 图片=['血酒',85]}
{找图 | 真东的噩梦 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[840,310,1475,436]] | 图片=['真东的噩梦',85]}
//{找图|火书|点击=['T',1135,379,50]|延时=1000|范围=[[185,139,688,407]]|图片=['火书',85]}
//{找图|机器人事件|点击=['T',0,0,50]|延时=1000|范围=[[850,316,1472,426]]|图片=['机器人事件',85]}
{找图 | 猜拳 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[833,318,1481,425]] | 图片=['猜拳',85]}


{跳出 | 'TF'}
)
[休息站]=(
{点击 | [800,40,50] | 延时=500}
{点击 | [800,40,50] | 延时=500}
{点击 | [800,40,50] | 延时=500}
{点击 | [1200,300,50] | 延时=500}
{点击 | [1200,400,50] | 延时=500}
{点击 | [1200,400,50] | 延时=500}
{点击 | [1200,550,50] | 延时=500}


{组 | '退出商店'}
{跳出 | 'TF'}
)

[商店]=(
{点击 | [800,40,50] | 延时=500}
{点击 | [800,40,50] | 延时=500}
{点击 | [800,40,50] | 延时=500}

//拖动
{点击 | ['T',1508,233,50,'L',1]}
{移动 | [1507,625,10,10]}
{点击 | ['T',1507,625,50,'L',2] | 延时=1000}

//购买优先级
{找图 | 月之记忆2 | 点击=['T',0,0,50] | 组=['T购买确认'] | 延时=1000 | 范围=[[897,194,1502,639]] | 图片=['月之记忆2',85]}
{找图 | 盛大款待2 | 点击=['T',0,0,50] | 组=['T购买确认'] | 延时=1000 | 范围=[[897,194,1502,639]] | 图片=['盛大款待2',85]}

{找图 | 打火机2 | 点击=['T',0,0,50] | 组=['T购买确认'] | 延时=1000 | 范围=[[902,193,1506,641]] | 图片=['打火机2',85]}
{找图 | 瓶中婴儿2 | 点击=['T',0,0,50] | 组=['T购买确认'] | 延时=1000 | 范围=[[902,193,1506,641]] | 图片=['瓶中婴儿2',85]}
{找图 | 急救包2 | 点击=['T',0,0,50] | 组=['T购买确认'] | 延时=1000 | 范围=[[902,193,1506,641]] | 图片=['急救包2',85]}
{找图 | 镇痛剂2 | 点击=['T',0,0,50] | 组=['T购买确认'] | 延时=1000 | 范围=[[897,191,1530,646]] | 图片=['镇痛剂2',85]}
{找图 | 偏见2 | 点击=['T',0,0,50] | 组=['T购买确认'] | 延时=1000 | 范围=[[886,207,1529,641]] | 图片=['偏见2',85]}
{找图 | 生存之道2 | 点击=['T',0,0,50] | 组=['T购买确认'] | 延时=1000 | 范围=[[897,194,1484,638]] | 图片=['生存之道2',85]}
{找图 | 归路2 | 点击=['T',0,0,50] | 组=['T购买确认'] | 延时=1000 | 范围=[[897,194,1484,638]] | 图片=['归路2',85]}
{找图 | 特别契约2 | 点击=['T',0,0,50] | 组=['T购买确认'] | 延时=1000 | 范围=[[897,194,1484,638]] | 图片=['特别契约2',85]}
{找图 | 呼吸2 | 点击=['T',0,0,50] | 组=['T购买确认'] | 延时=1000 | 范围=[[897,194,1484,638]] | 图片=['呼吸2',85]}
{找图 | 充电手套2 | 点击=['T',0,0,50] | 组=['T购买确认'] | 延时=1000 | 范围=[[903,195,1488,638]] | 图片=['充电手套2',85]}
{找图 | 幻肢痛2 | 点击=['T',0,0,50] | 组=['T购买确认'] | 延时=1000 | 范围=[[897,194,1484,638]] | 图片=['幻肢痛2',85]}
{找图 | 白棉花2 | 移动=['T',0,0,10] | 组=['T退出商店'] | 延时=1000 | 范围=[[1235,366,1341,394]] | 图片=['白棉花2',85]}
//如果不是soldout或者不足,就买
{找图 | 倒数第一个道具 | 组=['F倒数第一个道具'] | 延时=200 | 范围=[[1269,513,1410,615]] | 图片=['道具售空','货币不足',85]}
{找图 | 倒数第二个道具 | 组=['F倒数第二个道具'] | 延时=200 | 范围=[[975,508,1127,616]] | 图片=['道具售空','货币不足',85]}
{找图 | 倒数第三个道具 | 组=['F倒数第三个道具'] | 延时=200 | 范围=[[1270,306,1410,409]] | 图片=['道具售空','货币不足',85]}

{组 | '退出商店'}
{跳出 | 'TF'}
)

[倒数第一个道具]=(
{点击 | [1450,500,50] | 延时=500}
{组 | '购买确认'}
{跳出 | 'TF'}
)
[倒数第二个道具]=(
{点击 | [1150,500,50] | 延时=500}
{组 | '购买确认'}
{跳出 | 'TF'}
)
[倒数第三个道具]=(
{点击 | [1450,300,50] | 延时=500}
{组 | '购买确认'}
{跳出 | 'TF'}
)
[购买确认]=(
//确认
{点击 | [1450,270,50] | 延时=500}
{点击 | [1450,270,50] | 延时=500}
{点击 | [1450,270,50] | 延时=500}
{点击 | [1450,270,50] | 延时=500}
{找色 | 红按钮 | 点击=['T',0,0,50] | 延时=500 | 范围=[[1244,704,1597,897]] | 颜色=['#A93625','-1,15,#AB3521/166,2,#973022/166,17,#8F2E20',80]}
{跳出 | 'TF'}
)

[退出商店]=(
{找色 | 红按钮 | 点击=['T',0,0,50] | 延时=500 | 范围=[[1244,704,1597,897]] | 颜色=['#A93625','-1,15,#AB3521/166,2,#973022/166,17,#8F2E20',80]}
{找图 | 通用确认 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[419,125,1568,871]] | 图片=['确认','确认2',85]}
{跳出 | 'TF'}
)

[经验本结算]=(
{打印变量 | ['经验本次数']}
{计算 | [[{'经验本次数'},'-',1,{'经验本次数'}]]}
{判断 | [[{'经验本次数'},'小于等于',0],{赋值=['T',[{'经验本开关'},0]] | 操作开关=['T',['主界面','经验本开关',0]]}]}
//确认
{点击 | [1451,730,50] | 延时=2000}
//退出
{点击 | [129,62,50] | 延时=1000}
//退出
{点击 | [129,62,50] | 延时=1000}
//主界面
//{点击|[842,810,50]|延时=1000}

{比色 | 主页 | 跳转=['T主界面','F处理错误'] | 延时=200 | 颜色=['1542,863,#3B0000/1159,861,#3E0000/901,858,#3E0000',90]}
//{跳出|'TF'}
)

[纽本结算]=(
{打印变量 | ['纽本次数']}
{计算 | [[{'纽本次数'},'-',1,{'纽本次数'}]]}
{判断 | [[{'纽本次数'},'小于等于',0],{赋值=['T',[{'纽本开关'},0]] | 操作开关=['T',['主界面','纽本开关',0]]}]}
//确认
{点击 | [1451,730,50] | 延时=2000}
//退出
{点击 | [129,62,50] | 延时=1000}
//退出
{点击 | [129,62,50] | 延时=1000}

{比色 | 主页 | 跳转=['T主界面','F处理错误'] | 延时=200 | 颜色=['1542,863,#3B0000/1159,861,#3E0000/901,858,#3E0000',90]}
)

[结算]=(
{找图 | 结算 | 跳出='F' | 延时=50 | 范围=[[1198,95,1480,214],[510,125,1086,250]] | 图片=['战斗胜利','战斗败北','探查完',85]}
{打印变量 | ['地牢次数']}
{计算 | [[{'地牢次数'},'-',1,{'地牢次数'}]]}
{判断 | [[{'地牢次数'},'小于等于',0],{赋值=['T',[{'地牢开关'},0]] | 操作开关=['T',['主界面','地牢开关',0]]}]}
{按键 | ['F12',50] | 开关={'结算时截图'}}
{延时 | 500}
//确认
{点击 | [1451,730,50] | 延时=1000}
//确认
{点击 | [1451,730,50] | 延时=1000}

//收取报酬
{找图 | 确认领取 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[921,639,1218,746]] | 图片=['确认领取',85]}
//确认报酬
{点击 | [950,620,50] | 延时=1000}
//确认报酬
{点击 | [800,600,50] | 延时=1000}
//{跳转|'主界面'}
{跳出 | 'TF'}
)

[处理错误]=(
{找图 | 重连 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[797,542,1063,627]] | 图片=['重连',85]}
{找图 | 地图界面 | 组=['T地图界面'] | 延时=200 | 范围=[[1491,80,1587,163]] | 图片=['地图界面',80]}
{找图 | 通用确认按钮 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[419,125,1568,871]] | 图片=['确认','确认2',85]}
{找图 | 入场 | 点击=['T',0,0,50] | 组=['T镜本'] | 延时=200 | 范围=[[1226,649,1558,819]] | 图片=['入场',85]}
{找色 | i | 点击=['T',115,50,50] | 延时=1000 | 范围=[[169,25,454,106]] | 颜色=['#E9C99F','10,-1,#54483A/19,-1,#E9C99F/24,-1,#E9C99F/30,-1,#E9C99F/38,-1,#786752/48,1,#E9C99F/60,-3,#E9C99F/72,2,#000000/80,2,#000000',80]}
{找图 | 问号 | 组=['T问号'] | 延时=200 | 范围=[[364,40,514,155]] | 图片=['问号','问号2',85]}
{找图 | 退回 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[5,8,300,150]] | 图片=['退回',95]}
{找图 | 活动关闭 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[1026,11,1596,553]] | 图片=['活动关闭',85]}
{组 | '停止脚本'}
{跳转 | '主界面'}
)


[停止脚本]=(
{赋值 | [[{'脚本开关'},0]]}
{计算 | [[{'地牢开关'},'+',{'经验本开关'},{'脚本开关'}]]}
{计算 | [[{'纽本开关'},'+',{'脚本开关'},{'脚本开关'}]]}

{判断 | [[{'脚本开关'},'小于等于',0],{跳出='F'}]}
{停止 | 脚本}
)

[李箱]=(
{找图 | 李箱 | 点击=['T',0,0,50] | 延时=300 | 范围=[[73,103,1281,538]] | 图片=[{'变量_角色1_人格'},85]}
{跳出 | 'TF'}
)
[浮士德]=(
{找图 | 浮士德 | 点击=['T',0,0,50] | 延时=300 | 范围=[[73,103,1281,538]] | 图片=[{'变量_角色2_人格'},85]}
{跳出 | 'TF'}
)
[堂吉诃德]=(
{找图 | 堂吉诃德 | 点击=['T',0,0,50] | 延时=300 | 范围=[[73,103,1281,538]] | 图片=[{'变量_角色3_人格'},85]}
{跳出 | 'TF'}
)
[良秀]=(
{找图 | 良秀 | 点击=['T',0,0,50] | 延时=300 | 范围=[[73,103,1281,538]] | 图片=[{'变量_角色4_人格'},85]}
{跳出 | 'TF'}
)
[默尔索]=(
{找图 | 默尔索 | 点击=['T',0,0,50] | 延时=300 | 范围=[[73,103,1281,538]] | 图片=[{'变量_角色5_人格'},85]}
{跳出 | 'TF'}
)
[鸿璐]=(
{找图 | 鸿璐 | 点击=['T',0,0,50] | 延时=300 | 范围=[[73,103,1281,538]] | 图片=[{'变量_角色6_人格'},85]}
{跳出 | 'TF'}
)
[鸿璐]=(
{找图 | 鸿璐 | 点击=['T',0,0,50] | 延时=300 | 范围=[[73,103,1281,538]] | 图片=[{'变量_角色6_人格'},85]}
{跳出 | 'TF'}
)
[希斯克里夫]=(
{找图 | 希斯克利夫 | 点击=['T',0,0,50] | 延时=300 | 范围=[[73,103,1281,538]] | 图片=[{'变量_角色7_人格'},85]}
{跳出 | 'TF'}
)
[以实玛利]=(
{找图 | 以实玛利 | 点击=['T',0,0,50] | 延时=300 | 范围=[[73,103,1281,538]] | 图片=[{'变量_角色8_人格'},85]}
{跳出 | 'TF'}
)
[罗佳]=(
{找图 | 罗佳 | 点击=['T',0,0,50] | 延时=300 | 范围=[[73,103,1281,538]] | 图片=[{'变量_角色9_人格'},85]}
{跳出 | 'TF'}
)
[辛克莱]=(
{找图 | 辛克莱 | 点击=['T',0,0,50] | 延时=300 | 范围=[[73,103,1281,538]] | 图片=[{'变量_角色10_人格'},85]}
{跳出 | 'TF'}
)
[奥提斯]=(
{找图 | 奥提斯 | 点击=['T',0,0,50] | 延时=300 | 范围=[[73,103,1281,538]] | 图片=[{'变量_角色11_人格'},85]}
{跳出 | 'TF'}
)
[格里高尔]=(
{找图 | 格里高尔 | 点击=['T',0,0,50] | 延时=300 | 范围=[[73,103,1281,538]] | 图片=[{'变量_角色12_人格'},85]}
{跳出 | 'TF'}
)

