[初始化]=(
//本自动化完全免费,且不接受任何赞助,请你谨防上当受骗

//使用前请将鼠标放置在游戏界面上按下CTRL+B绑定窗口句柄,程序开关为CTRL+R

//本自动化优先维护[日文]界面,使用时请尽量调整游戏界面为[日文]界面
//本自动化的汉化兼容模式处于测试环节

//如果运行时出现没有鼠标动作请检查：
//1.是否没有使用前台截图
//2.文件位置是否放置于同一目录下
//3.使用的是正确版本的图包,即img文件夹
//4.尝试使用管理员启动和重新启动计算机
//5.重新下载/解压一个编辑器

//如果出现绑定快捷键无法生效请[管理员启动]
//不点击退出事件按钮请检查屏幕是否设置了HDR/护眼模式
//如果鼠标点击一个位置不会移动请查看是否没有使用鼠标前台

//如果游戏加载时间长可以考虑使用加速器
//编辑器会自动调节窗口大小,请保持游戏窗口页面无遮挡。如果出现问题请优先检查该项目

//以下为生效程序,请注意不要键入字符
{设置分辨率 | [1618,947]}
//{全分辨率|开发分辨率=[1618,947]}
%升级自动换门票%={UI|初始选项,升级自动换脑啡肽模块}
%结算时截图%={UI|初始选项,结算时截图}
%死亡重开%={UI|初始选项,死亡重开}
%队伍轮换%={UI|队伍轮换,启用}
%开局重新选人%={UI|初始选项,开局重新选人}
%开局重新选人2%=0
%战斗释放特定EGO%=0
%第五层开始释放EGO%={UI|EGO相关,第五层开始释放EGO}
%第五层开始释放EGO2%=0
%EGO在战斗中只释放一次%={UI|EGO相关,EGO在战斗中只释放一次}
%低血量使用EGO%={UI|EGO相关,低血量使用EGO}

//刷纽本开关
%纽本开关%={UI|功能开关,纽本开关}
//刷经验本开关
%经验本开关%={UI|功能开关,经验本开关}
//刷地牢开关
%地牢开关%={UI|功能开关,地牢开关}
//一次日常
%一次日常%={UI|功能开关,一次日常}
%一折抽卡%={UI|一折抽卡,启用}
%体力购买%={UI|体力购买,启用}
%邮箱%={UI|邮箱,启用}
%每日任务开关%=0
%周常奖励%=0
%周常奖励1%=0
//预计楼层
%三层退%={UI|预定层数,三层退}
%四层退%={UI|预定层数,四层退}

//队伍抗性编队
%第一次经验本%=1
%第一次纽本%=1
%斩击经验%=0
%突刺经验%=0
%打击经验%=0
%斩击经验拉条%={UI|经验拉条开关,斩}
%突刺经验拉条%={UI|经验拉条开关,刺}
%打击经验拉条%={UI|经验拉条开关,打}
%斩击拉条回合%={UI|斩击本}
%突刺拉条回合%={UI|突刺本}
%打击拉条回合%={UI|打击本}
%愤怒纽%=0
%色欲纽%=0
%怠惰纽%=0
%暴食纽%=0
%忧郁纽%=0
%傲慢纽%=0
%嫉妒纽%=0
%纽本单通变量%=0
%十罗单通铜牛%={UI|纽特殊开关,十罗单通铜牛}
%队伍X%=10
%队伍Y%=10

%脚本开关%=1
//额外选项
%选人跳过%={UI|选人跳过,启用}
%找图寻路%={UI|找图寻路,启用}
%道中模式2%={UI|道中战斗模式,普通}
%循环模式1%={UI|战斗循环模式,普通}
%循环模式2%={UI|战斗循环模式,识图}
%自动拉条五人%={UI|队伍人数,五人}
%自动拉条六人%={UI|队伍人数,六人}
%拉条变量%=0
%自动拉条1%=0
%自动拉条2%=0
%五点自动日常%={UI|五点自动日常,启用}
%使用单次加成%={UI|每周加成使用,单次}
%不使用加成%={UI|每周加成使用,不用}
%取消商店%={UI|取消商店,启用}
%战斗时检测%={UI|战斗时检测,启用}
%经验本次数%={UI|经验本次数选择}
%纽本次数%={UI|纽本次数选择}
%地牢次数%={UI|地牢次数选择}

%地牢完成次数2%={UI|轮换初始队伍}
%轮换队伍数量%={UI|轮换队伍数量}

%地牢完成次数%=0
%地牢次数统计%=0
//结算
%不领取奖励%={UI|特殊设置,不领取奖励}
%存储一局%={UI|特殊设置,存储一局}
%取消战斗报酬%={UI|特殊设置,取消战斗报酬}
//
%重选变量%=0
%选人偏移值%=0
%选EGO礼物偏移值%=0
//特定选人顺序变量
%变量_角色1_优先级%={UI|下拉框_第1顺位_选择角色,空}
%变量_角色2_优先级%={UI|下拉框_第2顺位_选择角色,空}
%变量_角色3_优先级%={UI|下拉框_第3顺位_选择角色,空}
%变量_角色4_优先级%={UI|下拉框_第4顺位_选择角色,空}
%变量_角色5_优先级%={UI|下拉框_第5顺位_选择角色,空}
%变量_角色6_优先级%={UI|下拉框_第6顺位_选择角色,空}
%变量_角色7_优先级%={UI|下拉框_第7顺位_选择角色,空}
%变量_角色8_优先级%={UI|下拉框_第8顺位_选择角色,空}
%变量_角色9_优先级%={UI|下拉框_第9顺位_选择角色,空}
%变量_角色10_优先级%={UI|下拉框_第10顺位_选择角色,空}
%变量_角色11_优先级%={UI|下拉框_第11顺位_选择角色,空}
%变量_角色12_优先级%={UI|下拉框_第12顺位_选择角色,空}

//特定EGO顺序变量
%变量_EGO1_优先级%={UI|下拉框_第1顺位_选择EGO,EGO_空}
%变量_EGO2_优先级%={UI|下拉框_第2顺位_选择EGO,EGO_空}
%变量_EGO3_优先级%={UI|下拉框_第3顺位_选择EGO,EGO_空}
%变量_EGO4_优先级%={UI|下拉框_第4顺位_选择EGO,EGO_空}
%变量_EGO5_优先级%={UI|下拉框_第5顺位_选择EGO,EGO_空}
%变量_EGO6_优先级%={UI|下拉框_第6顺位_选择EGO,EGO_空}
%第五层释放ego%=0
%第五层释放ego-输出%={UI|第五层释放ego种类,输出型}
%第五层释放ego-回复%={UI|第五层释放ego种类,回复型}
%低血量释放ego%=0
%低血量释放ego-输出%={UI|低血量释放ego种类,输出型}
%低血量释放ego-回复%={UI|低血量释放ego种类,回复型}
%输出型ego释放%=0
%回复型ego释放%=0
%第四层释放ego-道中%={UI|第四层释放ego场景,道中作战}
%第四层释放ego-集中%={UI|第四层释放ego场景,集中作战}
//EGO礼物选择优先级
%变量_礼物1_优先级%={UI|下拉框_第1顺位_选择礼物,礼物_空}
%变量_礼物2_优先级%={UI|下拉框_第2顺位_选择礼物,礼物_空}

%物理优先%=0
%物理优先1%={UI|礼物优先}

%物理%={UI|物理}
//%体系优先%={UI|礼物优先,体系}
%第一个礼物%={UI|开局礼物选择,第一个礼物}
%第二个礼物%={UI|开局礼物选择,第二个礼物}
%第三个礼物%={UI|开局礼物选择,第三个礼物}
//ego礼物选择
%资源类%={UI|道中礼物设置,资源类选择}
%回复类%={UI|道中礼物设置,回复类选择}
%经济类%={UI|道中礼物设置,经济类选择}
%顺位二%={UI|道中礼物设置,顺位二选择}
%顺位一%=1
%顺位一最高优先%={UI|测试功能,顺位一最高优先}
//合成
//%未命名开关1%=0
//%未命名开关2%=0
%合成体系1%={UI|合成体系1,合成_礼物_空}
%合成体系2%={UI|合成体系2,合成_礼物_空}
%合成避开同体系饰品%={UI|合成避开同体系饰品,启用}
%一号位合成%=1
%二号位合成%=1
%坐标X%=0
%坐标Y%=0
%礼物坐标X1%=0
%礼物坐标X2%=0
%礼物坐标X3%=0
%礼物坐标X4%=0
%礼物坐标X5%=0
%礼物坐标X6%=0
%礼物坐标X7%=0
%礼物坐标X8%=0
%选择变量%=0
%选择变量1%=0
%选择变量2%=0
%困难选择%=0
%先选三级%=0
%没有体系%=0
//楼层判断
%节点数%=0
%层数%=0
%选择了楼层卡包%=0
%卡包刷新%=0
%卡包刷新次数%=0
%第一层%=0
%第二层%=0
%第三层%=0
%第四层%=0
%第五层%=0
%战斗报酬选择了礼物%=0
%二层无鸡重开%={UI|测试功能,困牢二层无鸡重开}
//商店
%商店已刷新次数%=0
%商店刷新次数%={UI|商店刷新次数}
%商店刷新%={UI|商店刷新开关,启用}

%经费刷新%={UI|刷新模式,经费刷新}
%定向刷新%={UI|刷新模式,定向刷新}
//商店技能组
%商店技能组%={UI|商店技能组,启用}
%技能组1%={UI|罪人选择1,空}
%技能组2%={UI|罪人选择2,空}
%技能组3%={UI|罪人选择3,空}
%技能组4%={UI|罪人选择4,空}
%技能组5%={UI|罪人选择5,空}
%技能组6%={UI|罪人选择6,空}

%商店回血%={UI|商店回血,启用}
%四级饰品合成%={UI|四级饰品合成,启用合成}
%不合成公式四级%={UI|四级饰品合成,禁公式四级}
%层数变量%=0
%合成用变量%=0
%合成完了%=0
%合成完了1%=0
%合成完了2%=0
%没合成完%=0
%二级饰品%=0
%三级饰品%=1
%选择三级%=0
%合成-福袋%=0
%合成-血雾%=0
%合成-镇魂%=0
%合成-黑色乐谱%=0
%合成-足迹%=0
%合成-恍惚%=0
%合成-震颤耦合%=0
%合成-永动机%=0
%合成-虔诚%=0
%合成-烹饪秘诀书%=0
%合成-追忆%=0
%困难-血雾%=0

%体系合成%=0
//用于释放EGO时多点一次小头像
%头像X%=0
%头像Y%=0
//EGO释放次数
%金苹果次数%=0
%表象次数%=0
%液袋次数%=0
%赤眼开次数%=0
%狐雨次数%=0
%电狼兔子次数%=0
%尸体袋次数%=0
%李箱终末次数%=0
%执行次数%=0
%黑枝次数%=0
%罗佳执行次数%=0
%盲目次数%=0
%辛克莱提灯次数%=0
%侵蚀蜜卡拉次数%=0
%蜜卡拉次数%=0
%希斯克利夫束缚次数%=0
%奥提斯束缚次数%=0
%罗佳诅咒钉次数%=0
%Num%=1
%Num2%=0
%层数判定%=1

%坐标X1%=0
%坐标Y1%=0
%坐标X2%=0
%坐标Y2%=0
%坐标X3%=0
%坐标Y3%=0
%坐标X4%=0
%坐标Y4%=0
%坐标X5%=0
%坐标Y5%=0
//自动拉条
%仪表盘1%=710
%仪表盘2%=710
%仪表盘3%=710
%仪表盘4%=710
%仪表盘5%=710
%仪表盘6%=710
%仪表盘7%=710
%仪表盘8%=710
%仪表盘9%=710
%仪表盘10%=710
%仪表盘11%=710
%仪表盘12%=710

//%困难战斗避开%=1
//%寻路遍数%=0
//%侵蚀延时%=50

//日常设置
%纽最高级%={UI|单选_纽本_选择关卡,最高级}
%纽次级%={UI|单选_纽本_选择关卡,次级}
%纽最次级%={UI|单选_纽本_选择关卡,最次级}

%最高级%={UI|单选_经验本_选择关卡,最高级}
%次级%={UI|单选_经验本_选择关卡,次级}
%最次级%={UI|单选_经验本_选择关卡,最次级}

%镜本普通%={UI|单选_镜本_选择关卡,普通}
%镜本困难%={UI|单选_镜本_选择关卡,困难}

//开发者页
%商店截图%={UI|截图,商店截图}
%选择截图%={UI|截图,选择截图}
%卡包截图%={UI|截图,卡包截图}
%反转%=0

//商店开关
%烧伤%=0
%流血%=0
%震颤%=0
%破裂%=0
%沉沦%=0
%呼吸%=0
%充能%=0
%烧伤1%=0
%流血1%=0
%震颤1%=0
%破裂1%=0
%沉沦1%=0
%呼吸1%=0
%充能1%=0
%烧伤2%=0
%流血2%=0
%震颤2%=0
%破裂2%=0
%沉沦2%=0
%呼吸2%=0
%充能2%=0
%斩击%=0
%突刺%=0
%打击%=0
%无物理体系%=0

%房间数%=0
%初始礼物升级完毕%=0
%确认次数%=0
%死亡人数%=0
%困难战斗%=0
//升级范围坐标
%升级范围坐标X1%=0
%升级范围坐标Y1%=0
%升级范围坐标X2%=0
%升级范围坐标Y2%=0
%合成范围坐标X1%=0
%合成范围坐标Y1%=0
%合成范围坐标X2%=0
%合成范围坐标Y2%=0

%点了%=0
%第二页%=0
%战斗问号%=0

%商店范围坐标X1%=0
%商店范围坐标Y1%=0
%商店范围坐标X2%=0
%商店范围坐标Y2%=0
%买过了%=0
%脏东西%=0
%超级商店%=1
%赋值%=1
%全灭重开%={UI|全灭重开,启用}
//一次日常
%一次日常设置经验本次数%={UI|下拉框_一次日常经验本次数}
%一次日常设置纽本次数%={UI|下拉框_一次日常纽本次数}
%体力购买次数%={UI|体力购买次数}
//活动包
%深夜清扫%={UI|活动包,深夜清扫}
//识别/固定编队
%首次选人固定编队%={UI|镜之迷宫队伍选择方式,固定}
%首次选人识别编队%={UI|镜之迷宫队伍选择方式,识别}
%变量_镜之地牢_队伍优先级%={UI|镜之迷宫固定队伍选择}
%经验本固定编队%={UI|经验本队伍选择方式,固定}
%经验本识别编队%={UI|经验本队伍选择方式,识别}
%变量_经验本_队伍优先级%={UI|经验本固定队伍选择}
%纽本固定编队%={UI|纽本队伍选择方式,固定}
%纽本识别编队%={UI|纽本队伍选择方式,识别}
%变量_纽本_队伍优先级%={UI|纽本固定队伍选择}
%第一队%=0
%第二队%=0
%第三队%=0
%第四队%=0
%第五队%=0
%拉条模式A%={UI|拉条模式,A}
%拉条模式B%={UI|拉条模式,B}
%禁用拉条%={UI|拉条模式,禁用}
%彩蛋%={UI|???,FACE-THE-FEAR;MAKE-THE-FUTURE}
%经验本队伍抗性选择%={UI|选择抗性编队,经验本}
%纽本队伍抗性选择%={UI|选择抗性编队,纽本}
%经验本队伍抗性选择2%=1
%纽本队伍抗性选择2%=1
//星之恩惠
%星之恩惠1%={UI|星光1,选择}
%星之恩惠2%={UI|星光2,选择}
%星之恩惠3%={UI|星光3,选择}
%星之恩惠4%={UI|星光4,选择}
%星之恩惠5%={UI|星光5,选择}
%星之恩惠6%={UI|星光6,选择}
%星之恩惠7%={UI|星光7,选择}
%星之恩惠8%={UI|星光8,选择}
%星之恩惠9%={UI|星光9,选择}
%星之恩惠10%={UI|星光10,选择}

%节点判断楼层%={UI|测试功能,节点判断楼层}
%楼层判断-节点%=0
%楼层判断-识图%=1
%石头回炉%=0
%石头回炉2%={UI|石头回炉,石头回炉}
%合成跟随队伍体系%={UI|合成跟随队伍体系,启用}
%难度自动切换%={UI|难度自动切换,启用}
%中途楼层判断%=1
//商店各楼层生效
%合成-第一层%={UI|生效层数-合成,1}
%合成-第二层%={UI|生效层数-合成,2}
%合成-第三层%={UI|生效层数-合成,3}
%合成-第四层%={UI|生效层数-合成,4}
%合成-第五层%={UI|生效层数-合成,5}
%升级-第一层%={UI|生效层数-升级,1}
%升级-第二层%={UI|生效层数-升级,2}
%升级-第三层%={UI|生效层数-升级,3}
%升级-第四层%={UI|生效层数-升级,4}
%升级-第五层%={UI|生效层数-升级,5}
%购买-第一层%={UI|生效层数-购买,1}
%购买-第二层%={UI|生效层数-购买,2}
%购买-第三层%={UI|生效层数-购买,3}
%购买-第四层%={UI|生效层数-购买,4}
%购买-第五层%={UI|生效层数-购买,5}

%合成1%=0
%合成2%=0

%第一顺位%=0
%第二顺位%=0

%合成_烧伤%=0
%合成_流血%=0
%合成_震颤%=0
%合成_破裂%=0
%合成_沉沦%=0
%合成_呼吸%=0
%合成_充能%=0
%合成_斩击%=0
%合成_突刺%=0
%合成_打击%=0

//商店各楼层生效
%饰品升级%=0
%饰品合成%=0
%饰品购买%=0

%体系-队伍一%={UI|第一队体系}
%体系-队伍二%={UI|第二队体系}
%体系-队伍三%={UI|第三队体系}
%体系-队伍四%={UI|第四队体系}
%体系-队伍五%={UI|第五队体系}
%体系-队伍六%={UI|第六队体系}
%第六队%=0
%楼层检测变量1%=0
%楼层检测变量2%=0
%替补位%=0

//技能组
%一换二%={UI|技能组替换,一换二}
%二换三%={UI|技能组替换,二换三}
%一换三%={UI|技能组替换,一换三}
%变量_礼物1_优先级_中字%=0
%已选人检测%=0
%重新选人%=0
%开始界面%=1
%中文选包%=0
%日文选包%=1

//备选队伍
%轮换启用备用队伍%={UI|优先级跟随备用队伍,启用}
%备选1_角色1_优先级%={UI|备选1-罪人选择1,空}
%备选1_角色2_优先级%={UI|备选1-罪人选择2,空}
%备选1_角色3_优先级%={UI|备选1-罪人选择3,空}
%备选1_角色4_优先级%={UI|备选1-罪人选择4,空}
%备选1_角色5_优先级%={UI|备选1-罪人选择5,空}
%备选1_角色6_优先级%={UI|备选1-罪人选择6,空}

%备选2_角色1_优先级%={UI|备选2-罪人选择1,空}
%备选2_角色2_优先级%={UI|备选2-罪人选择2,空}
%备选2_角色3_优先级%={UI|备选2-罪人选择3,空}
%备选2_角色4_优先级%={UI|备选2-罪人选择4,空}
%备选2_角色5_优先级%={UI|备选2-罪人选择5,空}
%备选2_角色6_优先级%={UI|备选2-罪人选择6,空}

%备选3_角色1_优先级%={UI|备选3-罪人选择1,空}
%备选3_角色2_优先级%={UI|备选3-罪人选择2,空}
%备选3_角色3_优先级%={UI|备选3-罪人选择3,空}
%备选3_角色4_优先级%={UI|备选3-罪人选择4,空}
%备选3_角色5_优先级%={UI|备选3-罪人选择5,空}
%备选3_角色6_优先级%={UI|备选3-罪人选择6,空}

%备选4_角色1_优先级%={UI|备选4-罪人选择1,空}
%备选4_角色2_优先级%={UI|备选4-罪人选择2,空}
%备选4_角色3_优先级%={UI|备选4-罪人选择3,空}
%备选4_角色4_优先级%={UI|备选4-罪人选择4,空}
%备选4_角色5_优先级%={UI|备选4-罪人选择5,空}
%备选4_角色6_优先级%={UI|备选4-罪人选择6,空}

%备选5_角色1_优先级%={UI|备选5-罪人选择1,空}
%备选5_角色2_优先级%={UI|备选5-罪人选择2,空}
%备选5_角色3_优先级%={UI|备选5-罪人选择3,空}
%备选5_角色4_优先级%={UI|备选5-罪人选择4,空}
%备选5_角色5_优先级%={UI|备选5-罪人选择5,空}
%备选5_角色6_优先级%={UI|备选5-罪人选择6,空}

%备选6_角色1_优先级%={UI|备选6-罪人选择1,空}
%备选6_角色2_优先级%={UI|备选6-罪人选择2,空}
%备选6_角色3_优先级%={UI|备选6-罪人选择3,空}
%备选6_角色4_优先级%={UI|备选6-罪人选择4,空}
%备选6_角色5_优先级%={UI|备选6-罪人选择5,空}
%备选6_角色6_优先级%={UI|备选6-罪人选择6,空}
)

[UI]=(
{主窗体 | 边狱公司 | 大小=[200,200] | 按键=['运行','取消'] | 对齐模式=0 | 背景图='背景图.jpg'}
{页面 | 分页 | 对齐模式=0 | 选项=['设置页','队伍体系','额外设置','日常设置','商店页','星之恩惠','罪人优先级页','EGO优先级页','商店各楼层生效','队伍轮换页','备选队伍1','备选队伍2','日常本抗性编队','说明','开发者选项']}
{垂直布局 | 设置页 | 页面='分页.设置页' | 对齐模式=0}
{水平布局 | 水平1 | 布局='设置页' | 对齐模式=0}
{组 | 初始选项 | 布局='水平1' | 对齐模式=0}
{多选 | 初始选项 | 组='初始选项' | 行列=[5,5] | 对齐模式=0 | 选项=['升级自动换脑啡肽模块','结算时截图','死亡重开','开局重新选人'] | 选中=[1,0,1,0,0]}

{水平布局 | 水平2 | 布局='设置页' | 对齐模式=0}
{组 | EGO相关 | 布局='水平2' | 对齐模式=0}
{多选 | EGO相关 | 组='EGO相关' | 行列=[4,4] | 对齐模式=0 | 选项=['第五层开始释放EGO','EGO在战斗中只释放一次','低血量使用EGO'] | 选中=[0,0,0]}

{水平布局 | 水平3 | 布局='设置页' | 对齐模式=0}
{组 | 功能选择 | 布局='水平3' | 对齐模式=0}
{多选 | 功能开关 | 组='功能选择' | 行列=[1,6] | 对齐模式=0 | 选项=['地牢开关','经验本开关','纽本开关','一次日常'] | 选中=[1,0,0,0,0]}

//{水平布局|水平3|布局='设置页'|对齐模式=0}
{组 | 预定层数 | 布局='水平3' | 对齐模式=0}
{多选 | 预定层数 | 组='预定层数' | 行列=[1,2] | 对齐模式=0 | 选项=['三层退','四层退'] | 选中=[0,0]}

{水平布局 | 水平4 | 布局='设置页' | 对齐模式=0}
{组 | 镜像地牢/经验本/纽本次数选择 | 布局='水平4' | 对齐模式=0}
{网格布局 | 网格1 | 组='镜像地牢/经验本/纽本次数选择' | 对齐模式=1 | 行列=[2,3]}
{编辑框 | 地牢次数选择 | 布局='网格1' | 对齐模式=0 | 提示='地牢次数'}
{编辑框 | 经验本次数选择 | 布局='网格1' | 对齐模式=0 | 提示='经验本次数'}
{编辑框 | 纽本次数选择 | 布局='网格1' | 对齐模式=0 | 提示='纽本次数'}
{组 | 活动包 | 布局='水平4' | 对齐模式=0}
{多选 | 活动包 | 组='活动包' | 行列=[2,1] | 对齐模式=0 | 选项=['深夜清扫'] | 选中=[0]}

{网格布局 | 队伍体系 | 页面='分页.队伍体系' | 对齐模式=0 | 行列=[2,3]}

{水平布局 | 水平16 | 布局='队伍体系' | 对齐模式=0}
{组 | 队伍体系设置 | 布局='水平16' | 对齐模式=0}
{网格布局 | 网格17 | 组='队伍体系设置' | 对齐模式=1 | 行列=[2,2]}
{组 | 第1顺位 | 布局='网格17' | 对齐模式=0}
{水平布局 | 垂直6 | 组='第1顺位' | 对齐模式=0}
{下拉框 | 下拉框_第1顺位_选择礼物 | 布局='垂直6' | 对齐模式=0 | 选项=['烧伤','流血','震颤','破裂','沉沦','呼吸','充能','礼物_空'] | 选中=7}
{组 | 第2顺位 | 布局='网格17' | 对齐模式=0}
{水平布局 | 垂直6 | 组='第2顺位' | 对齐模式=0}
{下拉框 | 下拉框_第2顺位_选择礼物 | 布局='垂直6' | 对齐模式=0 | 选项=['烧伤','流血','震颤','破裂','沉沦','呼吸','充能','礼物_空'] | 选中=7}
{组 | 物理 | 布局='网格17' | 对齐模式=0}
{水平布局 | 垂直6 | 组='物理' | 对齐模式=0}
{下拉框 | 物理 | 布局='垂直6' | 对齐模式=0 | 选项=['斩击','突刺','打击','禁用'] | 选中=3}
{组 | 礼物优先 | 布局='网格17' | 对齐模式=0}
{水平布局 | 垂直6 | 组='礼物优先' | 对齐模式=0}
{下拉框 | 礼物优先 | 布局='垂直6' | 对齐模式=0 | 选项=['体系','物理'] | 选中=0}


{组 | 开局礼物选择 | 布局='队伍体系' | 对齐模式=0}
{水平布局 | 垂直6 | 组='开局礼物选择' | 对齐模式=0}
{多选 | 开局礼物选择 | 行列=[3,1] | 组='开局礼物选择' | 对齐模式=0 | 选项=['第一个礼物','第二个礼物','第三个礼物'] | 选中=[1,0,0]}

{水平布局 | 水平16 | 布局='队伍体系' | 对齐模式=0}
{组 | [对齐用] | 布局='水平16' | 对齐模式=0}
{网格布局 | 网格16 | 组='[对齐用]' | 对齐模式=0 | 行列=[2,2]}
{组 | 道中礼物选择 | 布局='网格16' | 对齐模式=0}
{水平布局 | 垂直6 | 组='道中礼物选择' | 对齐模式=0}
{多选 | 道中礼物设置 | 行列=[4,1] | 组='道中礼物选择' | 对齐模式=0 | 选项=['资源类选择','回复类选择','经济类选择','顺位二选择'] | 选中=[0,0,0,0]}

{水平布局 | 水平16 | 布局='队伍体系' | 对齐模式=0}
{组 | 镜之迷宫固定队伍选择 | 布局='水平16' | 对齐模式=0}
{网格布局 | 网格16 | 组='镜之迷宫固定队伍选择' | 对齐模式=0 | 行列=[2,1]}
{组 | 镜之迷宫队伍选择方式 | 布局='网格16' | 对齐模式=0}
{单选 | 镜之迷宫队伍选择方式 | 行列=[5,5] | 组='镜之迷宫队伍选择方式' | 对齐模式=0 | 选项=['识别','固定'] | 选中=[1,0]}
{组 | 镜之迷宫固定队伍选择 | 布局='网格16' | 对齐模式=0}
//{单选|镜之迷宫固定队伍选择|行列=[5,1]|组='镜之迷宫固定队伍选择'|对齐模式=0|选项=['第一队','第二队','第三队','第四队','第五队']|选中=[1,0,0,0,0]}
{下拉框 | 镜之迷宫固定队伍选择 | 组='镜之迷宫固定队伍选择' | 对齐模式=0 | 选项=['第一队','第二队','第三队','第四队','第五队'] | 选中=0}

{组 | 经验本固定队伍选择 | 布局='队伍体系' | 对齐模式=0}
{网格布局 | 网格17 | 组='经验本固定队伍选择' | 对齐模式=0 | 行列=[2,1]}
{组 | 经验本队伍选择方式 | 布局='网格17' | 对齐模式=0}
{单选 | 经验本队伍选择方式 | 行列=[5,5] | 组='经验本队伍选择方式' | 对齐模式=0 | 选项=['识别','固定'] | 选中=[1,0]}
{组 | 经验本固定队伍选择 | 布局='网格17' | 对齐模式=0}
//{单选|镜之迷宫固定队伍选择|行列=[5,1]|组='镜之迷宫固定队伍选择'|对齐模式=0|选项=['第一队','第二队','第三队','第四队','第五队']|选中=[1,0,0,0,0]}
{下拉框 | 经验本固定队伍选择 | 组='经验本固定队伍选择' | 对齐模式=0 | 选项=['第一队','第二队','第三队','第四队','第五队'] | 选中=0}

{组 | 纽本固定队伍选择 | 布局='队伍体系' | 对齐模式=0}
{网格布局 | 网格18 | 组='纽本固定队伍选择' | 对齐模式=0 | 行列=[2,1]}
{组 | 纽本队伍选择方式 | 布局='网格18' | 对齐模式=0}
{单选 | 纽本队伍选择方式 | 行列=[5,5] | 组='纽本队伍选择方式' | 对齐模式=0 | 选项=['识别','固定'] | 选中=[1,0]}
{组 | 纽本固定队伍选择 | 布局='网格18' | 对齐模式=0}
//{单选|纽本固定队伍选择|行列=[5,1]|组='纽本固定队伍选择'|对齐模式=0|选项=['第一队','第二队','第三队','第四队','第五队']|选中=[1,0,0,0,0]}
{下拉框 | 纽本固定队伍选择 | 组='纽本固定队伍选择' | 对齐模式=0 | 选项=['第一队','第二队','第三队','第四队','第五队'] | 选中=0}

{垂直布局 | 额外设置 | 页面='分页.额外设置' | 对齐模式=0}
{水平布局 | 水平5 | 布局='额外设置' | 对齐模式=0}
{组 | 选人跳过 | 布局='水平5' | 对齐模式=0}
{多选 | 选人跳过 | 组='选人跳过' | 行列=[1,1] | 对齐模式=0 | 选项=['启用'] | 选中=[1]}
{组 | 找图寻路 | 布局='水平5' | 对齐模式=0}
{多选 | 找图寻路 | 组='找图寻路' | 行列=[1,1] | 对齐模式=0 | 选项=['启用'] | 选中=[1]}
//{组|侵蚀冰桥|布局='水平5'|对齐模式=0}
//{多选|侵蚀冰桥|组='侵蚀冰桥'|行列=[1,1]|对齐模式=0|选项=['启用']|选中=[0]}
{组 | 五点自动日常 | 布局='水平5' | 对齐模式=0}
{多选 | 五点自动日常 | 组='五点自动日常' | 行列=[1,1] | 对齐模式=0 | 选项=['启用'] | 选中=[0]}

{水平布局 | 水平6 | 布局='额外设置' | 对齐模式=0}
{组 | 道中设置 | 布局='水平6' | 对齐模式=0}
{网格布局 | 网格11 | 组='道中设置' | 对齐模式=0 | 行列=[1,6]}
{组 | 道中战斗模式 | 布局='网格11' | 对齐模式=0}
{单选 | 道中战斗模式 | 组='道中战斗模式' | 行列=[1,2] | 对齐模式=0 | 选项=['普通','识别'] | 选中=[0,1]}
{组 | 战斗循环模式 | 布局='网格11' | 对齐模式=0}
{单选 | 战斗循环模式 | 行列=[1,2] | 组='战斗循环模式' | 对齐模式=0 | 选项=['普通','识图'] | 选中=[0,1]}

{组 | 每周加成使用 | 布局='水平6' | 对齐模式=0}
{单选 | 每周加成使用 | 行列=[1,3] | 组='每周加成使用' | 对齐模式=0 | 选项=['单次','不用','全用'] | 选中=[0,0,1]}

{水平布局 | 水平8 | 布局='额外设置' | 对齐模式=0}

{组 | 自动拉条 | 布局='水平8' | 对齐模式=0}
{网格布局 | 网格18 | 组='自动拉条' | 对齐模式=0 | 行列=[2,2]}
{组 | 队伍人数 | 布局='网格18' | 对齐模式=0}
{单选 | 队伍人数 | 组='队伍人数' | 行列=[1,2] | 对齐模式=0 | 选项=['五人','六人'] | 选中=[0,1]}
{组 | 拉条模式 | 布局='网格18' | 对齐模式=0}
{单选 | 拉条模式 | 组='拉条模式' | 行列=[1,3] | 对齐模式=0 | 选项=['A','B','禁用'] | 选中=[0,0,1]}


{水平布局 | 水平7 | 布局='额外设置' | 对齐模式=0}
{组 | 技能组替换 | 布局='水平7' | 对齐模式=0}
{单选 | 技能组替换 | 组='技能组替换' | 行列=[1,3] | 对齐模式=0 | 选项=['一换二','二换三','一换三'] | 选中=[1]}
{组 | 全灭重开 | 布局='水平7' | 对齐模式=0}
{多选 | 全灭重开 | 组='全灭重开' | 行列=[1,1] | 对齐模式=0 | 选项=['启用'] | 选中=[1]}
//{标签|侵蚀冰桥：侵蚀冰桥会在困难战斗中使用|布局='额外设置'|对齐模式=0}
//{编辑框|延迟设置|布局='网格5'|对齐模式=0|模式=0|提示='寻路延迟设置'}

{网格布局 | 日常设置 | 页面='分页.日常设置' | 对齐模式=0 | 行列=[3,3]}
{组 | 经验本 | 布局='日常设置' | 对齐模式=0}
{水平布局 | 垂直5 | 组='经验本' | 对齐模式=0}
{单选 | 单选_经验本_选择关卡 | 行列=[3,1] | 组='经验本' | 对齐模式=0 | 选项=['最高级','次级','最次级'] | 选中=[1,0,0]}

{组 | 纽本 | 布局='日常设置' | 对齐模式=0}
{水平布局 | 垂直5 | 组='纽本' | 对齐模式=0}
{单选 | 单选_纽本_选择关卡 | 行列=[3,1] | 组='纽本' | 对齐模式=0 | 选项=['最高级','次级','最次级'] | 选中=[1,0,0]}

{组 | 镜本 | 布局='日常设置' | 对齐模式=0}
{水平布局 | 垂直5 | 组='镜本' | 对齐模式=0}
{单选 | 单选_镜本_选择关卡 | 行列=[3,1] | 组='镜本' | 对齐模式=0 | 选项=['普通','困难'] | 选中=[1,0]}

{组|特殊[启用前请先确定]|布局='日常设置'|对齐模式=0|样式='color:rgb(255,0,0);font-weight:200;font-size:13px;'}
{水平布局 | 垂直5 | 组='特殊[启用前请先确定]' | 对齐模式=0}
{多选 | 特殊设置 | 行列=[3,1] | 组='特殊[启用前请先确定]' | 对齐模式=0 | 选项=['不领取奖励','存储一局','取消战斗报酬'] | 选中=[0]}

{水平布局 | 水平11 | 布局='日常设置' | 对齐模式=0}
{组 | 一次日常特殊需求 | 布局='水平11' | 对齐模式=0}
{网格布局 | 网格11 | 组='一次日常特殊需求' | 对齐模式=0 | 行列=[1,6]}

{组 | 一折抽卡 | 布局='网格11' | 对齐模式=0}
{多选 | 一折抽卡 | 组='一折抽卡' | 行列=[1,1] | 对齐模式=0 | 选项=['启用'] | 选中=[0]}
{组 | 邮箱 | 布局='网格11' | 对齐模式=0}
{多选 | 邮箱 | 组='邮箱' | 行列=[1,1] | 对齐模式=0 | 选项=['启用'] | 选中=[0]}

{组 | 一次日常体力购买 | 布局='日常设置' | 对齐模式=0}
{网格布局 | 网格11 | 组='一次日常体力购买' | 对齐模式=0 | 行列=[1,6]}
{组 | 体力购买 | 布局='网格11' | 对齐模式=0}
{多选 | 体力购买 | 组='体力购买' | 行列=[1,1] | 对齐模式=0 | 选项=['启用'] | 选中=[0]}
{组 | 体力购买次数 | 布局='网格11' | 对齐模式=0}
{下拉框 | 体力购买次数 | 组='体力购买次数' | 对齐模式=0 | 选项=['0','1','2','3','4','5','6'] | 选中=0}

{组 | 一次日常经验本次数 | 布局='日常设置' | 对齐模式=0}
{下拉框 | 下拉框_一次日常经验本次数 | 组='一次日常经验本次数' | 对齐模式=0 | 选项=['1','2','3','0'] | 选中=0}
{组 | 一次日常纽本次数 | 布局='日常设置' | 对齐模式=0}
{下拉框 | 下拉框_一次日常纽本次数 | 组='一次日常纽本次数' | 对齐模式=0 | 选项=['3','2','1','0'] | 选中=0}

{组 | 难度自动切换 | 布局='日常设置' | 对齐模式=0}
{多选 | 难度自动切换 | 组='难度自动切换' | 行列=[1,1] | 对齐模式=0 | 选项=['启用'] | 选中=[1]}

{网格布局 | 网格8 | 页面='分页.商店页' | 对齐模式=0 | 行列=[3,2]}

{水平布局 | 水平8 | 布局='网格8' | 对齐模式=0}
{组 | 商店设置 | 布局='水平8' | 对齐模式=0}
{网格布局 | 网格1 | 组='商店设置' | 对齐模式=0 | 行列=[2,4]}

{组 | 商店技能组 | 布局='网格1' | 对齐模式=0}
{单选 | 商店技能组 | 组='商店技能组' | 行列=[2,2] | 对齐模式=1 | 选项=['启用'] | 选中=[0]}
{组 | 商店回血 | 布局='网格1' | 对齐模式=0}
{单选 | 商店回血 | 组='商店回血' | 行列=[2,2] | 对齐模式=1 | 选项=['启用'] | 选中=[0]}
{组 | 四级饰品合成 | 布局='网格1' | 对齐模式=0}
{多选 | 四级饰品合成 | 行列=[1,3] | 组='四级饰品合成' | 对齐模式=0 | 选项=['启用合成','禁公式四级'] | 选中=[0,0]}
{组 | 石头回炉 | 布局='网格1' | 对齐模式=0}
{多选 | 石头回炉 | 行列=[1,3] | 组='石头回炉' | 对齐模式=0 | 选项=['石头回炉'] | 选中=[0,0]}

{组 | 合成体系1 | 布局='网格1' | 对齐模式=0}
{下拉框 | 合成体系1 | 组='合成体系1' | 对齐模式=0 | 选项=['合成_烧伤','合成_流血','合成_震颤','合成_破裂','合成_沉沦','合成_呼吸','合成_充能','合成_斩击','合成_突刺','合成_打击','合成_礼物_空'] | 选中=10}
{组 | 合成体系2 | 布局='网格1' | 对齐模式=0}
{下拉框 | 合成体系2 | 组='合成体系2' | 对齐模式=0 | 选项=['合成_斩击','合成_突刺','合成_打击','合成_礼物_空'] | 选中=0}
{组 | 合成避开同体系饰品 | 布局='网格1' | 对齐模式=0}
{多选 | 合成避开同体系饰品 | 组='合成避开同体系饰品' | 行列=[2,2] | 对齐模式=0 | 选项=['启用'] | 选中=[1]}
{组 | 合成跟随队伍体系 | 布局='网格1' | 对齐模式=0}
{多选 | 合成跟随队伍体系 | 组='合成跟随队伍体系' | 行列=[2,2] | 对齐模式=0 | 选项=['启用'] | 选中=[1]}

{组 | 商店刷新 | 布局='网格8' | 对齐模式=0}
{垂直布局 | 垂直4 | 组='商店刷新' | 对齐模式=0}

{组 | 商店刷新开关 | 布局='垂直4' | 对齐模式=0}
{单选 | 商店刷新开关 | 组='商店刷新开关' | 行列=[1,1] | 对齐模式=1 | 选项=['启用'] | 选中=[0]}

{组 | 商店刷新次数 | 布局='垂直4' | 对齐模式=0}
{编辑框 | 商店刷新次数 | 组='商店刷新次数' | 对齐模式=0 | 提示='商店刷新次数'}


{水平布局 | 水平8 | 布局='网格8' | 对齐模式=0 | 行列=[1,2]}
{组 | 技能组罪人设置 | 布局='水平8' | 对齐模式=0}
{网格布局 | 网格1 | 组='技能组罪人设置' | 对齐模式=0 | 行列=[2,3]}
{组 | 1 | 布局='网格1' | 对齐模式=0}
{下拉框 | 罪人选择1 | 组='1' | 对齐模式=1 | 选项=['空','李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔'] | 选中=0}
{组 | 2 | 布局='网格1' | 对齐模式=0}
{下拉框 | 罪人选择2 | 组='2' | 对齐模式=1 | 选项=['空','李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔'] | 选中=0}
{组 | 3 | 布局='网格1' | 对齐模式=0}
{下拉框 | 罪人选择3 | 组='3' | 对齐模式=1 | 选项=['空','李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔'] | 选中=0}
{组 | 4 | 布局='网格1' | 对齐模式=0}
{下拉框 | 罪人选择4 | 组='4' | 对齐模式=1 | 选项=['空','李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔'] | 选中=0}
{组 | 5 | 布局='网格1' | 对齐模式=0}
{下拉框 | 罪人选择5 | 组='5' | 对齐模式=1 | 选项=['空','李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔'] | 选中=0}
{组 | 6 | 布局='网格1' | 对齐模式=0}
{下拉框 | 罪人选择6 | 组='6' | 对齐模式=1 | 选项=['空','李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔'] | 选中=0}



{组 | 刷新模式 | 布局='网格8' | 对齐模式=0}
{水平布局 | 垂直4 | 组='商店刷新' | 对齐模式=0}
{单选 | 刷新模式 | 组='刷新模式' | 行列=[3,1] | 对齐模式=1 | 选项=['经费刷新','定向刷新'] | 选中=[1,0]}



{网格布局 | 水平44 | 页面='分页.星之恩惠' | 对齐模式=0 | 行列=[6,5]}
{组|起始之星|布局='水平44'|对齐模式=5|样式='color:rgb(200,50,19);font-weight:500;font-size:14px;'}
{网格布局 | 网格51 | 组='起始之星' | 对齐模式=0 | 行列=[5,1]}
{标签 | 消耗：10点 | 布局='网格51' | 对齐模式=2}
{组 | 星光1 | 布局='网格51' | 对齐模式=8}
{多选 | 星光1 | 行列=[3,2] | 组='星光1' | 对齐模式=5 | 选项=['选择'] | 选中=[0]}

{组|累积的星群|布局='水平44'|对齐模式=5|样式='color:rgb(200,50,19);font-weight:500;font-size:14px;'}
{网格布局 | 网格52 | 组='累积的星群' | 对齐模式=0 | 行列=[5,1]}
{标签 | 消耗：10点 | 布局='网格52' | 对齐模式=2}
{组 | 星光2 | 布局='网格52' | 对齐模式=8}
{多选 | 星光2 | 行列=[3,2] | 组='星光2' | 对齐模式=5 | 选项=['选择'] | 选中=[0]}

{组|星间旅行|布局='水平44'|对齐模式=5|样式='color:rgb(200,50,19);font-weight:500;font-size:14px;'}
{网格布局 | 网格53 | 组='星间旅行' | 对齐模式=0 | 行列=[5,1]}
{标签 | 消耗：20点 | 布局='网格53' | 对齐模式=2}
{组 | 星光3 | 布局='网格53' | 对齐模式=8}
{多选 | 星光3 | 行列=[3,2] | 组='星光3' | 对齐模式=5 | 选项=['选择'] | 选中=[1]}

{组|倾盆的流星|布局='水平44'|对齐模式=5|样式='color:rgb(200,50,19);font-weight:500;font-size:14px;'}
{网格布局 | 网格54 | 组='倾盆的流星' | 对齐模式=0 | 行列=[5,1]}
{标签 | 消耗：20点 | 布局='网格54' | 对齐模式=2}
{组 | 星光4 | 布局='网格54' | 对齐模式=8}
{多选 | 星光4 | 行列=[3,2] | 组='星光4' | 对齐模式=5 | 选项=['选择'] | 选中=[0]}

{组|双星系商店|布局='水平44'|对齐模式=5|样式='color:rgb(200,50,19);font-weight:500;font-size:14px;'}
{网格布局 | 网格55 | 组='双星系商店' | 对齐模式=0 | 行列=[5,1]}
{标签 | 消耗：30点 | 布局='网格55' | 对齐模式=2}
{组 | 星光5 | 布局='网格55' | 对齐模式=8}
{多选 | 星光5 | 行列=[3,2] | 组='星光5' | 对齐模式=5 | 选项=['选择'] | 选中=[0]}

{组|卫星系商店|布局='水平44'|对齐模式=5|样式='color:rgb(200,50,19);font-weight:500;font-size:14px;'}
{网格布局 | 网格56 | 组='卫星系商店' | 对齐模式=0 | 行列=[5,1]}
{标签 | 消耗：30点 | 布局='网格56' | 对齐模式=2}
{组 | 星光6 | 布局='网格56' | 对齐模式=8}
{多选 | 星光6 | 行列=[3,2] | 组='星光6' | 对齐模式=5 | 选项=['选择'] | 选中=[0]}

{组|星云的宠爱|布局='水平44'|对齐模式=5|样式='color:rgb(200,50,19);font-weight:500;font-size:14px;'}
{网格布局 | 网格57 | 组='星云的宠爱' | 对齐模式=0 | 行列=[5,1]}
{标签 | 消耗：40点 | 布局='网格57' | 对齐模式=2}
{组 | 星光7 | 布局='网格57' | 对齐模式=8}
{多选 | 星光7 | 行列=[3,2] | 组='星光7' | 对齐模式=5 | 选项=['选择'] | 选中=[1]}

{组|星光的指引|布局='水平44'|对齐模式=5|样式='color:rgb(200,50,19);font-weight:500;font-size:14px;'}
{网格布局 | 网格58 | 组='星光的指引' | 对齐模式=0 | 行列=[5,1]}
{标签 | 消耗：40点 | 布局='网格58' | 对齐模式=2}
{组 | 星光8 | 布局='网格58' | 对齐模式=8}
{多选 | 星光8 | 行列=[3,2] | 组='星光8' | 对齐模式=5 | 选项=['选择'] | 选中=[0]}

{组|偶然的彗星|布局='水平44'|对齐模式=5|样式='color:rgb(200,50,19);font-weight:500;font-size:14px;'}
{网格布局 | 网格59 | 组='偶然的彗星' | 对齐模式=0 | 行列=[5,1]}
{标签 | 消耗：50点 | 布局='网格59' | 对齐模式=2}
{组 | 星光9 | 布局='网格59' | 对齐模式=8}
{多选 | 星光9 | 行列=[3,2] | 组='星光9' | 对齐模式=5 | 选项=['选择'] | 选中=[0]}

{组|完全的可能性|布局='水平44'|对齐模式=5|样式='color:rgb(200,50,19);font-weight:500;font-size:14px;'}
{网格布局 | 网格60 | 组='完全的可能性' | 对齐模式=0 | 行列=[5,1]}
{标签 | 消耗：60点 | 布局='网格60' | 对齐模式=2}
{组 | 星光10 | 布局='网格60' | 对齐模式=8}
{多选 | 星光10 | 行列=[3,2] | 组='星光10' | 对齐模式=5 | 选项=['选择'] | 选中=[0]}

{网格布局 | 网格2 | 页面='分页.罪人优先级页' | 对齐模式=0 | 行列=[4,3]}
//{水平布局|水平5|布局='人格页'|对齐模式=2}
{组 | 第1顺位 | 布局='网格2' | 对齐模式=0}
{下拉框 | 下拉框_第1顺位_选择角色 | 组='第1顺位' | 对齐模式=0 | 选项=['李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔','空'] | 选中=12}
{组 | 第2顺位 | 布局='网格2' | 对齐模式=0}
{下拉框 | 下拉框_第2顺位_选择角色 | 组='第2顺位' | 对齐模式=0 | 选项=['李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔','空'] | 选中=12}
{组 | 第3顺位 | 布局='网格2' | 对齐模式=0}
{下拉框 | 下拉框_第3顺位_选择角色 | 组='第3顺位' | 对齐模式=0 | 选项=['李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔','空'] | 选中=12}
{组 | 第4顺位 | 布局='网格2' | 对齐模式=0}
{下拉框 | 下拉框_第4顺位_选择角色 | 组='第4顺位' | 对齐模式=0 | 选项=['李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔','空'] | 选中=12}
{组 | 第5顺位 | 布局='网格2' | 对齐模式=0}
{下拉框 | 下拉框_第5顺位_选择角色 | 组='第5顺位' | 对齐模式=0 | 选项=['李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔','空'] | 选中=12}
{组 | 第6顺位 | 布局='网格2' | 对齐模式=0}
{下拉框 | 下拉框_第6顺位_选择角色 | 组='第6顺位' | 对齐模式=0 | 选项=['李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔','空'] | 选中=12}
{组 | 第7顺位 | 布局='网格2' | 对齐模式=0}
{下拉框 | 下拉框_第7顺位_选择角色 | 组='第7顺位' | 对齐模式=0 | 选项=['李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔','空'] | 选中=12}
{组 | 第8顺位 | 布局='网格2' | 对齐模式=0}
{下拉框 | 下拉框_第8顺位_选择角色 | 组='第8顺位' | 对齐模式=0 | 选项=['李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔','空'] | 选中=12}
{组 | 第9顺位 | 布局='网格2' | 对齐模式=0}
{下拉框 | 下拉框_第9顺位_选择角色 | 组='第9顺位' | 对齐模式=0 | 选项=['李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔','空'] | 选中=12}
{组 | 第10顺位 | 布局='网格2' | 对齐模式=0}
{下拉框 | 下拉框_第10顺位_选择角色 | 组='第10顺位' | 对齐模式=0 | 选项=['李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔','空'] | 选中=12}
{组 | 第11顺位 | 布局='网格2' | 对齐模式=0}
{下拉框 | 下拉框_第11顺位_选择角色 | 组='第11顺位' | 对齐模式=0 | 选项=['李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔','空'] | 选中=12}
{组 | 第12顺位 | 布局='网格2' | 对齐模式=0}
{下拉框 | 下拉框_第12顺位_选择角色 | 组='第12顺位' | 对齐模式=0 | 选项=['李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔','空'] | 选中=12}


//{网格布局|网格2|页面='分页.EGO优先级页'|对齐模式=0|行列=[5,5]}
//{组|第1顺位|布局='网格2'|对齐模式=0}
//{水平布局|水平5|组='第1顺位'|对齐模式=2}
//{多选|EGO相关1|布局='水平5'|行列=[1,1]|对齐模式=0|选项=['侵蚀']|选中=[0]}
//{下拉框|下拉框_第1顺位_选择EGO|布局='水平5'|对齐模式=0|选项=['EGO_金苹果','EGO_表象','EGO_液袋','EGO_赤眼开','EGO_狐雨','EGO_黑枝','EGO_空','EGO_电狼_兔子','EGO_尸体袋','EGO_李箱终末火柴之光','EGO_执行']|选中=0}

{网格布局 | 水平44 | 页面='分页.EGO优先级页' | 对齐模式=0 | 行列=[3,3]}
{水平布局 | 分列 | 布局='水平44' | 对齐模式=0}
{组 | 输出ego设置 | 布局='分列' | 对齐模式=0}
{网格布局 | 输出ego | 组='输出ego设置' | 对齐模式=0 | 行列=[3,1]}
{组 | 输出1位 | 布局='输出ego' | 对齐模式=0}
{水平布局 | 垂直6 | 组='输出1位' | 对齐模式=0}
{下拉框 | 下拉框_第1顺位_选择EGO | 布局='垂直6' | 对齐模式=0 | 选项=['EGO_空','EGO_狐雨','EGO_黑枝','EGO_以实玛利盲目','EGO_金苹果','EGO_堂吉诃德蜜卡拉_侵蚀','EGO_堂吉诃德蜜卡拉','EGO_希斯克利夫束缚','EGO_奥提斯束缚'] | 选中=0}
{组 | 输出2位 | 布局='输出ego' | 对齐模式=0}
{水平布局 | 垂直6 | 组='输出2位' | 对齐模式=0}
{下拉框 | 下拉框_第2顺位_选择EGO | 布局='垂直6' | 对齐模式=0 | 选项=['EGO_空','EGO_狐雨','EGO_黑枝','EGO_以实玛利盲目','EGO_金苹果','EGO_堂吉诃德蜜卡拉_侵蚀','EGO_堂吉诃德蜜卡拉','EGO_希斯克利夫束缚','EGO_奥提斯束缚'] | 选中=0}
{组 | 输出3位 | 布局='输出ego' | 对齐模式=0}
{水平布局 | 垂直6 | 组='输出3位' | 对齐模式=0}
{下拉框 | 下拉框_第3顺位_选择EGO | 布局='垂直6' | 对齐模式=0 | 选项=['EGO_空','EGO_狐雨','EGO_黑枝','EGO_以实玛利盲目','EGO_金苹果','EGO_堂吉诃德蜜卡拉_侵蚀','EGO_堂吉诃德蜜卡拉','EGO_希斯克利夫束缚','EGO_奥提斯束缚'] | 选中=0}

{组 | 回复ego设置 | 布局='分列' | 对齐模式=0}
{网格布局 | 回复ego | 组='回复ego设置' | 对齐模式=0 | 行列=[3,1]}
{组 | 回复1位 | 布局='回复ego' | 对齐模式=0}
{水平布局 | 垂直6 | 组='回复1位' | 对齐模式=0}
{下拉框 | 下拉框_第4顺位_选择EGO | 布局='垂直6' | 对齐模式=0 | 选项=['EGO_空','EGO_液袋','EGO_默尔索执行','EGO_罗佳执行','EGO_罗佳诅咒钉','EGO_辛克莱提灯'] | 选中=0}
{组 | 回复2位 | 布局='回复ego' | 对齐模式=0}
{水平布局 | 垂直6 | 组='回复2位' | 对齐模式=0}
{下拉框 | 下拉框_第5顺位_选择EGO | 布局='垂直6' | 对齐模式=0 | 选项=['EGO_空','EGO_液袋','EGO_默尔索执行','EGO_罗佳执行','EGO_罗佳诅咒钉','EGO_辛克莱提灯'] | 选中=0}
{组 | 回复3位 | 布局='回复ego' | 对齐模式=0}
{水平布局 | 垂直6 | 组='回复3位' | 对齐模式=0}
{下拉框 | 下拉框_第6顺位_选择EGO | 布局='垂直6' | 对齐模式=0 | 选项=['EGO_空','EGO_液袋','EGO_默尔索执行','EGO_罗佳执行','EGO_罗佳诅咒钉','EGO_辛克莱提灯'] | 选中=0}

{组 | 释放场景设置 | 布局='分列' | 对齐模式=0}
{网格布局 | 场景设置 | 组='释放场景设置' | 对齐模式=0 | 行列=[3,1]}
{组 | 第五层释放ego种类 | 布局='场景设置' | 对齐模式=0}
{水平布局 | 垂直6 | 组='第五层释放ego种类' | 对齐模式=0}
{多选 | 第五层释放ego种类 | 布局='垂直6' | 行列=[3,1] | 对齐模式=0 | 选项=['输出型','回复型'] | 选中=[1,0]}

{组 | 第四层释放ego场景 | 布局='场景设置' | 对齐模式=0}
{水平布局 | 垂直6 | 组='第四层释放ego场景' | 对齐模式=0}
{多选 | 第四层释放ego场景 | 布局='垂直6' | 行列=[3,1] | 对齐模式=1 | 选项=['道中作战','集中作战'] | 选中=[1,1]}

{组 | 低血量释放ego种类 | 布局='场景设置' | 对齐模式=0}
{水平布局 | 垂直6 | 组='低血量释放ego种类' | 对齐模式=0}
{多选 | 低血量释放ego种类 | 布局='垂直6' | 行列=[3,1] | 对齐模式=1 | 选项=['输出型','回复型'] | 选中=[0,1]}

{垂直布局 | 商店各楼层生效 | 页面='分页.商店各楼层生效' | 对齐模式=1}
{组 | 商店各楼层生效功能 | 布局='商店各楼层生效' | 对齐模式=1}
{网格布局 | 网格61 | 组='商店各楼层生效功能' | 对齐模式=0 | 行列=[5,1]}
{组 | 生效层数-合成 | 布局='网格61' | 对齐模式=0}
{多选 | 生效层数-合成 | 行列=[1,5] | 组='生效层数-合成' | 对齐模式=0 | 选项=['1','2','3','4','5'] | 选中=[1,1,1,1,1]}
{组 | 生效层数-升级 | 布局='网格61' | 对齐模式=0}
{多选 | 生效层数-升级 | 行列=[1,5] | 组='生效层数-升级' | 对齐模式=0 | 选项=['1','2','3','4','5'] | 选中=[1,1,1,1,1]}
{组 | 生效层数-购买 | 布局='网格61' | 对齐模式=0}
{多选 | 生效层数-购买 | 行列=[1,5] | 组='生效层数-购买' | 对齐模式=0 | 选项=['1','2','3','4','5'] | 选中=[1,1,1,1,1]}


{垂直布局 | 队伍轮换页 | 页面='分页.队伍轮换页' | 对齐模式=1}
{组|队伍轮换设置[请先参考说明设置]|布局='队伍轮换页'|对齐模式=1|样式='color:rgb(255,0,0);font-weight:200;font-size:13px;'}
{网格布局 | 网格11 | 组='队伍轮换设置[请先参考说明设置]' | 对齐模式=1 | 行列=[1,6]}
{组 | 队伍轮换 | 布局='网格11' | 对齐模式=0}
{多选 | 队伍轮换 | 组='队伍轮换' | 行列=[1,1] | 对齐模式=0 | 选项=['启用'] | 选中=[0]}
{组 | 轮换初始队伍 | 布局='网格11' | 对齐模式=0}
{下拉框 | 轮换初始队伍 | 组='轮换初始队伍' | 对齐模式=0 | 选项=['1','2','3','4','5','6'] | 选中=0 | 提示='轮换初始队伍'}
{组 | 轮换队伍数量 | 布局='网格11' | 对齐模式=0}
{下拉框 | 轮换队伍数量 | 组='轮换队伍数量' | 对齐模式=0 | 选项=['1','2','3','4','5','6'] | 选中=0 | 提示='轮换队伍数量'}

{组 | 队伍轮换设置 | 布局='队伍轮换页' | 对齐模式=0}
{网格布局 | 网络60 | 组='队伍轮换设置' | 对齐模式=0 | 行列=[2,3]}
{组 | 第一队体系 | 布局='网络60' | 对齐模式=0}
//{单选|第一队体系|组='第一队体系'|行列=[2,2]|对齐模式=0|选项=['第一顺位','第二顺位','物理优先']|选中=[1,0,0]}
{下拉框 | 第一队体系 | 组='第一队体系' | 对齐模式=0 | 选项=['烧伤','流血','震颤','破裂','沉沦','呼吸','充能','斩击','突刺','打击','礼物_空'] | 选中=0}
{组 | 第二队体系 | 布局='网络60' | 对齐模式=0}
//{单选|第二队体系|组='第二队体系'|行列=[2,2]|对齐模式=0|选项=['第一顺位','第二顺位','物理优先']|选中=[1,0,0]}
{下拉框 | 第二队体系 | 组='第二队体系' | 对齐模式=0 | 选项=['烧伤','流血','震颤','破裂','沉沦','呼吸','充能','斩击','突刺','打击','礼物_空'] | 选中=0}
{组 | 第三队体系 | 布局='网络60' | 对齐模式=0}
//{单选|第三队体系|组='第三队体系'|行列=[2,2]|对齐模式=0|选项=['第一顺位','第二顺位','物理优先']|选中=[1,0,0]}
{下拉框 | 第三队体系 | 组='第三队体系' | 对齐模式=0 | 选项=['烧伤','流血','震颤','破裂','沉沦','呼吸','充能','斩击','突刺','打击','礼物_空'] | 选中=0}
{组 | 第四队体系 | 布局='网络60' | 对齐模式=0}
//{单选|第四队体系|组='第四队体系'|行列=[2,2]|对齐模式=0|选项=['第一顺位','第二顺位','物理优先']|选中=[1,0,0]}
{下拉框 | 第四队体系 | 组='第四队体系' | 对齐模式=0 | 选项=['烧伤','流血','震颤','破裂','沉沦','呼吸','充能','斩击','突刺','打击','礼物_空'] | 选中=0}
{组 | 第五队体系 | 布局='网络60' | 对齐模式=0}
//{单选|第五队体系|组='第五队体系'|行列=[2,2]|对齐模式=0|选项=['第一顺位','第二顺位','物理优先']|选中=[1,0,0]}
{下拉框 | 第五队体系 | 组='第五队体系' | 对齐模式=0 | 选项=['烧伤','流血','震颤','破裂','沉沦','呼吸','充能','斩击','突刺','打击','礼物_空'] | 选中=0}
{组 | 第六队体系 | 布局='网络60' | 对齐模式=0}
//{单选|第五队体系|组='第五队体系'|行列=[2,2]|对齐模式=0|选项=['第一顺位','第二顺位','物理优先']|选中=[1,0,0]}
{下拉框 | 第六队体系 | 组='第六队体系' | 对齐模式=0 | 选项=['烧伤','流血','震颤','破裂','沉沦','呼吸','充能','斩击','突刺','打击','礼物_空'] | 选中=0}
{组 | 优先级跟随备用队伍 | 布局='队伍轮换页' | 对齐模式=0}
{多选 | 优先级跟随备用队伍 | 组='优先级跟随备用队伍' | 行列=[1,1] | 对齐模式=0 | 选项=['启用'] | 选中=[0]}

{水平布局 | 日常本抗性编队 | 页面='分页.日常本抗性编队' | 对齐模式=1 | 行列=[2,3]}
{组 | 选择抗性编队 | 布局='日常本抗性编队' | 对齐模式=0}
{水平布局 | 垂直6 | 组='选择抗性编队' | 对齐模式=0}
{多选 | 选择抗性编队 | 行列=[2,1] | 组='选择抗性编队' | 对齐模式=4 | 选项=['经验本','纽本'] | 选中=[0,0]}
{水平布局 | 经验设置 | 布局='日常本抗性编队' | 对齐模式=0}
{组 | 经验拉条[抗性编队需要] | 布局='经验设置' | 对齐模式=0}
{网格布局 | 网格1 | 组='经验拉条[抗性编队需要]' | 对齐模式=0 | 行列=[3,2]}
{组 | 拉条开关 | 布局='网格1' | 对齐模式=0}
{多选 | 经验拉条开关 | 行列=[3,1] | 组='拉条开关' | 对齐模式=0 | 选项=['斩','刺','打'] | 选中=[0]}
{组 | 拉条回合 | 布局='网格1' | 对齐模式=0}
{网格布局 | 回合 | 组='拉条回合' | 对齐模式=0 | 行列=[3,1]}
{编辑框 | 斩击本 | 布局='回合' | 对齐模式=0 | 提示='斩击'}
{编辑框 | 突刺本 | 布局='回合' | 对齐模式=0 | 提示='突刺'}
{编辑框 | 打击本 | 布局='回合' | 对齐模式=0 | 提示='打击'}
{水平布局 | 纽设置 | 布局='日常本抗性编队' | 对齐模式=0}
{组 | 纽特殊[抗性编队需要] | 布局='纽设置' | 对齐模式=0}
{多选 | 纽特殊开关 | 行列=[1,1] | 组='纽特殊[抗性编队需要]' | 对齐模式=0 | 选项=['十罗单通铜牛'] | 选中=[0]}

{垂直布局 | 说明页 | 页面='分页.说明' | 对齐模式=0}
{标签|系统支持：WIN10及以上,显示缩放125%/150%/100%|布局='说明页'|对齐模式=2|样式='color:rgb(0,0,0);font-weight:600;font-size:20px;'}
{标签|游戏设定：分辨率自己会调整,日语,窗口化,高画质|布局='说明页'|对齐模式=2|样式='color:rgb(0,0,0);font-weight:600;font-size:20px;'}
{标签|该脚本为免费分享,禁止售卖/用于代肝|布局='说明页'|对齐模式=2|样式='color:rgb(200,0,0);font-weight:600;font-size:20px;'}
{标签|禁止跳脸官方,公开宣传,散布群号等行为|布局='说明页'|对齐模式=2|样式='color:rgb(200,0,0);font-weight:600;font-size:20px;'}
{标签|一经发现,将停止脚本的一切后续更新,望周知|布局='说明页'|对齐模式=2|样式='color:rgb(200,0,0);font-weight:600;font-size:20px;'}
{标签|特别鸣谢：▇▇▇▇▇▇▇▇的每一位成员|布局='说明页'|对齐模式=8|样式='color:rgb(0,0,0);font-weight:600;font-size:20px;'}
{标签|脚本版本号：5.014test|布局='说明页'|对齐模式=9|样式='color:rgb(0,0,0);font-weight:600;font-size:13px;'}
{组|???|布局='说明页'|对齐模式=2|样式='color:rgb(200,0,0);font-weight:600;font-size:20px;'}
{单选|???|组='???'|行列=[2,1]|对齐模式=2|选项=['FACE-THE-FEAR;MAKE-THE-FUTURE']|选中=[0]|样式='color:rgb(0,0,0);font-weight:500;font-size:20px;'}

{垂直布局 | 开发者选项 | 页面='分页.开发者选项' | 对齐模式=1}
{组 | 截图 | 布局='开发者选项' | 对齐模式=1}
{水平布局 | 垂直13 | 组='截图' | 对齐模式=1}
{多选 | 截图 | 行列=[3,3] | 组='截图' | 对齐模式=0 | 选项=['商店截图','选择截图','卡包截图'] | 选中=[0]}
{组 | 测试功能 | 布局='开发者选项' | 对齐模式=1}
{水平布局 | test | 组='测试功能' | 对齐模式=1}
{多选 | 测试功能 | 行列=[2,3] | 组='测试功能' | 对齐模式=0 | 选项=['节点判断楼层','顺位一最高优先','困牢二层无鸡重开'] | 选中=[0]}

{组 | 取消商店 | 布局='开发者选项' | 对齐模式=0}
{多选 | 取消商店 | 组='取消商店' | 行列=[1,1] | 对齐模式=0 | 选项=['启用'] | 选中=[0]}
{组 | 战斗时检测 | 布局='开发者选项' | 对齐模式=0}
{多选 | 战斗时检测 | 组='战斗时检测' | 行列=[1,1] | 对齐模式=0 | 选项=['启用'] | 选中=[0]}


{网格布局 | 备选队伍1 | 页面='分页.备选队伍1' | 对齐模式=0 | 行列=[2,2]}
{组 | 第一队 | 布局='备选队伍1' | 对齐模式=0}
{网格布局 | 网格1 | 组='第一队' | 对齐模式=1 | 行列=[2,3]}
{组 | 1 | 布局='网格1' | 对齐模式=0}
{下拉框 | 备选1-罪人选择1 | 组='1' | 对齐模式=1 | 选项=['空','李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔'] | 选中=0}
{组 | 2 | 布局='网格1' | 对齐模式=0}
{下拉框 | 备选1-罪人选择2 | 组='2' | 对齐模式=1 | 选项=['空','李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔'] | 选中=0}
{组 | 3 | 布局='网格1' | 对齐模式=0}
{下拉框 | 备选1-罪人选择3 | 组='3' | 对齐模式=1 | 选项=['空','李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔'] | 选中=0}
{组 | 4 | 布局='网格1' | 对齐模式=0}
{下拉框 | 备选1-罪人选择4 | 组='4' | 对齐模式=1 | 选项=['空','李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔'] | 选中=0}
{组 | 5 | 布局='网格1' | 对齐模式=0}
{下拉框 | 备选1-罪人选择5 | 组='5' | 对齐模式=1 | 选项=['空','李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔'] | 选中=0}
{组 | 6 | 布局='网格1' | 对齐模式=0}
{下拉框 | 备选1-罪人选择6 | 组='6' | 对齐模式=1 | 选项=['空','李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔'] | 选中=0}

{组 | 第二队 | 布局='备选队伍1' | 对齐模式=0}
{网格布局 | 网格2 | 组='第二队' | 对齐模式=1 | 行列=[2,3]}
{组 | 1 | 布局='网格2' | 对齐模式=0}
{下拉框 | 备选2-罪人选择1 | 组='1' | 对齐模式=1 | 选项=['空','李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔'] | 选中=0}
{组 | 2 | 布局='网格2' | 对齐模式=0}
{下拉框 | 备选2-罪人选择2 | 组='2' | 对齐模式=1 | 选项=['空','李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔'] | 选中=0}
{组 | 3 | 布局='网格2' | 对齐模式=0}
{下拉框 | 备选2-罪人选择3 | 组='3' | 对齐模式=1 | 选项=['空','李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔'] | 选中=0}
{组 | 4 | 布局='网格2' | 对齐模式=0}
{下拉框 | 备选2-罪人选择4 | 组='4' | 对齐模式=1 | 选项=['空','李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔'] | 选中=0}
{组 | 5 | 布局='网格2' | 对齐模式=0}
{下拉框 | 备选2-罪人选择5 | 组='5' | 对齐模式=1 | 选项=['空','李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔'] | 选中=0}
{组 | 6 | 布局='网格2' | 对齐模式=0}
{下拉框 | 备选2-罪人选择6 | 组='6' | 对齐模式=1 | 选项=['空','李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔'] | 选中=0}
{组 | 第三队 | 布局='备选队伍1' | 对齐模式=0}
{网格布局 | 网格3 | 组='第三队' | 对齐模式=1 | 行列=[2,3]}
{组 | 1 | 布局='网格3' | 对齐模式=0}
{下拉框 | 备选3-罪人选择1 | 组='1' | 对齐模式=1 | 选项=['空','李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔'] | 选中=0}
{组 | 2 | 布局='网格3' | 对齐模式=0}
{下拉框 | 备选3-罪人选择2 | 组='2' | 对齐模式=1 | 选项=['空','李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔'] | 选中=0}
{组 | 3 | 布局='网格3' | 对齐模式=0}
{下拉框 | 备选3-罪人选择3 | 组='3' | 对齐模式=1 | 选项=['空','李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔'] | 选中=0}
{组 | 4 | 布局='网格3' | 对齐模式=0}
{下拉框 | 备选3-罪人选择4 | 组='4' | 对齐模式=1 | 选项=['空','李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔'] | 选中=0}
{组 | 5 | 布局='网格3' | 对齐模式=0}
{下拉框 | 备选3-罪人选择5 | 组='5' | 对齐模式=1 | 选项=['空','李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔'] | 选中=0}
{组 | 6 | 布局='网格3' | 对齐模式=0}
{下拉框 | 备选3-罪人选择6 | 组='6' | 对齐模式=1 | 选项=['空','李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔'] | 选中=0}

{组 | 第四队 | 布局='备选队伍1' | 对齐模式=0}
{网格布局 | 网格4 | 组='第四队' | 对齐模式=1 | 行列=[2,3]}
{组 | 1 | 布局='网格4' | 对齐模式=0}
{下拉框 | 备选4-罪人选择1 | 组='1' | 对齐模式=1 | 选项=['空','李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔'] | 选中=0}
{组 | 2 | 布局='网格4' | 对齐模式=0}
{下拉框 | 备选4-罪人选择2 | 组='2' | 对齐模式=1 | 选项=['空','李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔'] | 选中=0}
{组 | 3 | 布局='网格4' | 对齐模式=0}
{下拉框 | 备选4-罪人选择3 | 组='3' | 对齐模式=1 | 选项=['空','李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔'] | 选中=0}
{组 | 4 | 布局='网格4' | 对齐模式=0}
{下拉框 | 备选4-罪人选择4 | 组='4' | 对齐模式=1 | 选项=['空','李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔'] | 选中=0}
{组 | 5 | 布局='网格4' | 对齐模式=0}
{下拉框 | 备选4-罪人选择5 | 组='5' | 对齐模式=1 | 选项=['空','李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔'] | 选中=0}
{组 | 6 | 布局='网格4' | 对齐模式=0}
{下拉框 | 备选4-罪人选择6 | 组='6' | 对齐模式=1 | 选项=['空','李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔'] | 选中=0}

{网格布局 | 备选队伍2 | 页面='分页.备选队伍2' | 对齐模式=1 | 行列=[2,2]}
{组 | 第五队 | 布局='备选队伍2' | 对齐模式=0}
{网格布局 | 网格1 | 组='第五队' | 对齐模式=1 | 行列=[2,3]}
{组 | 1 | 布局='网格1' | 对齐模式=0}
{下拉框 | 备选5-罪人选择1 | 组='1' | 对齐模式=1 | 选项=['空','李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔'] | 选中=0}
{组 | 2 | 布局='网格1' | 对齐模式=0}
{下拉框 | 备选5-罪人选择2 | 组='2' | 对齐模式=1 | 选项=['空','李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔'] | 选中=0}
{组 | 3 | 布局='网格1' | 对齐模式=0}
{下拉框 | 备选5-罪人选择3 | 组='3' | 对齐模式=1 | 选项=['空','李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔'] | 选中=0}
{组 | 4 | 布局='网格1' | 对齐模式=0}
{下拉框 | 备选5-罪人选择4 | 组='4' | 对齐模式=1 | 选项=['空','李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔'] | 选中=0}
{组 | 5 | 布局='网格1' | 对齐模式=0}
{下拉框 | 备选5-罪人选择5 | 组='5' | 对齐模式=1 | 选项=['空','李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔'] | 选中=0}
{组 | 6 | 布局='网格1' | 对齐模式=0}
{下拉框 | 备选5-罪人选择6 | 组='6' | 对齐模式=1 | 选项=['空','李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔'] | 选中=0}

{组 | 第六队 | 布局='备选队伍2' | 对齐模式=0}
{网格布局 | 网格2 | 组='第六队' | 对齐模式=1 | 行列=[2,3]}
{组 | 1 | 布局='网格2' | 对齐模式=0}
{下拉框 | 备选6-罪人选择1 | 组='1' | 对齐模式=1 | 选项=['空','李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔'] | 选中=0}
{组 | 2 | 布局='网格2' | 对齐模式=0}
{下拉框 | 备选6-罪人选择2 | 组='2' | 对齐模式=1 | 选项=['空','李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔'] | 选中=0}
{组 | 3 | 布局='网格2' | 对齐模式=0}
{下拉框 | 备选6-罪人选择3 | 组='3' | 对齐模式=1 | 选项=['空','李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔'] | 选中=0}
{组 | 4 | 布局='网格2' | 对齐模式=0}
{下拉框 | 备选6-罪人选择4 | 组='4' | 对齐模式=1 | 选项=['空','李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔'] | 选中=0}
{组 | 5 | 布局='网格2' | 对齐模式=0}
{下拉框 | 备选6-罪人选择5 | 组='5' | 对齐模式=1 | 选项=['空','李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔'] | 选中=0}
{组 | 6 | 布局='网格2' | 对齐模式=0}
{下拉框 | 备选6-罪人选择6 | 组='6' | 对齐模式=1 | 选项=['空','李箱','浮士德','堂吉诃德','良秀','默尔索','鸿璐','希斯克里夫','以实玛利','罗佳','辛克莱','奥提斯','格里高尔'] | 选中=0}
)

[主界面]=(
//{打印变量|['地牢次数']}
{找图 | 活动关闭 | 按键=['T','ESC',50] | 延时=300 | 范围=[[1312,146,1415,248]] | 图片=['活动关闭','活动关闭2',75]}
{组 | '开始界面'}
{找图 | 开始界面 | 跳转=['T开始界面'] | 范围=[[221,780,611,869]] | 图片=['开始界面','开始界面2',85] | 开关={'开始界面'}}
{空参 | 运行}
{组 | '赋值' | 开关={'赋值'}}
{组 | '定时日常开启' | 时间=[0,['大于','5:00:00'],['小于','6:30:00']] | 开关={'五点自动日常'}}
{组 | '日常开启' | 开关={'一次日常'}}
{组 | '经验本准备' | 开关={'经验本开关'}}
{组 | '纽本准备' | 开关={'纽本开关'}}
{组 | '每日任务' | 开关={'每日任务开关'}}
{组 | '每周领取' | 开关={'周常奖励'}}
{组 | '镜本准备' | 开关={'地牢开关'}}
{组 | '镜本' | 开关={'地牢开关'}}
{组 | '处理错误'}
)
[▰▰▰▰▰▰[主界面部分]▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰]=(
{跳出 | 'TF'}
)
[开始界面]=(
{找图 | 开始界面 | 点击=['T',699,629,50] | 延时=1000 | 范围=[[221,780,611,869]] | 图片=['开始界面','开始界面2',85] | 开关={'开始界面'}}
{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字',85]}
{找图 | 服务器加载 | 循环=['T',999,100] | 范围=[[1250,22,1575,158]] | 图片=['加载中',85]}
{找图 | 加载条 | 循环=['T',999,100] | 范围=[[1409,326,1571,434]] | 图片=['加载条1','加载条2',70]}
{找图 | 镜像地牢主页 | 赋值=['T',[{'开始界面'},0]] | 跳至=['T','主界面','运行'] | 范围=[[973,734,1216,863],[1416,752,1536,849]] | 图片=['主页1','主页2','主页3','主页4','主页-无字1','主页-无字2',65]}
)
[赋值]=(
{空参 | 正在同步记忆库}
{组 | '彩蛋' | 开关={'彩蛋'}}

{赋值 | [[{'地牢次数统计'},1]] | 开关={'地牢开关'}}
{赋值 | [[{'开局重新选人2'},1]] | 开关={'开局重新选人'}}
{赋值 | [[{'经验本队伍抗性选择2'},0]] | 开关={'经验本队伍抗性选择'}}
{赋值 | [[{'纽本队伍抗性选择2'},0]] | 开关={'纽本队伍抗性选择'}}
{赋值 | [[{'经验本队伍抗性选择2'},0]] | 开关={'经验本固定编队'}}
{赋值 | [[{'纽本队伍抗性选择2'},0]] | 开关={'纽本固定编队'}}

{判断 | [[{'变量_角色7_优先级'},'等于','空'],{赋值=['T',[{'替补位'},1]]}]}
{判断 | [[{'物理优先1'},'等于','物理'],{赋值=['T',[{'物理优先'},1]]}]}
{判断 | [[{'物理'},'等于','斩击'],{赋值=['T',[{'斩击'},1]]}]}
{判断 | [[{'物理'},'等于','打击'],{赋值=['T',[{'打击'},1]]}]}
{判断 | [[{'物理'},'等于','突刺'],{赋值=['T',[{'突刺'},1]]}]}
{判断 | [[{'物理'},'等于','禁用'],{赋值=['T',[{'无物理体系'},1]]}]}
{组 | '合成跟随队伍体系' | 开关={'合成跟随队伍体系'}}
{判断 | [[{'合成体系1'},'等于','合成_礼物_空'],{赋值=['T',[{'一号位合成'},0]]}]}
{判断 | [[{'合成体系2'},'等于','合成_礼物_空'],{赋值=['T',[{'二号位合成'},0]]}]}

{赋值 | [[{'第一顺位'},1],[{'第二顺位'},0]]}
{组 | {'变量_礼物1_优先级'}}
{赋值 | [[{'第一顺位'},0],[{'第二顺位'},1]]}
{组 | {'变量_礼物2_优先级'}}
{赋值 | [[{'第一顺位'},0],[{'第二顺位'},0]]}

{赋值 | [[{'赋值'},0]]}
{跳出 | 'TF'}
)

[定时日常开启]=(
//防止开早了
{找图 | 镜像地牢主页 | 跳出='F' | 范围=[[973,734,1216,863],[1416,752,1536,849]] | 图片=['主页1','主页2','主页3','主页4','主页-无字1','主页-无字2',65]}
{赋值 | [[{'一次日常'},1]]}
{赋值 | [[{'五点自动日常'},0]]}
{跳出 | 'TF'}
)
[日常开启]=(
{赋值 | [[{'经验本开关'},1]]}
{赋值 | [[{'纽本开关'},1]]}
{赋值 | [[{'经验本次数'},{'一次日常设置经验本次数'}]]}
{赋值 | [[{'纽本次数'},{'一次日常设置纽本次数'}]]}
{赋值 | [[{'每日任务开关'},1]]}
{组 | '邮箱' | 开关={'邮箱'}}
{组 | '体力购买' | 开关={'体力购买'}}
{组 | '一折抽卡' | 开关={'一折抽卡'}}
{赋值 | [[{'一次日常'},0]]}
{跳出 | 'TF'}
)
[镜本]=(
{空参 | 正在运行SEPHIRAH协议}
//{延时|200}
{找图 | 活动关闭 | 按键=['T','ESC',50] | 延时=300 | 范围=[[1312,146,1415,248]] | 图片=['活动关闭','活动关闭2',75]}
{重置计次 | '确认次数'}
{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{找图 | 三层退 | 组=['T三层退'] | 范围=[[1423,11,1587,173]] | 图片=['地图界面','地图界面2','地图界面3',75] | 开关={'三层退'}}
{找图 | 四层退 | 组=['T四层退'] | 范围=[[1423,11,1587,173]] | 图片=['地图界面','地图界面2','地图界面3',75] | 开关={'四层退'}}
{找图 | 中途楼层判断 | 组=['T中途楼层判断'] | 范围=[[1423,11,1587,173],[836,10,1466,199]] | 图片=['地图界面','地图界面2','地图界面3','楼层卡包选择','楼层卡包选择2','楼层卡包选择3','楼层卡包选择4',75] | 开关={'中途楼层判断'}}
{找图 | 地图界面 | 组=['T地图界面'] | 范围=[[1423,11,1587,173]] | 图片=['地图界面','地图界面2','地图界面3',75]}
{找图 | 获得EGO | 点击=['T',800,666,50] | 延时=200 | 范围=[[552,170,1093,287]] | 图片=['获得EGO礼物',85]}
{找图 | 战斗中标志 | 组=['T战斗中标志'] | 范围=[[1298,4,1594,160],[3,13,111,121]] | 图片=['战斗中标志','战斗中标志2','战斗中标志3','战斗中标志4',80]}
{找图 | 首次选人 | 组=['T首次选人'] | 范围=[[75,445,224,484],[200,0,432,159]] | 图片=['首次选人','首次选人2',80]}
{找图 | 星之恩惠 | 组=['T星之恩惠'] | 范围=[[1163,12,1287,110]] | 图片=['星之恩惠',85]}
{找图 | 星之恩惠 | 组=['T星之恩惠'] | 范围=[[294,8,480,111],[714,290,898,390]] | 图片=['星之恩惠2','星之恩惠3',85]}
{找图 | 首次选择EGO礼物 | 跳转=['T首次选择EGO礼物'] | 范围=[[953,164,1289,247]] | 图片=['首次选择EGO礼物','首次选择EGO礼物2',70]}
{找图 | EGO礼物选择 | 组=['TEGO礼物选择'] | 范围=[[996,601,1562,825]] | 图片=['EGO礼物选择','EGO礼物选择2','EGO礼物选择3',75]}
{找图 | 战斗报酬选择 | 组=['T战斗报酬选择'] | 范围=[[259,26,994,237]] | 图片=['战斗报酬选择','战斗报酬选择-中字1','战斗报酬选择-中字2','不跳过报酬获取-中字1','不跳过报酬获取','战斗报酬选择2',75]}
{找图 | 楼层卡包选择 | 组=['T楼层卡包选择'] | 范围=[[836,10,1466,199]] | 图片=['楼层卡包选择','楼层卡包选择2','楼层卡包选择3','楼层卡包选择4',85]}
{找图 | 战斗选人 | 组=['T战斗选人'] | 范围=[[1342,118,1500,238]] | 图片=['战斗选人','战斗选人2','战斗选人3',70]}
{找图 | 商店 | 组=['T商店'] | 范围=[[248,115,670,443]] | 图片=['商店',85]}
{找图 | 问号 | 组=['T问号'] | 范围=[[364,40,514,155]] | 图片=['问号','问号2',85]}
{找图 | 开始界面 | 点击=['T',780,623,50] | 延时=1000 | 范围=[[301,774,428,873]] | 图片=['开始界面','开始界面2',85]}
{找图 | 结算 | 组=['T结算'] | 范围=[[1119,47,1546,304],[1227,604,1551,809],[153,100,443,237],[7,229,394,446]] | 图片=['战斗胜利','战斗胜利-中字','战斗败北','战斗败北-中字','探查完了','确认领取','确认领取2','数据分析',85]}
{跳转 | '处理错误'}
)
[▰▰▰▰▰▰[队伍轮换页]▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰]=(
{跳出 | 'TF'}
)
[首次选择EGO礼物偏移1]=(
{判断 | [[{'地牢完成次数2'},'等于',1],{组=['T第一队体系']}]}
{判断 | [[{'地牢完成次数2'},'等于',2],{组=['T第二队体系']}]}
{判断 | [[{'地牢完成次数2'},'等于',3],{组=['T第三队体系']}]}
{判断 | [[{'地牢完成次数2'},'等于',4],{组=['T第四队体系']}]}
{判断 | [[{'地牢完成次数2'},'等于',5],{组=['T第五队体系']}]}
{判断 | [[{'地牢完成次数2'},'等于',6],{组=['T第六队体系']}]}
{组 | '重置队伍变量'}
{赋值 | [[{'第一顺位'},1],[{'第二顺位'},0]]}
{组 | {'变量_礼物1_优先级'}}
{赋值 | [[{'第一顺位'},0],[{'第二顺位'},1]]}
{组 | {'变量_礼物2_优先级'}}
{赋值 | [[{'第一顺位'},0],[{'第二顺位'},0]]}
{跳出 | 'TF'}
)
[重置队伍变量]=(
{赋值 | [[{'沉沦'},0],[{'沉沦1'},0],[{'沉沦2'},0]]}
{赋值 | [[{'破裂'},0],[{'破裂1'},0],[{'破裂2'},0]]}
{赋值 | [[{'充能'},0],[{'充能1'},0],[{'充能2'},0]]}
{赋值 | [[{'震颤'},0],[{'震颤1'},0],[{'震颤2'},0]]}
{赋值 | [[{'呼吸'},0],[{'呼吸1'},0],[{'呼吸2'},0]]}
{赋值 | [[{'流血'},0],[{'流血1'},0],[{'流血2'},0]]}
{赋值 | [[{'烧伤'},0],[{'烧伤1'},0],[{'烧伤2'},0]]}
{赋值 | [[{'烧伤'},0],[{'烧伤1'},0],[{'烧伤2'},0]]}
{跳出 | 'TF'}
)
[队伍轮换]=(
{滑动 | [150,564,150,654,2,20] | 延时=1000 | 开关={'第六队'}}
{判断 | [[{'地牢完成次数2'},'大于',{'轮换队伍数量'}],{赋值=['T',[{'地牢完成次数2'},1]]}]}
{判断 | [[{'地牢完成次数2'},'等于',6],{组=['T队伍轮换-第六队']}]}
{计算 | [[{'地牢完成次数2'},'*',45,{'选人偏移值'}]]}
{找图 | 编成栏第一位 | 点击=['T',140,455,50] | 偏移=[0,{'选人偏移值'}] | 延时=1000 | 范围=[[54,402,233,716]] | 图片=['编成栏',85]}
{赋值 | [[{'第六队'},0]]}
{跳至 | ['首次选人','买入']}
)
[队伍轮换-第六队]=(
{滑动 | [150,654,150,564,2,20] | 延时=1300}
{点击 | [147,641,50]}
{赋值 | [[{'第六队'},1]]}
{跳至 | ['首次选人','买入']}
)
[第一队体系]=(
{赋值 | [[{'斩击'},0],[{'打击'},0],[{'突刺'},0],[{'物理优先'},0]]}
{判断 | [[{'体系-队伍一'},'等于','斩击'],{赋值=['T',[{'斩击'},1],[{'物理优先'},1]]}]}
{判断 | [[{'体系-队伍一'},'等于','打击'],{赋值=['T',[{'打击'},1],[{'物理优先'},1]]}]}
{判断 | [[{'体系-队伍一'},'等于','突刺'],{赋值=['T',[{'突刺'},1],[{'物理优先'},1]]}]}
{赋值 | [[{'变量_礼物1_优先级'},'礼物_空']]}
{赋值 | [[{'变量_礼物2_优先级'},'礼物_空']]}
{跳出 | 'T' | 开关={'物理优先'}}
{赋值 | [[{'变量_礼物1_优先级'},{'体系-队伍一'}]]}
{赋值 | [[{'变量_礼物2_优先级'},{'体系-队伍一'}]]}
{组 | '备选队伍1' | 开关={'轮换启用备用队伍'}}
{赋值 | [[{'第一顺位'},1],[{'第二顺位'},0]]}
{组 | {'变量_礼物1_优先级'}}
{赋值 | [[{'第一顺位'},0],[{'第二顺位'},1]]}
{组 | {'变量_礼物2_优先级'}}
{赋值 | [[{'第一顺位'},0],[{'第二顺位'},0]]}
{组 | '合成跟随队伍体系' | 开关={'合成跟随队伍体系'}}
{赋值 | [[{'一号位合成'},0],[{'二号位合成'},0]]}
{判断 | [[{'合成体系1'},'等于','合成_礼物_空'],{赋值=['T',[{'一号位合成'},0]]}]}
{判断 | [[{'合成体系2'},'等于','合成_礼物_空'],{赋值=['T',[{'二号位合成'},0]]}]}
{跳出 | 'TF'}
)
[第二队体系]=(
{赋值 | [[{'斩击'},0],[{'打击'},0],[{'突刺'},0],[{'物理优先'},0]]}
{判断 | [[{'体系-队伍二'},'等于','斩击'],{赋值=['T',[{'斩击'},1],[{'物理优先'},1]]}]}
{判断 | [[{'体系-队伍二'},'等于','打击'],{赋值=['T',[{'打击'},1],[{'物理优先'},1]]}]}
{判断 | [[{'体系-队伍二'},'等于','突刺'],{赋值=['T',[{'突刺'},1],[{'物理优先'},1]]}]}
{赋值 | [[{'变量_礼物1_优先级'},'礼物_空']]}
{赋值 | [[{'变量_礼物2_优先级'},'礼物_空']]}
{跳出 | 'T' | 开关={'物理优先'}}
{赋值 | [[{'变量_礼物1_优先级'},{'体系-队伍二'}]]}
{赋值 | [[{'变量_礼物2_优先级'},{'体系-队伍二'}]]}
{组 | '备选队伍2' | 开关={'轮换启用备用队伍'}}
{赋值 | [[{'第一顺位'},1],[{'第二顺位'},0]]}
{组 | {'变量_礼物1_优先级'}}
{赋值 | [[{'第一顺位'},0],[{'第二顺位'},1]]}
{组 | {'变量_礼物2_优先级'}}
{赋值 | [[{'第一顺位'},0],[{'第二顺位'},0]]}
{组 | '合成跟随队伍体系' | 开关={'合成跟随队伍体系'}}
{赋值 | [[{'一号位合成'},0],[{'二号位合成'},0]]}
{判断 | [[{'合成体系1'},'等于','合成_礼物_空'],{赋值=['T',[{'一号位合成'},0]]}]}
{判断 | [[{'合成体系2'},'等于','合成_礼物_空'],{赋值=['T',[{'二号位合成'},0]]}]}
{跳出 | 'TF'}
)
[第三队体系]=(
{赋值 | [[{'斩击'},0],[{'打击'},0],[{'突刺'},0],[{'物理优先'},0]]}
{判断 | [[{'体系-队伍三'},'等于','斩击'],{赋值=['T',[{'斩击'},1],[{'物理优先'},1]]}]}
{判断 | [[{'体系-队伍三'},'等于','打击'],{赋值=['T',[{'打击'},1],[{'物理优先'},1]]}]}
{判断 | [[{'体系-队伍三'},'等于','突刺'],{赋值=['T',[{'突刺'},1],[{'物理优先'},1]]}]}
{赋值 | [[{'变量_礼物1_优先级'},'礼物_空']]}
{赋值 | [[{'变量_礼物2_优先级'},'礼物_空']]}
{跳出 | 'T' | 开关={'物理优先'}}
{赋值 | [[{'变量_礼物1_优先级'},{'体系-队伍三'}]]}
{赋值 | [[{'变量_礼物2_优先级'},{'体系-队伍三'}]]}
{组 | '备选队伍3' | 开关={'轮换启用备用队伍'}}
{赋值 | [[{'第一顺位'},1],[{'第二顺位'},0]]}
{组 | {'变量_礼物1_优先级'}}
{赋值 | [[{'第一顺位'},0],[{'第二顺位'},1]]}
{组 | {'变量_礼物2_优先级'}}
{赋值 | [[{'第一顺位'},0],[{'第二顺位'},0]]}
{组 | '合成跟随队伍体系' | 开关={'合成跟随队伍体系'}}
{赋值 | [[{'一号位合成'},0],[{'二号位合成'},0]]}
{判断 | [[{'合成体系1'},'等于','合成_礼物_空'],{赋值=['T',[{'一号位合成'},0]]}]}
{判断 | [[{'合成体系2'},'等于','合成_礼物_空'],{赋值=['T',[{'二号位合成'},0]]}]}
{跳出 | 'TF'}
)
[第四队体系]=(
{赋值 | [[{'斩击'},0],[{'打击'},0],[{'突刺'},0],[{'物理优先'},0]]}
{判断 | [[{'体系-队伍四'},'等于','斩击'],{赋值=['T',[{'斩击'},1],[{'物理优先'},1]]}]}
{判断 | [[{'体系-队伍四'},'等于','打击'],{赋值=['T',[{'打击'},1],[{'物理优先'},1]]}]}
{判断 | [[{'体系-队伍四'},'等于','突刺'],{赋值=['T',[{'突刺'},1],[{'物理优先'},1]]}]}
{赋值 | [[{'变量_礼物1_优先级'},'礼物_空']]}
{赋值 | [[{'变量_礼物2_优先级'},'礼物_空']]}
{跳出 | 'T' | 开关={'物理优先'}}
{赋值 | [[{'变量_礼物1_优先级'},{'体系-队伍四'}]]}
{赋值 | [[{'变量_礼物2_优先级'},{'体系-队伍四'}]]}
{组 | '备选队伍4' | 开关={'轮换启用备用队伍'}}
{赋值 | [[{'第一顺位'},1],[{'第二顺位'},0]]}
{组 | {'变量_礼物1_优先级'}}
{赋值 | [[{'第一顺位'},0],[{'第二顺位'},1]]}
{组 | {'变量_礼物2_优先级'}}
{赋值 | [[{'第一顺位'},0],[{'第二顺位'},0]]}
{组 | '合成跟随队伍体系' | 开关={'合成跟随队伍体系'}}
{赋值 | [[{'一号位合成'},0],[{'二号位合成'},0]]}
{判断 | [[{'合成体系1'},'等于','合成_礼物_空'],{赋值=['T',[{'一号位合成'},0]]}]}
{判断 | [[{'合成体系2'},'等于','合成_礼物_空'],{赋值=['T',[{'二号位合成'},0]]}]}
{跳出 | 'TF'}
)
[第五队体系]=(
{赋值 | [[{'斩击'},0],[{'打击'},0],[{'突刺'},0],[{'物理优先'},0]]}
{判断 | [[{'体系-队伍五'},'等于','斩击'],{赋值=['T',[{'斩击'},1],[{'物理优先'},1]]}]}
{判断 | [[{'体系-队伍五'},'等于','打击'],{赋值=['T',[{'打击'},1],[{'物理优先'},1]]}]}
{判断 | [[{'体系-队伍五'},'等于','突刺'],{赋值=['T',[{'突刺'},1],[{'物理优先'},1]]}]}
{赋值 | [[{'变量_礼物1_优先级'},'礼物_空']]}
{赋值 | [[{'变量_礼物2_优先级'},'礼物_空']]}
{跳出 | 'T' | 开关={'物理优先'}}
{赋值 | [[{'变量_礼物1_优先级'},{'体系-队伍五'}]]}
{赋值 | [[{'变量_礼物2_优先级'},{'体系-队伍五'}]]}
{组 | '备选队伍5' | 开关={'轮换启用备用队伍'}}
{赋值 | [[{'第一顺位'},1],[{'第二顺位'},0]]}
{组 | {'变量_礼物1_优先级'}}
{赋值 | [[{'第一顺位'},0],[{'第二顺位'},1]]}
{组 | {'变量_礼物2_优先级'}}
{赋值 | [[{'第一顺位'},0],[{'第二顺位'},0]]}
{组 | '合成跟随队伍体系' | 开关={'合成跟随队伍体系'}}
{赋值 | [[{'一号位合成'},0],[{'二号位合成'},0]]}
{判断 | [[{'合成体系1'},'等于','合成_礼物_空'],{赋值=['T',[{'一号位合成'},0]]}]}
{判断 | [[{'合成体系2'},'等于','合成_礼物_空'],{赋值=['T',[{'二号位合成'},0]]}]}
{跳出 | 'TF'}
)
[第六队体系]=(
{赋值 | [[{'斩击'},0],[{'打击'},0],[{'突刺'},0],[{'物理优先'},0]]}
{判断 | [[{'体系-队伍六'},'等于','斩击'],{赋值=['T',[{'斩击'},1],[{'物理优先'},1]]}]}
{判断 | [[{'体系-队伍六'},'等于','打击'],{赋值=['T',[{'打击'},1],[{'物理优先'},1]]}]}
{判断 | [[{'体系-队伍六'},'等于','突刺'],{赋值=['T',[{'突刺'},1],[{'物理优先'},1]]}]}
{赋值 | [[{'变量_礼物1_优先级'},'礼物_空']]}
{赋值 | [[{'变量_礼物2_优先级'},'礼物_空']]}
{跳出 | 'T' | 开关={'物理优先'}}
{赋值 | [[{'变量_礼物1_优先级'},{'体系-队伍六'}]]}
{赋值 | [[{'变量_礼物2_优先级'},{'体系-队伍六'}]]}
{组 | '备选队伍6' | 开关={'轮换启用备用队伍'}}
{赋值 | [[{'第一顺位'},1],[{'第二顺位'},0]]}
{组 | {'变量_礼物1_优先级'}}
{赋值 | [[{'第一顺位'},0],[{'第二顺位'},1]]}
{组 | {'变量_礼物2_优先级'}}
{赋值 | [[{'第一顺位'},0],[{'第二顺位'},0]]}
{组 | '合成跟随队伍体系' | 开关={'合成跟随队伍体系'}}
{赋值 | [[{'一号位合成'},0],[{'二号位合成'},0]]}
{判断 | [[{'合成体系1'},'等于','合成_礼物_空'],{赋值=['T',[{'一号位合成'},0]]}]}
{判断 | [[{'合成体系2'},'等于','合成_礼物_空'],{赋值=['T',[{'二号位合成'},0]]}]}
{跳出 | 'TF'}
)
[▰▰▰▰▰▰[首次进入地牢]▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰]=(
{跳出 | 'TF'}
)

[首次选择EGO礼物]=(
{空参 | 正在重构TT2协议}
{延时 | 200}
{组 | '首次选择EGO礼物偏移1' | 开关={'队伍轮换'}}
{组 | '首次选择EGO礼物2' | 开关={'物理优先'}}
//{找图|首次选择EGO礼物|延时=200|点击=['T',0,0,50]|跳至=['T','首次选择EGO礼物','喵']|范围=[[144,158,945,730]]|图片=[{'变量_礼物1_优先级'},{'变量_礼物1_优先级_中字'},85]}
{空参 | 烧伤 | 点击=['T',264,210,50] | 跳至=['T','首次选择EGO礼物','喵'] | 延时=300 | 开关={'烧伤1'}}
{空参 | 流血 | 点击=['T',447,215,50] | 跳至=['T','首次选择EGO礼物','喵'] | 延时=300 | 开关={'流血1'}}
{空参 | 震颤 | 点击=['T',635,216,50] | 跳至=['T','首次选择EGO礼物','喵'] | 延时=300 | 开关={'震颤1'}}
{空参 | 破裂 | 点击=['T',820,211,50] | 跳至=['T','首次选择EGO礼物','喵'] | 延时=300 | 开关={'破裂1'}}
{空参 | 沉沦 | 点击=['T',265,467,50] | 跳至=['T','首次选择EGO礼物','喵'] | 延时=300 | 开关={'沉沦1'}}
{空参 | 呼吸 | 点击=['T',454,470,50] | 跳至=['T','首次选择EGO礼物','喵'] | 延时=300 | 开关={'呼吸1'}}
{空参 | 充能 | 点击=['T',642,467,50] | 跳至=['T','首次选择EGO礼物','喵'] | 延时=300 | 开关={'充能1'}}

//{找图|初始礼物随机|点击=['T',0,0,50]|延时=1000|范围=[[144,158,945,730]]|图片=['初始礼物随机',85]}
{空参 | 喵}
//{组|'首次选择EGO礼物偏移1'|开关={'队伍轮换'}}
//检查有没有三级礼物
//{找图|初始三级礼物选择|点击=['T',0,0,50]|延时=1000|范围=[[950,529,1130,666]]|图片=['初始三级礼物选择',85]}

//第一个礼物
{点击 | [1025,324,50] | 延时=300 | 开关={'第一个礼物'}}
//第二个礼物
{点击 | [1025,440,50] | 延时=300 | 开关={'第二个礼物'}}
//第三个礼物
{点击 | [1025,540,50] | 延时=300 | 开关={'第三个礼物'}}
//启动
{点击 | [1335,730,60] | 延时=100}

{找图 | 服务器加载 | 循环=['T',999,100] | 范围=[[1250,22,1575,158]] | 图片=['加载中',85]}
{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{延时 | 400}

{点击 | [834,691,50] | 延时=1000 | 开关={'第一个礼物'}}
{点击 | [834,691,50] | 延时=1000 | 开关={'第二个礼物'}}
{点击 | [834,691,50] | 延时=1000 | 开关={'第三个礼物'}}
{跳转 | '首次选人'}
)
[首次选择EGO礼物2]=(
{滑动 | [850,600,850,400] | 延时=500}
{空参 | 斩击 | 点击=['T',814,228,50] | 跳至=['T','首次选择EGO礼物','喵'] | 延时=300 | 开关={'斩击'}}
{空参 | 突刺 | 点击=['T',265,487,50] | 跳至=['T','首次选择EGO礼物','喵'] | 延时=300 | 开关={'突刺'}}
{空参 | 打击 | 点击=['T',449,488,50] | 跳至=['T','首次选择EGO礼物','喵'] | 延时=300 | 开关={'打击'}}
//{找图|斩击|跳至=['T','首次选择EGO礼物','喵']|点击=['T',0,0,50]|延时=300|范围=[[144,158,945,730]]|图片=['斩击','斩击-中字',85]|开关={'斩击'}}
//{找图|突刺|跳至=['T','首次选择EGO礼物','喵']|点击=['T',0,0,50]|延时=300|范围=[[144,158,945,730]]|图片=['突刺','突刺-中字',85]|开关={'突刺'}}
//{找图|打击|跳至=['T','首次选择EGO礼物','喵']|点击=['T',0,0,50]|延时=300|范围=[[144,158,945,730]]|图片=['打击','打击-中字',85]|开关={'打击'}}
)
[首次选人]=(
{找图 | 首次选人 | 跳转=['F镜本'] | 范围=[[75,445,224,484],[200,0,432,159]] | 图片=['首次选人','首次选人2',80]}
{找图 | 服务器加载 | 循环=['T',999,100] | 范围=[[1250,22,1575,158]] | 图片=['加载中',85]}
{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{赋值 | [[{'中途楼层判断'},0]]}
{赋值 | [[{'楼层判断-节点'},1],[{'楼层判断-识图'},0]] | 开关={'节点判断楼层'}}
{点击 | [94,683,50] | 延时=111 | 开关={'首次选人识别编队'}}
{移动 | [40,830,200,2] | 延时=111}
{组 | '队伍轮换' | 开关={'队伍轮换'}}
{组 | '首次选人固定编队' | 开关={'首次选人固定编队'}}
{找图 | 镜之迷宫编队 | 点击=['T',0,0,50] | 跳至=['T','首次选人','买入'] | 延时=300 | 范围=[[54,402,233,716]] | 图片=['镜之迷宫编队','镜之迷宫编队-中字','镜之迷宫编队2',75]}
{找图 | 编成栏第一位 | 点击=['T',140,507,50] | 延时=300 | 范围=[[54,402,233,716]] | 图片=['编成栏',85]}

{空参 | 买入}
//{找色|买入|点击=['T',0,0,50]|延时=1000|范围=[[1334,694,1539,782]]|颜色=['#EFCEA4','-1,-3,#EFCDA4/1,-5,#EFCEA4/4,-10,#EFCDA3',80]}
{点击 | [1444,733,50] | 延时=400}
{找图 | 服务器加载 | 循环=['T',999,100] | 范围=[[1250,22,1575,158]] | 图片=['加载中',85]}
{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{延时 | 400}
{跳转 | '镜本'}
)
[首次选人固定编队]=(
{赋值 | [[{'第一队'},0],[{'第二队'},0],[{'第三队'},0],[{'第四队'},0],[{'第五队'},0],[{'第六队'},0]]}
{组 | {'变量_镜之地牢_队伍优先级'} | 开关={'首次选人固定编队'}}
{点击 | [145,510,50] | 延时=100 | 开关={'第一队'}}
{点击 | [145,560,50] | 延时=100 | 开关={'第二队'}}
{点击 | [145,600,50] | 延时=100 | 开关={'第三队'}}
{点击 | [145,650,50] | 延时=100 | 开关={'第四队'}}
{点击 | [145,680,50] | 延时=100 | 开关={'第五队'}}
{空参 | 跳转 | 跳至=['TF','首次选人','买入']}
)
[▰▰▰▰▰▰[道中资源获取]▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰]=(
{跳出 | 'TF'}
)
[礼物选择范围]=(
//Y1-175/Y2-551
{赋值 | [[{'礼物坐标X1'},126],[{'礼物坐标X2'},477],[{'礼物坐标X3'},457],[{'礼物坐标X4'},808],[{'礼物坐标X5'},788],[{'礼物坐标X6'},1139],[{'礼物坐标X7'},1119],[{'礼物坐标X8'},1470]] | 开关={'困难选择'}}
//理论上不会有问题
{判断 | [[{'困难选择'},'等于',0],{赋值=['T',[{'礼物坐标X1'},291],[{'礼物坐标X2'},642],[{'礼物坐标X3'},622],[{'礼物坐标X4'},973],[{'礼物坐标X5'},953],[{'礼物坐标X6'},1304]]}]}

{找图 | H已获得1 | 赋值=['T',[{'礼物坐标X1'},1],[{'礼物坐标X2'},226]] | 范围=[[126,167,477,505]] | 图片=['选择-已获得','EGO礼物获取-白树棉1','EGO礼物获取-白树棉2',80] | 开关={'困难选择'}}
{找图 | H已获得2 | 赋值=['T',[{'礼物坐标X3'},1],[{'礼物坐标X4'},226]] | 范围=[[457,167,808,505]] | 图片=['选择-已获得','EGO礼物获取-白树棉1','EGO礼物获取-白树棉2',80] | 开关={'困难选择'}}
{找图 | H已获得3 | 赋值=['T',[{'礼物坐标X5'},1],[{'礼物坐标X6'},226]] | 范围=[[788,167,1139,505]] | 图片=['选择-已获得','EGO礼物获取-白树棉1','EGO礼物获取-白树棉2',80] | 开关={'困难选择'}}
{找图 | H已获得4 | 赋值=['T',[{'礼物坐标X7'},1],[{'礼物坐标X8'},226]] | 范围=[[1119,167,1470,505]] | 图片=['选择-已获得','EGO礼物获取-白树棉1','EGO礼物获取-白树棉2',80] | 开关={'困难选择'}}
{跳出 | 'TF' | 开关={'困难选择'}}

{找图 | N已获得1 | 赋值=['T',[{'礼物坐标X1'},1],[{'礼物坐标X2'},226]] | 范围=[[291,167,642,505]] | 图片=['选择-已获得','EGO礼物获取-白树棉1','EGO礼物获取-白树棉2',80]}
{找图 | N已获得2 | 赋值=['T',[{'礼物坐标X3'},1],[{'礼物坐标X4'},226]] | 范围=[[622,167,973,505]] | 图片=['选择-已获得','EGO礼物获取-白树棉1','EGO礼物获取-白树棉2',80]}
{找图 | N已获得3 | 赋值=['T',[{'礼物坐标X5'},1],[{'礼物坐标X6'},226]] | 范围=[[953,167,1304,505]] | 图片=['选择-已获得','EGO礼物获取-白树棉1','EGO礼物获取-白树棉2',80]}
{跳出 | 'TF'}
)
[礼物选择范围2]=(
//Y1-175/Y2-551
//{赋值|[[{'礼物坐标X1'},126],[{'礼物坐标X2'},477],[{'礼物坐标X3'},457],[{'礼物坐标X4'},808],[{'礼物坐标X5'},788],[{'礼物坐标X6'},1139],[{'礼物坐标X7'},1119],[{'礼物坐标X8'},1470]]|开关={'镜本困难'}}
{赋值 | [[{'选择变量'},0],[{'选择变量1'},0],[{'选择变量2'},0]]}
{判断 | [[{'礼物坐标X1'},'等于',1],{跳至=['T','礼物选择范围2','2']}]}
{找图 | H已获得1 | 赋值=['T',[{'礼物坐标X1'},1],[{'礼物坐标X2'},226]] | 跳至=['T','礼物选择范围2','2'] | 范围=[[126,167,477,505]] | 图片=['选择-已获得','选择-待拿取','EGO礼物获取-白树棉1','EGO礼物获取-白树棉2',80]}
{找色 | 选择-待拿取 | 赋值=['T',[{'礼物坐标X1'},1],[{'礼物坐标X2'},226]] | 跳至=['T','礼物选择范围2','2'] | 范围=[[126,167,477,240]] | 颜色=['#FD6100','6,4,#F5C100/9,7,#F75F01',85]}
{空参 | 2}
{判断 | [[{'礼物坐标X3'},'等于',1],{跳至=['T','礼物选择范围2','3']}]}
{找图 | H已获得2 | 赋值=['T',[{'礼物坐标X3'},1],[{'礼物坐标X4'},226]] | 跳至=['T','礼物选择范围2','3'] | 范围=[[457,167,808,505]] | 图片=['选择-已获得','选择-待拿取','EGO礼物获取-白树棉1','EGO礼物获取-白树棉2',80]}
{找色 | 选择-待拿取 | 赋值=['T',[{'礼物坐标X3'},1],[{'礼物坐标X4'},226]] | 跳至=['T','礼物选择范围2','3'] | 范围=[[457,167,808,240]] | 颜色=['#FD6100','6,4,#F5C100/9,7,#F75F01',85]}
{空参 | 3}
{判断 | [[{'礼物坐标X5'},'等于',1],{跳至=['T','礼物选择范围2','4']}]}
{找图 | H已获得3 | 赋值=['T',[{'礼物坐标X5'},1],[{'礼物坐标X6'},226]] | 跳至=['T','礼物选择范围2','4'] | 范围=[[788,167,1139,505]] | 图片=['选择-已获得','选择-待拿取','EGO礼物获取-白树棉1','EGO礼物获取-白树棉2',80]}
{找色 | 选择-待拿取 | 赋值=['T',[{'礼物坐标X5'},1],[{'礼物坐标X6'},226]] | 跳至=['T','礼物选择范围2','4'] | 范围=[[788,167,1139,240]] | 颜色=['#FD6100','6,4,#F5C100/9,7,#F75F01',85]}
{空参 | 4}
{判断 | [[{'礼物坐标X7'},'等于',1],{跳至=['T','礼物选择范围2','0']}]}
{找图 | H已获得4 | 赋值=['T',[{'礼物坐标X7'},1],[{'礼物坐标X8'},226]] | 跳至=['T','礼物选择范围2','0'] | 范围=[[1119,167,1470,505]] | 图片=['选择-已获得','选择-待拿取','EGO礼物获取-白树棉1','EGO礼物获取-白树棉2',80]}
{找色 | 选择-待拿取 | 赋值=['T',[{'礼物坐标X7'},1],[{'礼物坐标X8'},226]] | 跳至=['T','礼物选择范围2','0'] | 范围=[[1119,167,1470,505]] | 颜色=['#FD6100','6,4,#F5C100/9,7,#F75F01',85]}
{空参 | 0}
{计算 | [[{'礼物坐标X1'},'+',{'礼物坐标X3'},{'选择变量1'}]]}
{计算 | [[{'礼物坐标X5'},'+',{'礼物坐标X7'},{'选择变量2'}]]}
{计算 | [[{'选择变量1'},'+',{'选择变量2'},{'选择变量'}]]}
{判断 | [[{'选择变量'},'等于',4],{组=['T礼物选择范围3']}]}
{赋值 | [[{'困难选择'},0]]}
{跳至 | ['EGO礼物选择','选择礼物']}
{跳出 | 'TF'}
)
[礼物选择范围3]=(
//Y1-175/Y2-551
{赋值 | [[{'礼物坐标X1'},126],[{'礼物坐标X2'},477],[{'礼物坐标X3'},457],[{'礼物坐标X4'},808],[{'礼物坐标X5'},788],[{'礼物坐标X6'},1139],[{'礼物坐标X7'},1119],[{'礼物坐标X8'},1470]]}
{赋值 | [[{'选择变量'},0],[{'选择变量1'},0],[{'选择变量2'},0]]}
{找图 | H已获得1 | 赋值=['T',[{'礼物坐标X1'},1],[{'礼物坐标X2'},226]] | 跳至=['T','礼物选择范围3','2'] | 范围=[[126,167,477,505]] | 图片=['选择-待拿取','EGO礼物获取-白树棉1','EGO礼物获取-白树棉2',80]}
{找色 | 选择-待拿取 | 赋值=['T',[{'礼物坐标X1'},1],[{'礼物坐标X2'},226]] | 跳至=['T','礼物选择范围3','2'] | 范围=[[126,167,477,240]] | 颜色=['#FD6100','6,4,#F5C100/9,7,#F75F01',80]}
{空参 | 2}
{找图 | H已获得2 | 赋值=['T',[{'礼物坐标X3'},1],[{'礼物坐标X4'},226]] | 跳至=['T','礼物选择范围3','3'] | 范围=[[457,167,808,505]] | 图片=['选择-待拿取','EGO礼物获取-白树棉1','EGO礼物获取-白树棉2',80]}
{找色 | 选择-待拿取 | 赋值=['T',[{'礼物坐标X3'},1],[{'礼物坐标X4'},226]] | 跳至=['T','礼物选择范围3','3'] | 范围=[[457,167,808,240]] | 颜色=['#FD6100','6,4,#F5C100/9,7,#F75F01',80]}
{空参 | 3}
{找图 | H已获得3 | 赋值=['T',[{'礼物坐标X5'},1],[{'礼物坐标X6'},226]] | 跳至=['T','礼物选择范围3','4'] | 范围=[[788,167,1139,505]] | 图片=['选择-待拿取','EGO礼物获取-白树棉1','EGO礼物获取-白树棉2',80]}
{找色 | 选择-待拿取 | 赋值=['T',[{'礼物坐标X5'},1],[{'礼物坐标X6'},226]] | 跳至=['T','礼物选择范围3','4'] | 范围=[[788,167,1139,240]] | 颜色=['#FD6100','6,4,#F5C100/9,7,#F75F01',80]}
{空参 | 4}
{找图 | H已获得4 | 赋值=['T',[{'礼物坐标X7'},1],[{'礼物坐标X8'},226]] | 跳至=['T','礼物选择范围3','0'] | 范围=[[1119,167,1470,505]] | 图片=['选择-待拿取','EGO礼物获取-白树棉1','EGO礼物获取-白树棉2',80]}
{找色 | 选择-待拿取 | 赋值=['T',[{'礼物坐标X7'},1],[{'礼物坐标X8'},226]] | 跳至=['T','礼物选择范围3','0'] | 范围=[[1119,167,1470,505]] | 颜色=['#FD6100','6,4,#F5C100/9,7,#F75F01',80]}
{空参 | 0}
{赋值 | [[{'困难选择'},0]]}
{跳至 | ['EGO礼物选择','选择礼物']}
{跳出 | 'TF'}
)
[EGO礼物选择]=(

{找图 | EGO礼物选择 | 跳出='F' | 延时=50 | 范围=[[996,601,1562,825]] | 图片=['EGO礼物选择','EGO礼物选择2','EGO礼物选择3',85]}
{移动 | [1363,732,200,2]}
{延时 | 200}
{按键 | ['F12',50] | 开关={'选择截图'}}
{赋值 | [[{'困难选择'},1]] | 开关={'镜本困难'}}
{找图 | 苦难 | 赋值=['T',[{'层数判定'},1]] | 延时=50 | 范围=[[296,504,1305,700]] | 图片=['苦难',80]}
{移动 | [1363,732,200,2]}
{找图 | 三选一 | 赋值=['T',[{'困难选择'},0]] | 范围=[[967,384,1035,540]] | 图片=['只有一个礼物',75] | 开关={'镜本困难'}}
{找图 | 只有一个礼物 | 跳至=['F','EGO礼物选择','中间'] | 赋值=['F',[{'困难选择'},0]] | 范围=[[792,206,1395,627]] | 图片=['只有一个礼物',75]}
{组 | '礼物选择范围'}
{空参 | 选择礼物}
{找图 | 月之记忆 | 点击=['T',0,0,50] | 按键=['T','F12',50] | 组=['TEGO礼物选择3'] | 范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]] | 图片=['选择-月之记忆1','选择-月之记忆2',85]}
{找图 | 信念 | 点击=['T',0,0,50] | 组=['TEGO礼物选择3'] | 范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]] | 图片=['选择-信念1','选择-信念2',85]}
{找图 | 高级 | 点击=['T',0,0,50] | 组=['TEGO礼物选择3'] | 范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]] | 图片=['选择-五级','选择-四级','选择-三级',85] | 开关={'先选三级'}}
{组 | {'变量_礼物1_优先级'} | 开关={'顺位一最高优先'}}
{组 | 'EGO礼物选择2' | 开关={'物理优先'}}
{组 | '资源类EGO礼物选择' | 开关={'资源类'}}
{组 | {'变量_礼物1_优先级'} | 开关={'顺位一'}}
{组 | {'变量_礼物2_优先级'} | 开关={'顺位二'}}
{组 | '回复类EGO礼物选择' | 开关={'回复类'}}
{组 | '经济类EGO礼物选择' | 开关={'经济类'}}
{赋值 | [[{'没有体系'},1]]}
{赋值 | [[{'先选3级'},1]] | 开关={'没有体系'}}
{找图 | 卡蜜拉 | 点击=['T',0,0,50] | 组=['TEGO礼物选择3'] | 范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]] | 图片=['选择-卡蜜拉1','选择-卡蜜拉2',85]}
{找图 | 探戈鸡酱料 | 点击=['T',0,0,50] | 组=['TEGO礼物选择3'] | 范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]] | 图片=['选择-探戈鸡酱料1','选择-探戈鸡酱料2',85]}
//未截取{找图|锐利的针与线|点击=['T',0,0,50]|组=['TEGO礼物选择3']|范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]]|图片=['选择-锐利的针与线1','选择-锐利的针与线2',85]}
{找图 | 朱红蛾群 | 点击=['T',0,0,50] | 组=['TEGO礼物选择3'] | 范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]] | 图片=['选择-朱红蛾群1','选择-朱红蛾群2',85]}
//{找图|锈蚀的纪念币|点击=['T',0,0,50]|组=['TEGO礼物选择3']|范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]]|图片=['选择-锈蚀的纪念币1','选择-锈蚀的纪念币2',85]}
//{找图|幻痛|点击=['T',0,0,50]|组=['TEGO礼物选择3']|范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]]|图片=['选择-幻痛1','选择-幻痛2',85]}
{找图 | 特别合约 | 点击=['T',0,0,50] | 组=['TEGO礼物选择3'] | 范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]] | 图片=['选择-特别合约1','选择-特别合约2',85]}
//{找图|膏血|点击=['T',0,0,50]|组=['TEGO礼物选择3']|范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]]|图片=['选择-膏血1','选择-膏血2',85]}
{找图 | 等级 | 点击=['T',0,0,50] | 组=['TEGO礼物选择3'] | 范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]] | 图片=['选择-五级','选择-四级','选择-三级','选择-二级','选择-一级',85]}
{空参 | 喵}
{组 | '斩击' | 开关={'斩击'}}
{组 | '突刺' | 开关={'突刺'}}
{组 | '打击' | 开关={'打击'}}
//中间的
{空参 | 中间}
{找图 | 高级 | 点击=['T',0,0,50] | 组=['TEGO礼物选择3'] | 范围=[[195,155,1411,581]] | 图片=['选择-五级','选择-四级','选择-三级',85]}
{找图 | 白树棉 | 组=['T有脏东西'] | 范围=[[519,170,1103,453]] | 图片=['EGO礼物获取-白树棉1','EGO礼物获取-白树棉2',85]}

{找图 | 白树棉 | 点击=['T',1192,722,50] | 延时=600 | 范围=[[519,170,1103,453]] | 图片=['EGO礼物获取-白树棉1','EGO礼物获取-白树棉2',85]}
{找图 | 通用确认 | 点击=['T',0,0,500,'2L'] | 延时=200 | 范围=[[419,125,1568,871]] | 图片=['确认','确认-中字1','确认-中字2','确认1','确认2',65]}

{点击 | [675,475,50] | 延时=200}

{按键 | ['ENTER',50]}
{延时 | 200}
{找图 | 服务器加载 | 循环=['T',999,100] | 范围=[[1250,22,1575,158]] | 图片=['加载中',85]}
{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{延时 | 200}
{按键 | ['ENTER',50]}
{延时 | 1000}
{跳转 | '镜本'}
)
[EGO礼物选择2]=(
{组 | '斩击' | 开关={'斩击'}}
{组 | '突刺' | 开关={'突刺'}}
{组 | '打击' | 开关={'打击'}}
{跳出 | 'TF'}
)
[EGO礼物选择3]=(
{延时 | 200}
{判断 | [[{'困难选择'},'等于',1],{组=['T礼物选择范围2']}]}
{点击 | [1394,724,50]}
{延时 | 200}
{按键 | ['ENTER',50]}
{延时 | 200}
{找图 | 服务器加载 | 循环=['T',999,100] | 范围=[[1250,22,1575,158]] | 图片=['加载中',85]}
{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{延时 | 200}
{按键 | ['ENTER',50]}
{延时 | 500}
{按键 | ['ENTER',50] | 开关={'镜本困难'}}
{延时 | 300 | 开关={'镜本困难'}}
{赋值 | [[{'先选3级'},0]]}
{延时 | 700}
{跳转 | '镜本'}
)
[回复类EGO礼物选择]=(
{找图 | 止痛药 | 点击=['T',0,0,50] | 组=['TEGO礼物选择3'] | 范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]] | 图片=['选择-止痛药1','选择-止痛药2',85]}
{找图 | 石版字符 | 点击=['T',0,0,50] | 组=['TEGO礼物选择3'] | 范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]] | 图片=['选择-石版字符1','选择-石版字符2',85]}
{找图 | 采血包 | 点击=['T',0,0,50] | 组=['TEGO礼物选择3'] | 范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]] | 图片=['选择-采血包1','选择-采血包2',85]}
{找图 | 便携式急救包 | 点击=['T',0,0,50] | 组=['TEGO礼物选择3'] | 范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]] | 图片=['选择-便携式急救包1','选择-便携式急救包2',85]}
{找图 | 归途 | 点击=['T',0,0,50] | 组=['TEGO礼物选择3'] | 范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]] | 图片=['选择-归途1','选择-归途2',85]}

//{找图|灰色大衣|点击=['T',0,0,50]|组=['TEGO礼物选择3']|范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]]|图片=['选择-灰色大衣1','选择-灰色大衣2',85]}
//{找图|偏见|点击=['T',0,0,50]|组=['TEGO礼物选择3']|范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]]|图片=['选择-偏见1','选择-偏见2',85]}
//{找图|重叠的创可贴|点击=['T',0,0,50]|组=['TEGO礼物选择3']|范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]]|图片=['选择-重叠的创可贴1','选择-重叠的创可贴2',85]}
{跳出 | 'TF'}
)

[资源类EGO礼物选择]=(
//盛情款待未截取
{找图 | 盛情款待 | 点击=['T',0,0,50] | 组=['TEGO礼物选择3'] | 范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]] | 图片=['选择-盛情款待',85]}
{找图 | 瓶中婴孩 | 点击=['T',0,0,50] | 组=['TEGO礼物选择3'] | 范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]] | 图片=['选择-瓶中婴孩1','选择-瓶中婴孩2',85]}
{找图 | 蓝色芝宝牌打火机 | 点击=['T',0,0,50] | 组=['TEGO礼物选择3'] | 范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]] | 图片=['选择-蓝色芝宝牌打火机1','选择-蓝色芝宝牌打火机2',85]}

//{找图|咖啡与纸鹤|点击=['T',0,0,50]|组=['TEGO礼物选择3']|范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]]|图片=['选择-咖啡与纸鹤1','选择-咖啡与纸鹤2',85]}
//{找图|神谕|点击=['T',0,0,50]|组=['TEGO礼物选择3']|范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]]|图片=['选择-神谕1','选择-神谕2',85]}
//{找图|倒错症|点击=['T',0,0,50]|组=['TEGO礼物选择3']|范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]]|图片=['选择-倒错症1','选择-倒错症2',85]}
//{找图|星象盘碎片|点击=['T',0,0,50]|组=['TEGO礼物选择3']|范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]]|图片=['选择-星象盘碎片1','选择-星象盘碎片2',85]}

{跳出 | 'TF'}
)

[经济类EGO礼物选择]=(
//贪婪之锤未截取
{找图 | 贪婪之锤 | 点击=['T',0,0,50] | 组=['TEGO礼物选择3'] | 范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]] | 图片=['选择-贪婪之锤',85]}
{找图 | 生存的里程标 | 点击=['T',0,0,50] | 组=['TEGO礼物选择3'] | 范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]] | 图片=['选择-生存的里程标1','选择-生存的里程标2',75]}
{找图 | 金瓮 | 点击=['T',0,0,50] | 组=['TEGO礼物选择3'] | 范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]] | 图片=['选择-金瓮1','选择-金瓮2',75]}

//{找图|返利礼券|点击=['T',0,0,50]|组=['TEGO礼物选择3']|范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]]|图片=['选择-返利礼券1','选择-返利礼券2',85]}
//{找图|新品小册|点击=['T',0,0,50]|组=['TEGO礼物选择3']|范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]]|图片=['选择-新品小册1','选择-新品小册2',85]}
//{找图|特别目录|点击=['T',0,0,50]|组=['TEGO礼物选择3']|范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]]|图片=['选择-特别目录1','选择-特别目录2',85]}
//{找图|提前预约优惠券|点击=['T',0,0,50]|组=['TEGO礼物选择3']|范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]]|图片=['选择-提前预约优惠券1','选择-提前预约优惠券2',85]}
//{找图|翻新的商品|点击=['T',0,0,50]|组=['TEGO礼物选择3']|范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]]|图片=['选择-翻新的商品1','选择-翻新的商品2',85]}
//{找图|声望卡|点击=['T',0,0,50]|组=['TEGO礼物选择3']|范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]]|图片=['选择-声望卡1','选择-声望卡2',85]}
//{找图|体验型规划指南|点击=['T',0,0,50]|组=['TEGO礼物选择3']|范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]]|图片=['选择-体验型规划指南1','选择-体验型规划指南2',85]}
{跳出 | 'TF'}
)
[有脏东西]=(
{找图 | 白树棉 | 点击=['T',0,0,50] | 偏移=[400,0] | 延时=200 | 范围=[[83,161,1558,416]] | 图片=['EGO礼物获取-白树棉1','EGO礼物获取-白树棉2',85]}
{按键 | ['ENTER',50]}
{找图 | 白树棉 | 点击=['T',0,0,50] | 偏移=[-400,0] | 延时=200 | 范围=[[83,161,1558,416]] | 图片=['EGO礼物获取-白树棉1','EGO礼物获取-白树棉2',85]}
{按键 | ['ENTER',50]}
{跳出 | 'TF'}
)
[战斗报酬选择]=(
{找图 | 战斗报酬选择 | 跳出='F' | 延时=50 | 范围=[[259,26,994,237]] | 图片=['战斗报酬选择','战斗报酬选择-中字1','战斗报酬选择-中字2','不跳过报酬获取-中字1','不跳过报酬获取','战斗报酬选择2',75]}
{找图 | 通用确认 | 点击=['T',0,0,500,'2L'] | 延时=200 | 范围=[[419,125,1568,871]] | 图片=['确认','确认-中字1','确认-中字2','确认1','确认2',65]}
{延时 | 200 | 开关={'取消战斗报酬'}}
{点击 | [882,640,50] | 开关={'取消战斗报酬'}}
{延时 | 200 | 开关={'取消战斗报酬'}}
{点击 | [930,595,50] | 开关={'取消战斗报酬'}}
{延时 | 200 | 开关={'取消战斗报酬'}}
{按键 | ['ENTER',50] | 开关={'取消战斗报酬'}}
{延时 | 200 | 开关={'取消战斗报酬'}}
{按键 | ['ENTER',50] | 开关={'取消战斗报酬'}}
{延时 | 200 | 开关={'取消战斗报酬'}}
{找图 | 服务器加载 | 循环=['T',999,100] | 范围=[[1250,22,1575,158]] | 图片=['加载中',85]}
{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{延时 | 800 | 开关={'取消战斗报酬'}}
{跳转 | '镜本' | 开关={'取消战斗报酬'}}
//{延时|1300}
{延时 | 800}

{找图 | 不跳过报酬获取 | 点击=['T',0,0,50] | 延时=500 | 范围=[[318,363,850,625]] | 图片=['不跳过报酬获取',85]}
//呱！没有人可以阻止我同时拿经费和礼物口牙！
{找图 | 报酬选择-经费与礼物 | 点击=['T',0,0,50] | 组=['T战斗报酬选择确认'] | 赋值=['T',[{'战斗报酬选择了礼物'},1]] | 延时=300 | 范围=[[98,176,1540,669]] | 图片=['报酬选择-经费与礼物','报酬选择-经费与礼物2',75]}
{找图 | 报酬选择-经费 | 点击=['T',0,0,50] | 组=['T战斗报酬选择确认'] | 延时=300 | 范围=[[98,176,1540,669]] | 图片=['报酬选择-经费','报酬选择-经费2',95]}
//激活支援被动
{找图 | 报酬选择-E.G.O资源 | 点击=['T',0,0,50] | 组=['T战斗报酬选择确认'] | 延时=300 | 范围=[[166,225,1475,6198,176,1540,6699]] | 图片=['报酬选择-EGO资源','报酬选择-EGO资源2',75]}
//星光跟狗坐一桌
{找图 | 报酬选择-星光 | 点击=['T',0,0,50] | 组=['T战斗报酬选择确认'] | 延时=300 | 范围=[[98,176,1540,669]] | 图片=['报酬选择-星光','报酬选择-星光2',75]}
//因为非流血有拿到白棉花的风险,所以放最下面
{找图 | 报酬选择-礼物 | 点击=['T',0,0,50] | 组=['T战斗报酬选择确认'] | 赋值=['T',[{'战斗报酬选择了礼物'},1]] | 延时=300 | 范围=[[98,176,1540,669]] | 图片=['报酬选择-礼物','报酬选择-礼物2',75]}
//选择了礼物没点中
//{移动|[882,640,10]|延时=100}
{跳转 | '镜本'}
)

[战斗报酬选择确认]=(
{按键 | ['ENTER',50]}
{找图 | 服务器加载 | 循环=['T',999,100] | 范围=[[1250,22,1575,158]] | 图片=['加载中',85]}
{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{延时 | 500 | 开关={'战斗报酬选择了礼物'}}
{点击 | [790,794,50] | 延时=200 | 开关={'战斗报酬选择了礼物'}}
{按键 | ['ENTER',50]}
{找图 | 服务器加载 | 循环=['T',999,100] | 范围=[[1250,22,1575,158]] | 图片=['加载中',85]}
{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{延时 | 2800}
{按键 | ['ENTER',50]}
{赋值 | [[{'战斗报酬选择了礼物'},0]]}
{找图 | 地图界面 | 组=['T地图界面'] | 范围=[[1423,11,1587,173]] | 图片=['地图界面','地图界面2','地图界面3',75]}
{找图 | EGO礼物选择 | 组=['TEGO礼物选择'] | 范围=[[996,601,1562,825]] | 图片=['EGO礼物选择','EGO礼物选择2','EGO礼物选择3',75]}
{跳转 | '镜本'}
)
[▰▰▰▰▰▰[楼层主题包选择]▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰]=(
{跳出 | 'TF'}
)
[难度切换]=(
{找图 | 改为普通难度 | 点击=['T',1132,55,50] | 赋值=['T',[{'点了'},1]] | 范围=[[31,601,569,781]] | 图片=['困难难度',90] | 开关={'镜本普通'}}
{找图 | 改为困难难度 | 点击=['F',1132,55,50] | 赋值=['F',[{'点了'},1]] | 范围=[[31,601,569,781]] | 图片=['困难难度',90] | 开关={'镜本困难'}}
{延时 | 1700 | 开关={'点了'}}
{赋值 | [[{'点了'},0]]}
{跳出 | 'TF'}
)
[中途楼层判断]=(
{点击 | [1521,40,50] | 延时=1000}
{赋值 | [[{'中途楼层判断'},0]]}
{赋值 | [[{'楼层判断-节点'},1],[{'楼层判断-识图'},0]] | 开关={'节点判断楼层'}}
{找图 | 退出界面 | 跳出='F' | 范围=[[916,448,1058,565]] | 图片=['退出界面',85]}
{计算 | [[{'四级饰品合成'},'+',{'不合成公式四级'},{'合成用变量'}]]}
{判断 | [[{'合成用变量'},'等于',2],{赋值=['T',[{'没合成完'},1]]}]}
{找图 | 第一层 | 赋值=['T',[{'节点数'},6]] | 范围=[[545,299,646,388]] | 图片=['进行度1',70]}
{找图 | 第二层 | 赋值=['T',[{'节点数'},12]] | 范围=[[643,295,750,396]] | 图片=['进行度2',70]}
{找图 | 第三层 | 赋值=['T',[{'节点数'},18]] | 范围=[[755,301,846,388]] | 图片=['进行度3',70]}
{找图 | 第四层 | 赋值=['T',[{'节点数'},24]] | 范围=[[846,286,958,394]] | 图片=['进行度4',70]}
//{找图|第五层|赋值=['T',[{'节点数'},30]]|范围=[[959,301,1062,397]]|图片=['进行度2',80]}

{找图 | 进行度 | 组=['T中途楼层判断2'] | 范围=[[545,299,1062,397]] | 图片=['进行度',80]}
{组 | '楼层卡包选择-节点'}
{空参 | 退出}
{点击 | [1441,113,50] | 延时=500}
{跳出 | 'TF'}
)
[中途楼层判断2]=(
{判断 | [[{'节点数'},'等于',0],{赋值=['T',[{'楼层检测变量1'},614],[{'楼层检测变量2'},661]]}]}
{判断 | [[{'节点数'},'等于',6],{赋值=['T',[{'楼层检测变量1'},690],[{'楼层检测变量2'},740]]}]}
{判断 | [[{'节点数'},'等于',12],{赋值=['T',[{'楼层检测变量1'},780],[{'楼层检测变量2'},820]]}]}
{判断 | [[{'节点数'},'等于',18],{赋值=['T',[{'楼层检测变量1'},860],[{'楼层检测变量2'},910]]}]}
{判断 | [[{'节点数'},'等于',24],{赋值=['T',[{'楼层检测变量1'},940],[{'楼层检测变量2'},990]]}]}

{找图 | 节点数：0 | 跳出='T' | 范围=[[{'楼层检测变量1'},420,{'楼层检测变量2'},450]] | 图片=['节点数：0',85]}
{找图 | 节点数：1 | 计算=['T',[{'节点数'},'+',1,{'节点数'}]] | 跳出='T' | 范围=[[{'楼层检测变量1'},420,{'楼层检测变量2'},450]] | 图片=['节点数：1',85]}
{找图 | 节点数：2 | 计算=['T',[{'节点数'},'+',2,{'节点数'}]] | 跳出='T' | 范围=[[{'楼层检测变量1'},420,{'楼层检测变量2'},450]] | 图片=['节点数：2',85]}
{找图 | 节点数：3 | 计算=['T',[{'节点数'},'+',3,{'节点数'}]] | 跳出='T' | 范围=[[{'楼层检测变量1'},420,{'楼层检测变量2'},450]] | 图片=['节点数：3',85]}
{找图 | 节点数：4 | 计算=['T',[{'节点数'},'+',4,{'节点数'}]] | 跳出='T' | 范围=[[{'楼层检测变量1'},420,{'楼层检测变量2'},450]] | 图片=['节点数：4',85]}
{找图 | 节点数：5 | 计算=['T',[{'节点数'},'+',5,{'节点数'}]] | 跳出='T' | 范围=[[{'楼层检测变量1'},420,{'楼层检测变量2'},450]] | 图片=['节点数：5',85]}
{跳出 | 'TF'}
)
[楼层卡包选择]=(
{移动 | [600,10,200,2] | 延时=200}
{找图 | 中文选包 | 赋值=['T',[{'中文选包'},1],[{'日文选包'},0]] | 范围=[[1272,16,1408,99]] | 图片=['中文选包',85]}
{赋值 | [[{'卡包刷新'},0]]}
{赋值 | [[{'第一层'},0]]}
{赋值 | [[{'第二层'},0]]}
{赋值 | [[{'第三层'},0]]}
{赋值 | [[{'第四层'},0]]}
{赋值 | [[{'第五层'},0]]}
//{找图|楼层星光加成|跳至=['T','楼层卡包选择','喵']|赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]]|延时=1000|范围=[[229,559,1602,681]]|图片=['楼层星光加成',85]|开关={'队伍轮换'}}

{移动 | [600,10,200,2] | 延时=200}
{组 | '楼层卡包选择-节点' | 开关={'楼层判断-节点'}}
{组 | '楼层卡包选择-识图' | 开关={'楼层判断-识图'}}

{空参 | 喵喵}
{判断 | [[{'难度自动切换'},'等于',1],{组=['T难度切换']}] | 开关={'第一层'}}
{延时 | 1700}
{组 | '楼层卡包主题选择'}
{空参 | 喵}
{计算 | [[{'坐标Y1'},'+',250,{'坐标Y2'}]]}
{滑动 | [{'坐标X1'},{'坐标Y1'},{'坐标X1'},{'坐标Y2'}]}
{赋值 | [[{'坐标X1'},0],[{'坐标Y1'},0],[{'坐标Y2'},0]]}
{赋值 | [[{'卡包刷新次数'},0]]}
{赋值 | [[{'选择了楼层卡包'},1]]}
{赋值 | [[{'选择了楼层卡包'},0]] | 开关={'第一层'}}
{延时 | 1000}
{找图 | 服务器加载 | 循环=['T',999,100] | 范围=[[1250,22,1575,158]] | 图片=['加载中',85]}
{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{延时 | 1000}
//防止遮挡
{移动 | [1363,732,200,2]}
{跳转 | '镜本'}
)
[楼层卡包选择-识图]=(
{找图 | 第一层 | 赋值=['T',[{'层数'},0],[{'节点数'},0]] | 跳至=['T','楼层卡包选择-识图','判断'] | 范围=[[556,85,791,207]] | 图片=['第一层','第一层H',85]}
{找图 | 第二层 | 赋值=['T',[{'层数'},1],[{'节点数'},6]] | 跳至=['T','楼层卡包选择-识图','判断'] | 范围=[[556,85,791,207]] | 图片=['第二层','第二层H',85]}
{找图 | 第三层 | 赋值=['T',[{'层数'},2],[{'节点数'},12]] | 跳至=['T','楼层卡包选择-识图','判断'] | 范围=[[556,85,791,207]] | 图片=['第三层','第三层H',85]}
{找图 | 第四层 | 赋值=['T',[{'层数'},3],[{'节点数'},18]] | 跳至=['T','楼层卡包选择-识图','判断'] | 范围=[[556,85,791,207]] | 图片=['第四层','第四层H',85]}
{找图 | 第五层 | 赋值=['T',[{'层数'},4],[{'节点数'},24]] | 跳至=['T','楼层卡包选择-识图','判断'] | 范围=[[556,85,791,207]] | 图片=['第五层','第五层H',85]}
//计算
{计算 | [[{'节点数'},'/',6,{'层数'}]]}
{空参 | 判断}
{判断 | [[{'层数'},'等于',0],{赋值=['T',[{'第一层'},1]]}]}
{判断 | [[{'层数'},'等于',1],{赋值=['T',[{'第二层'},1]]}]}
{判断 | [[{'层数'},'等于',2],{赋值=['T',[{'第三层'},1]]}]}
{判断 | [[{'层数'},'等于',3],{赋值=['T',[{'第四层'},1]]}]}
{判断 | [[{'层数'},'等于',4],{赋值=['T',[{'第五层'},1]]}]}
{跳至 | ['楼层卡包选择','喵喵']}
)
[楼层卡包选择-节点]=(
{判断 | [[{'节点数'},'小于等于',4],{赋值=['T',[{'第一层'},1]]}]}
{判断 | [[{'节点数'},'小于等于',4],{赋值=['T',[{'节点数'},0]]}]}
{判断 | [[{'节点数'},'小于等于',4],{跳出='T'}]}

{判断 | [[{'节点数'},'小于等于',10],{赋值=['T',[{'第二层'},1]]}]}
{判断 | [[{'节点数'},'小于等于',10],{赋值=['T',[{'节点数'},6]]}]}
{判断 | [[{'节点数'},'小于等于',10],{跳出='T'}]}

{判断 | [[{'节点数'},'小于等于',16],{赋值=['T',[{'第三层'},1]]}]}
{判断 | [[{'节点数'},'小于等于',16],{赋值=['T',[{'节点数'},12]]}]}
{判断 | [[{'节点数'},'小于等于',16],{跳出='T'}]}

{判断 | [[{'节点数'},'小于等于',22],{赋值=['T',[{'第四层'},1]]}]}
{判断 | [[{'节点数'},'小于等于',22],{赋值=['T',[{'节点数'},18]]}]}
{判断 | [[{'节点数'},'小于等于',22],{跳出='T'}]}

{判断 | [[{'节点数'},'小于等于',28],{赋值=['T',[{'第五层'},1]]}]}
{判断 | [[{'节点数'},'小于等于',28],{赋值=['T',[{'节点数'},24]]}]}
{判断 | [[{'节点数'},'小于等于',8],{跳出='T'}]}
{判断 | [[{'节点数'},'大于',30],{组=['T楼层卡包选择-识图']}]}
{跳出 | 'TF'}
)
[楼层卡包主题选择]=(
//......
//{找图|卡包动画|循环=['F',10,100]|范围=[[1034,541,1290,678]]|图片=['卡包动画结束',85]}
//{延时|500}
{赋值 | [[{'找到了卡包'},0]]}
//{组|{'变量_礼物1_优先级'}}
//{组|{'变量_礼物2_优先级'}}

{空参 | 喵喵}
//测试用
//{按键|['F12',50]|开关={'第三层'}}
//{按键|['F12',50]|开关={'第四层'}}
//{按键|['F12',50]|开关={'第五层'}}

{按键 | ['F12',50] | 开关={'卡包截图'}}
{组 | '卡包-活动'}
{组 | '卡包-困难' | 开关={'镜本困难'}}
{组 | '日文选包' | 开关={'日文选包'}}
{组 | '中文选包' | 开关={'中文选包'}}
{空参 | 刷新}
{点击 | [1347,52,50] | 延时=150}
{找图 | 服务器加载 | 循环=['T',999,100] | 范围=[[1250,22,1575,158]] | 图片=['加载中',85]}
{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{延时 | 3300}
{计算 | [[{'卡包刷新次数'},'+',1,{'卡包刷新次数'}]]}
{判断 | [[{'卡包刷新次数'},'小于',3],{跳至=['T','楼层卡包主题选择','喵喵']}] | 开关={'星之恩惠3'}}
{赋值 | [[{'卡包刷新'},1]]}
{赋值 | [[{'卡包刷新次数'},0]]}
//测试用
//{按键|['F12',50]|开关={'第三层'}}
//{按键|['F12',50]|开关={'第四层'}}
//{按键|['F12',50]|开关={'第五层'}}

{按键 | ['F12',50] | 开关={'卡包截图'}}
{组 | '卡包-困难' | 开关={'镜本困难'}}
{组 | '卡包-活动'}
{组 | '日文选包' | 开关={'日文选包'}}
{组 | '中文选包' | 开关={'中文选包'}}
{空参 | 喵}
//都没找到的最终方案
{赋值 | [[{'坐标X1'},730],[{'坐标Y1'},520],[{'坐标Y2'},720]]}
{跳至 | ['楼层卡包选择','喵']}
)
[日文选包]=(
{组 | '卡包-第一层' | 开关={'第一层'}}
{组 | '卡包-第二层' | 开关={'第二层'}}
{组 | '卡包-第三层' | 开关={'第三层'}}
{组 | '卡包-第四层' | 开关={'第四层'}}
{组 | '卡包-第五层' | 开关={'第五层'}}
{跳出 | 'TF'}
)
[中文选包]=(
{组 | '卡包-中字-第一层' | 开关={'第一层'}}
{组 | '卡包-中字-第二层' | 开关={'第二层'}}
{组 | '卡包-中字-第三层' | 开关={'第三层'}}
{组 | '卡包-中字-第四层' | 开关={'第四层'}}
{组 | '卡包-中字-第五层' | 开关={'第五层'}}
{跳出 | 'TF'}
)

[卡包-困难]=(
{跳至 | ['卡包-困难','第一层'] | 开关={'第一层'}}
{跳至 | ['卡包-困难','第二层'] | 开关={'第二层'}}
{跳至 | ['卡包-困难','第三层'] | 开关={'第三层'}}
{跳至 | ['卡包-困难','第四层'] | 开关={'第四层'}}
{跳至 | ['卡包-困难','第五层'] | 开关={'第五层'}}
{空参 | 第一层}
{找图 | 1 | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-被遗忘者们','楼层卡包-身无分文的赌徒','楼层卡包-钉与锤',80]}
{找图 | 1. | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-当斩之物',80]}
{找图 | 2 | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-无归属者','楼层卡包-巢,工坊,技术','楼层卡包-信仰与侵蚀','楼层卡包-湖的世界','楼层卡包-当碎之物',80] | 开关={'卡包刷新'}}
{找图 | 2. | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-当贯之物','楼层卡包-宅邸的副产物','楼层卡包-自动工厂','楼层卡包-无慈悲者',80] | 开关={'卡包刷新'}}
{跳至 | ['楼层卡包主题选择','喵'] | 开关={'卡包刷新'}}
{跳至 | ['楼层卡包主题选择','刷新']}

{空参 | 第二层}
{找图 | 1 | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-地狱鸡',80]}
{找图 | 2 | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-因情感困惑者','楼层卡包-当斩之物','楼层卡包-向情感屈从者','楼层卡包-对情感饥渴者',80] | 开关={'卡包刷新'}}
{找图 | 2. | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-被情感评判者','楼层卡包-当碎之物','楼层卡包-待情感懒惰者','楼层卡包-去·海·边','楼层卡包-受情感压迫者',80] | 开关={'卡包刷新'}}
{找图 | 3 | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-当贯之物','楼层卡包-自动工厂','楼层卡包-无慈悲者','楼层卡包-于情感沉溺者','楼层卡包-落花',80] | 开关={'卡包刷新'}}
{判断 | [[{'卡包刷新'},'等于',1],{组=['T重新开始这一把']}] | 开关={'二层无鸡重开'}}
{跳至 | ['楼层卡包主题选择','喵'] | 开关={'卡包刷新'}}
{跳至 | ['楼层卡包主题选择','刷新']}

{空参 | 第三层}
{找图 | 1 | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-缭乱的波动','楼层卡包-沉迷的色欲','楼层卡包-堕落的忧郁','楼层卡包-渗出的赤血',80]}
{找图 | 1. | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-吞噬的暴食','楼层卡包-破坏性外力','楼层卡包-无作为者','楼层卡包-某个世界',80]}
{找图 | 2 | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-动力渐盈','楼层卡包-寒微的嫉妒','楼层卡包-落泪者们','楼层卡包-由子弹画下的句点',80] | 开关={'卡包刷新'}}
{找图 | 2. | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-燃烧的摇曳','楼层卡包-虚张声势的傲慢','楼层卡包-肉斩骨断','楼层卡包-紫罗兰的正午',80] | 开关={'卡包刷新'}}
{找图 | 2.. | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-空转的怠惰','楼层卡包-伏行的深渊','楼层卡包-压抑的愤怒',80] | 开关={'卡包刷新'}}
{跳至 | ['楼层卡包主题选择','喵'] | 开关={'卡包刷新'}}
{跳至 | ['楼层卡包主题选择','刷新']}

{空参 | 第四层}
{找图 | 1 | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-沉迷的色欲','楼层卡包-堕落的忧郁','楼层卡包-异常地震带',80]}
{找图 | 1. | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-吞噬的暴食','楼层卡包-某个世界','楼层卡包-穿刺者们',80]}
{找图 | 2 | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-寒微的嫉妒','楼层卡包-电闪雷鸣','楼层卡包-20区的奇迹-复刻','楼层卡包-粉碎者们',80] | 开关={'卡包刷新'}}
{找图 | 2. | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-落泪者们','楼层卡包-虚张声势的傲慢','楼层卡包-斩切者们',80] | 开关={'卡包刷新'}}
{找图 | 2.. | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-尸山血海','楼层卡包-WARP快车谋杀案','楼层卡包-时间杀人时间','楼层卡包-压抑的愤怒','楼层卡包-肉斩骨断',80] | 开关={'卡包刷新'}}
{找图 | 3 | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-肉斩骨断-复刻','楼层卡包-空转的怠惰','楼层卡包-定义为恶','楼层卡包-盛火时节',80] | 开关={'卡包刷新'}}
{找图 | 3. | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-1号线','楼层卡包-2号线','楼层卡包-无改变者','楼层卡包-破竹之势',80] | 开关={'卡包刷新'}}
{找图 | 3.. | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-伏行的深渊','楼层卡包-沉沦泛滥','楼层卡包-循环呼吸',80] | 开关={'卡包刷新'}}

{跳至 | ['楼层卡包主题选择','喵'] | 开关={'卡包刷新'}}
{跳至 | ['楼层卡包主题选择','刷新']}

{空参 | 第五层}
{找图 | 深夜清扫 | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-深夜清扫',80] | 开关={'深夜清扫'}}
{找图 | 1 | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-异常地震带','楼层卡包-电闪雷鸣','楼层卡包-20区的奇迹-复刻',80]}
{找图 | 1. | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-心意相悖','楼层卡包-沉溺的忧郁','楼层卡包-凄惨的嫉妒',80]}
{找图 | 破裂 | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-时间杀人时间','楼层卡包-捆缚的色欲','楼层卡包-尸山血海','楼层卡包-WARP快车谋杀案','楼层卡包-重新开园的拉曼却领',80] | 开关={'破裂'}}
{找图 | 2 | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-时间杀人时间','楼层卡包-漫溢的暴食','楼层卡包-3号线','楼层卡包-WARP快车谋杀案','楼层卡包-尸山血海',80] | 开关={'卡包刷新'}}
{找图 | 2. | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-重新开园的拉曼却领','楼层卡包-无尽的队列','楼层卡包-定义为恶','楼层卡包-无改变者','楼层卡包-肉斩骨断-复刻','楼层卡包-4号线-第3区段',80] | 开关={'卡包刷新'}}
{找图 | 3 | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-捆缚的色欲','楼层卡包-自以为是的傲慢','楼层卡包-4号线-第4区段','楼层卡包-LCB定期体检','楼层卡包-破竹之势',80] | 开关={'卡包刷新'}}
{找图 | 3. | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-沉沦泛滥','楼层卡包-循环呼吸','楼层卡包-解放的暴怒','楼层卡包-盛火时节','楼层卡包-停滞的怠惰',80] | 开关={'卡包刷新'}}
{跳至 | ['楼层卡包主题选择','喵'] | 开关={'卡包刷新'}}
{跳至 | ['楼层卡包主题选择','刷新']}
)
[卡包-活动]=(
//{找图|深夜清扫|赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]]|跳至=['T','楼层卡包选择','喵']|范围=[[142,508,1479,619]]|图片=['楼层卡包-深夜清扫',75]|开关={'深夜清扫'}}
//{找图|骨断复刻|赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]]|跳至=['T','楼层卡包选择','喵']|范围=[[142,508,1479,619]]|图片=['楼层卡包-肉斩骨断-复刻',80]|开关={'肉斩骨断'}}
//{找图|体检|赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]]|跳至=['T','楼层卡包选择','喵']|范围=[[142,508,1479,619]]|图片=['楼层卡包-LCB定期体检',80]|开关={'LCB定期体检'}}
)
[卡包-第一层]=(
{找图 | 1 | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-被遗忘者们','楼层卡包-身无分文的赌徒','楼层卡包-钉与锤','楼层卡包-无归属者',80]}
{找图 | 2 | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-巢,工坊,技术','楼层卡包-信仰与侵蚀','楼层卡包-无慈悲者',80] | 开关={'卡包刷新'}}
)

[卡包-第二层]=(
{找图 | 1 | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-地狱鸡',75]}
{找图 | 2 | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-身无分文的赌徒','楼层卡包-巢,工坊,技术','楼层卡包-湖的世界','楼层卡包-信仰与侵蚀','楼层卡包-当斩之物',80] | 开关={'卡包刷新'}}
{找图 | 3 | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-去·海·边','楼层卡包-当碎之物','楼层卡包-当贯之物','楼层卡包-自动工厂','楼层卡包-无慈悲者',80] | 开关={'卡包刷新'}}
)
[卡包-第三层]=(
{找图 | 1 | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-因情感困惑者','楼层卡包-当斩之物','楼层卡包-被情感评判者','楼层卡包-对情感饥渴者',80]}
{找图 | 1. | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-无作为者','楼层卡包-向情感屈从者','楼层卡包-待情感懒惰者','楼层卡包-当碎之物',80]}
{找图 | 2 | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-宅邸的副产物','楼层卡包-当贯之物','楼层卡包-于情感沉溺者','楼层卡包-受情感压迫者','楼层卡包-落花',80] | 开关={'卡包刷新'}}
)
[卡包-第四层]=(
{找图 | 1 | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-沉迷的色欲','楼层卡包-吞噬的暴食','楼层卡包-堕落的忧郁','楼层卡包-某个世界','楼层卡包-由子弹画下的句点',80]}
{找图 | 2 | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-寒微的嫉妒','楼层卡包-落泪者们','楼层卡包-时间杀人时间','楼层卡包-WARP快车谋杀案',80] | 开关={'卡包刷新'}}
{找图 | 2. | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-虚张声势的傲慢','楼层卡包-肉斩骨断','楼层卡包-20区的奇迹',80] | 开关={'卡包刷新'}}
{找图 | 3 | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-紫罗兰的正午','楼层卡包-压抑的愤怒','楼层卡包-空转的怠惰','楼层卡包-伏行的深渊',80] | 开关={'卡包刷新'}}
)
[卡包-第五层]=(
{找图 | 1 | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-沉迷的色欲','楼层卡包-堕落的忧郁','楼层卡包-吞噬的暴食','楼层卡包-某个世界','楼层卡包-穿刺者们','楼层卡包-粉碎者们',80]}
{找图 | 2 | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-寒微的嫉妒','楼层卡包-落泪者们','楼层卡包-时间杀人时间','楼层卡包-WARP快车谋杀案',80] | 开关={'卡包刷新'}}
{找图 | 2. | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-LCB定期体检','楼层卡包-虚张声势的傲慢','楼层卡包-肉斩骨断',80] | 开关={'卡包刷新'}}
{找图 | 3 | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-斩切者们','楼层卡包-伏行的深渊','楼层卡包-空转的怠惰','楼层卡包-压抑的愤怒',80] | 开关={'卡包刷新'}}
)
[卡包-中字-第一层]=(
{找图 | 1 | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-中字-被遗忘者们','楼层卡包-中字-身无分文的赌徒','楼层卡包-中字-钉与锤','楼层卡包-中字-无归属者',70]}
{找图 | 2 | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-中字-巢,工坊,技术','楼层卡包-中字-信仰与侵蚀','楼层卡包-中字-无慈悲者',70] | 开关={'卡包刷新'}}
)
[卡包-中字-第二层]=(
{找图 | 1 | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-中字-地狱鸡',75]}
{找图 | 2 | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-中字-身无分文的赌徒','楼层卡包-中字-巢,工坊,技术','楼层卡包-中字-湖的世界','楼层卡包-中字-信仰与侵蚀','楼层卡包-中字-当斩之物',70] | 开关={'卡包刷新'}}
{找图 | 3 | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-中字-去·海·边','楼层卡包-中字-当碎之物','楼层卡包-中字-当贯之物','楼层卡包-中字-自动工厂','楼层卡包-中字-无慈悲者',70] | 开关={'卡包刷新'}}
)
[卡包-中字-第三层]=(
{找图 | 1 | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-中字-因情感困惑者','楼层卡包-中字-当斩之物','楼层卡包-中字-被情感评判者','楼层卡包-中字-对情感饥渴者',70]}
{找图 | 1. | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-中字-无作为者','楼层卡包-中字-向情感屈从者','楼层卡包-中字-待情感懒惰者','楼层卡包-中字-当碎之物',70]}
{找图 | 2 | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-中字-宅邸的副产物','楼层卡包-中字-当贯之物','楼层卡包-中字-于情感沉溺者','楼层卡包-中字-受情感压迫者','楼层卡包-中字-落花',70] | 开关={'卡包刷新'}}
)
[卡包-中字-第四层]=(
{找图 | 1 | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-中字-堕落的忧郁',60]}
{找图 | 1 | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-中字-沉迷的色欲','楼层卡包-中字-吞噬的暴食',60]}
{找图 | 1 | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-中字-某个世界','楼层卡包-中字-由子弹画下的句点',60]}
{找图 | 2 | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-中字-虚张声势的傲慢','楼层卡包-中字-肉斩骨断','楼层卡包-中字-20区的奇迹',65] | 开关={'卡包刷新'}}
{找图 | 2. | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-中字-寒微的嫉妒','楼层卡包-中字-落泪者们','楼层卡包-中字-时间杀人时间','楼层卡包-中字-WARP快车谋杀案',65] | 开关={'卡包刷新'}}
{找图 | 3 | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-中字-紫罗兰的正午','楼层卡包-中字-压抑的愤怒','楼层卡包-中字-空转的怠惰','楼层卡包-中字-伏行的深渊',65] | 开关={'卡包刷新'}}
)
[卡包-中字-第五层]=(
{找图 | 1 | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-中字-堕落的忧郁',60]}
{找图 | 1 | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-中字-沉迷的色欲','楼层卡包-中字-吞噬的暴食',60]}
{找图 | 1. | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-中字-某个世界','楼层卡包-中字-穿刺者们','楼层卡包-中字-粉碎者们',70]}
{找图 | 2 | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-中字-寒微的嫉妒','楼层卡包-中字-落泪者们','楼层卡包-中字-时间杀人时间','楼层卡包-中字-WARP快车谋杀案',70] | 开关={'卡包刷新'}}
{找图 | 2. | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-中字-LCB定期体检','楼层卡包-中字-虚张声势的傲慢','楼层卡包-中字-肉斩骨断',70] | 开关={'卡包刷新'}}
{找图 | 3 | 赋值=['T',[{'坐标X1'},{'x'}],[{'坐标Y1'},{'y'}]] | 跳至=['T','楼层卡包选择','喵'] | 范围=[[142,508,1479,619]] | 图片=['楼层卡包-中字-斩切者们','楼层卡包-中字-伏行的深渊','楼层卡包-中字-空转的怠惰','楼层卡包-中字-压抑的愤怒',70] | 开关={'卡包刷新'}}
)
[▰▰▰▰▰▰[日常部分]▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰]=(
{跳出 | 'TF'}
)
[每日任务]=(
{计算 | [[{'经验本开关'},'+',{'纽本开关'},{'任务用变量'}]]}
{找图 | 返回主界面 | 点击=['T',0,0,50] | 延时=500 | 范围=[[61,17,178,99]] | 图片=['退回','退回2','退回3',85]}
{判断 | [[{'任务用变量'},'大于',1],{组=['T主界面']}]}
{重置计次 | '确认次数'}
//通行证任务
{空参 | 通行证}
{找图 | 副本回主菜单 | 点击=['T',830,808,50] | 延时=500 | 范围=[[770,754,1550,874]] | 图片=['主页1','主页2','主页3','主页4','主页-无字1','主页-无字2',65]}
{找图 | 去通行证界面 | 跳转=['T通行证界面'] | 延时=500 | 范围=[[985,745,1209,878]] | 图片=['主页2','主页4','主页-无字1','主页-无字2',65]}
{空参 | 确认次数 | 延时=200 | 计次=['T','确认次数',30,{组=['T次数过多问题检查']}]}
)
[通行证界面]=(
{点击 | [1300,300,40] | 延时=500}
{找图 | 领日常奖励 | 跳转=['T日常领取'] | 延时=500 | 范围=[[406,50,554,92]] | 图片=['领日常奖励','领日常奖励2',85]}
{找图 | 副本回主菜单 | 组=['T每日任务'] | 延时=500 | 范围=[[770,754,1550,874]] | 图片=['主页1','主页2','主页3','主页4','主页-无字1','主页-无字2',65]}
{找图 | 副本回主菜单 | 点击=['T',830,808,50] | 延时=500 | 范围=[[770,754,1550,874]] | 图片=['主页1','主页2','主页3','主页4','主页-无字1','主页-无字2',65]}
{空参 | 确认次数 | 延时=200 | 计次=['T','确认次数',30,{组=['T次数过多问题检查']}]}
)
[日常领取]=(
{找图 | 领日常奖励 | 点击=['T',0,0,50] | 延时=500 | 范围=[[406,50,554,92]] | 图片=['领日常奖励','领日常奖励2',85]}
{找图 | 领周常奖励 | 点击=['T',342,505,50] | 跳至=['T','每周领取','周常奖励'] | 延时=500 | 范围=[[406,50,554,92]] | 图片=['领日常奖励','领日常奖励2',85] | 开关={'周常奖励1'}}
{找图 | 领取奖励1 | 点击=['F',600,280,50,'2L'] | 延时=200 | 范围=[[730,240,860,330]] | 图片=['领取奖励',90]}
{找图 | 领取奖励2 | 点击=['F',600,390,50,'2L'] | 延时=200 | 范围=[[730,350,859,440]] | 图片=['领取奖励',90]}
{找图 | 领取奖励3 | 点击=['F',600,500,50,'2L'] | 延时=200 | 范围=[[730,460,859,550]] | 图片=['领取奖励',90]}
{找图 | 领取奖励4 | 点击=['F',600,610,50,'2L'] | 延时=200 | 范围=[[730,570,859,660]] | 图片=['领取奖励',90]}
{找图 | 领取奖励5 | 点击=['F',600,720,50,'2L'] | 延时=200 | 范围=[[730,680,859,770]] | 图片=['领取奖励',90]}
{找图 | 服务器加载 | 循环=['T',999,100] | 范围=[[1250,22,1575,158]] | 图片=['加载中',85]}
{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{找图 | 全部完成 | 赋值=['T',[{'每日任务开关'},0]] | 延时=500 | 范围=[[728,240,868,770]] | 图片=['全部完成',85]}
{找图 | 周常奖励检查 | 赋值=['T',[{'周常奖励'},1]] | 范围=[[289,399,401,464]] | 图片=['感叹号',85]}
{找图 | 全部完成 | 点击=[120,70,50] | 延时=500 | 范围=[[728,240,868,770]] | 图片=['全部完成',85]}
{找图 | 跳至首页 | 跳转=['T主界面'] | 延时=500 | 范围=[[985,745,1209,878]] | 图片=['主页1','主页2','主页3','主页4','主页-无字1','主页-无字2',75]}
{空参 | 确认次数 | 延时=200 | 计次=['T','确认次数',5,{组=['T次数过多问题检查'] | 赋值=['T',[{'每日任务开关'},0]]}]}
{跳转 | '日常领取'}
)
[每周领取]=(
{赋值 | [[{'周常奖励1'},1]]}
{跳至 | ['每日任务','通行证']}
{空参 | 周常奖励}
{找图 | 领周常奖励 | 点击=['T',0,0,50] | 偏移=[-30,30] | 延时=300 | 范围=[[763,225,906,781]] | 图片=['感叹号',85]}
{找图 | 领周常奖励 | 点击=['F',120,70,50] | 延时=300 | 范围=[[763,225,906,781]] | 图片=['感叹号',85]}
{找图 | 跳至首页 | 赋值=['T',[{'周常奖励'},0],[{'周常奖励1'},0]] | 跳转=['T主界面'] | 延时=500 | 范围=[[985,745,1209,878]] | 图片=['主页1','主页2','主页3','主页4','主页-无字1','主页-无字2',75]}
{空参 | 确认次数 | 延时=200 | 计次=['T','确认次数',5,{组=['T次数过多问题检查'] | 赋值=['T',[{'每日任务开关'},0]]}]}
{跳至 | ['每周领取','周常奖励']}
)
[一折抽卡]=(
{找图 | 镜像地牢主页 | 点击=['T',1346,798,50] | 跳出='F' | 延时=2000 | 范围=[[973,734,1216,863],[1416,752,1536,849]] | 图片=['主页1','主页2','主页3','主页4','主页-无字1','主页-无字2',65]}
{找图 | 服务器加载 | 循环=['F',99,100] | 范围=[[684,477,936,573]] | 图片=['每日一折抽卡','每日一折抽卡2',85]}
{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{找图 | 每日一折抽卡 | 点击=['T',0,0,50] | 偏移=[0,20] | 延时=1000 | 范围=[[684,477,936,573]] | 图片=['每日一折抽卡','每日一折抽卡2',85]}
{找图 | 抽出进行 | 组=['T抽卡中'] | 延时=200 | 范围=[[662,86,925,194]] | 图片=['抽出进行','抽出进行2',85]}
{延时 | 1000}
{点击 | [237,346,50] | 延时=1500}
{找图 | 每日一折抽卡 | 点击=['T',0,0,50] | 偏移=[0,20] | 延时=1000 | 范围=[[684,477,936,573]] | 图片=['每日一折抽卡','每日一折抽卡2',85]}
{找图 | 抽出进行 | 组=['T抽卡中'] | 延时=200 | 范围=[[662,86,925,194]] | 图片=['抽出进行','抽出进行2',85]}
{赋值 | [[{'一折抽卡'},0]]}
{跳出 | 'TF'}
)
[抽卡中]=(
{按键 | ['enter',50]}
{延时 | 1000}
{找图 | 退出抽卡 | 点击=['T',0,0,50] | 跳出='T' | 延时=100 | 范围=[[663,718,933,860]] | 图片=['退出抽卡','退出抽卡2',85]}
{组 | '抽卡中'}
)
[邮箱]=(
{找图 | 镜像地牢主页 | 点击=['T',833,809,50] | 跳出='F' | 延时=2000 | 范围=[[973,734,1216,863],[1416,752,1536,849]] | 图片=['主页1','主页2','主页3','主页4','主页-无字1','主页-无字2',65]}
{找图 | 感叹号 | 点击=['T',0,0,50] | 偏移=[-20,20] | 跳出='F' | 延时=1000 | 范围=[[1295,79,1545,152]] | 图片=['感叹号',75]}
{点击 | [1209,685,50] | 延时=1000}
{按键 | ['enter',50]}
{延时 | 500}
{点击 | [968,685,50] | 延时=1000}
{赋值 | [[{'邮箱'},0]]}
{跳出 | 'TF'}
)
[体力购买]=(
//{找图|镜像地牢主页|点击=['T',833,809,50]|跳出='F'|延时=2000|范围=[[973,734,1216,863],[1416,752,1536,849]]|图片=['主页1','主页2','主页3','主页4',65]}

//{找图|镜像地牢主页|跳出='F'|延时=2000|范围=[[973,734,1216,863],[1416,752,1536,849]]|图片=['主页1','主页2','主页3','主页4',65]}
{找图 | 镜像地牢主页 | 跳出='F' | 延时=200 | 范围=[[973,734,1216,863],[1416,752,1536,849]] | 图片=['主页1','主页2','主页3','主页4','主页-无字1','主页-无字2',65]}
{点击 | [493,814,50] | 延时=500}
{找图 | 体力购买 | 点击=['T',0,0,50] | 组=['T体力购买次数'] | 跳出='F' | 延时=500 | 范围=[[692,240,913,317]] | 图片=['体力购买','体力购买2',85]}
{延时 | 500}
{点击 | [663,660,50] | 延时=200}
{点击 | [663,660,50] | 延时=500}
{组 | '升级自动换门票' | 开关={'升级自动换门票'}}
{赋值 | [[{'体力购买'},0]]}
{跳出 | 'TF'}
)
[体力购买次数]=(
{判断 | [[{'体力购买次数'},'等于',0],{跳出='T'}]}
{找图 | 第一次体力购买 | 点击=['T',951,664,50] | 判断=['T',[{'体力购买次数'},'小于等于',1],{跳出='T'}] | 延时=500 | 范围=[[583,323,1056,448]] | 图片=['第一次体力购买',95]}
{找图 | 服务器加载 | 循环=['T',999,100] | 范围=[[1250,22,1575,158]] | 图片=['加载中',85]}
{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{延时 | 200}
{判断 | [[{'体力购买次数'},'小于等于',1],{跳出='T'}]}
{找图 | 第二次体力购买 | 点击=['T',951,664,50] | 判断=['T',[{'体力购买次数'},'小于等于',2],{跳出='T'}] | 延时=500 | 范围=[[583,323,1056,448]] | 图片=['第二次体力购买',95]}
{找图 | 服务器加载 | 循环=['T',999,100] | 范围=[[1250,22,1575,158]] | 图片=['加载中',85]}
{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{延时 | 200}
{判断 | [[{'体力购买次数'},'小于等于',2],{跳出='T'}]}
{找图 | 第三次体力购买 | 点击=['T',951,664,50] | 判断=['T',[{'体力购买次数'},'小于等于',3],{跳出='T'}] | 延时=500 | 范围=[[583,323,1056,448]] | 图片=['第三次体力购买',95]}
{找图 | 服务器加载 | 循环=['T',999,100] | 范围=[[1250,22,1575,158]] | 图片=['加载中',85]}
{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{延时 | 200}
{判断 | [[{'体力购买次数'},'小于等于',3],{跳出='T'}]}
{找图 | 第四次体力购买 | 点击=['T',951,664,50] | 判断=['T',[{'体力购买次数'},'小于等于',4],{跳出='T'}] | 延时=500 | 范围=[[583,323,1056,448]] | 图片=['第四次体力购买',95]}
{找图 | 服务器加载 | 循环=['T',999,100] | 范围=[[1250,22,1575,158]] | 图片=['加载中',85]}
{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{延时 | 200}
{判断 | [[{'体力购买次数'},'小于等于',4],{跳出='T'}]}
{找图 | 第五次体力购买 | 点击=['T',951,664,50] | 判断=['T',[{'体力购买次数'},'小于等于',5],{跳出='T'}] | 延时=500 | 范围=[[583,323,1056,448]] | 图片=['第五次体力购买',95]}
{找图 | 服务器加载 | 循环=['T',999,100] | 范围=[[1250,22,1575,158]] | 图片=['加载中',85]}
{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{延时 | 200}
{判断 | [[{'体力购买次数'},'小于等于',5],{跳出='T'}]}
{找图 | 第六次体力购买 | 点击=['T',951,664,50] | 判断=['T',[{'体力购买次数'},'小于等于',6],{跳出='T'}] | 延时=500 | 范围=[[583,323,1056,448]] | 图片=['第六次体力购买',95]}
{找图 | 服务器加载 | 循环=['T',999,100] | 范围=[[1250,22,1575,158]] | 图片=['加载中',85]}
{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{延时 | 200}
{判断 | [[{'体力购买次数'},'小于等于',6],{跳出='T'}]}
//{识数|第一次体力购买|判断=['等于',26]|模式=0|点击=['T',951,664,50]|判断=['T',[{'体力购买次数'},'等于',1],{跳出='T'}]|延时=1500|范围=[[725,341,804,397]]}
//{识数|第二次体力购买|判断=['等于',52]|模式=0|点击=['T',951,664,50]|判断=['T',[{'体力购买次数'},'等于',2],{跳出='T'}]|延时=1500|范围=[[725,341,804,397]]}
//{识数|第三次体力购买|判断=['等于',3]|模式=0|点击=['T',951,664,50]|判断=['T',[{'体力购买次数'},'等于',3],{跳出='T'}]|延时=1500|范围=[[725,341,804,397]]}
//{识数|第四次体力购买|判断=['等于',4]|模式=0|点击=['T',951,664,50]|判断=['T',[{'体力购买次数'},'等于',4],{跳出='T'}]|延时=1500|范围=[[725,341,804,397]]}
//{识数|第五次体力购买|判断=['等于',5]|模式=0|点击=['T',951,664,50]|判断=['T',[{'体力购买次数'},'等于',5],{跳出='T'}]|延时=1500|范围=[[725,341,804,397]]}
//{识数|第六次体力购买|判断=['等于',6]|模式=0|点击=['T',951,664,50]|判断=['T',[{'体力购买次数'},'等于',6],{跳出='T'}]|延时=1500|范围=[[725,341,804,397]]}
{跳出 | 'TF'}
)
[▰▰▰▰▰▰[准备部分]▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰]=(
{跳出 | 'TF'}
)
[镜本准备]=(
//镜像地牢
{找图 | 活动关闭 | 按键=['T','ESC',50] | 延时=300 | 范围=[[1312,146,1415,248]] | 图片=['活动关闭','活动关闭2',75]}
{找图 | 镜像地牢主页 | 跳出='F' | 范围=[[973,734,1216,863],[1416,752,1536,849]] | 图片=['主页1','主页2','主页3','主页4','主页-无字1','主页-无字2',65]}

//自动体力换门票按钮
{组 | '升级自动换门票' | 开关={'升级自动换门票'}}
//运转席
{点击 | [1096,804,50] | 延时=100}
{点击 | [1096,804,50] | 延时=500}
{找图 | 页面判断 | 循环=['F',999,100] | 范围=[[392,310,685,465]] | 图片=['镜之地牢','镜之地牢2','镜之地牢-无字',85]}
{延时 | 100}
//入场
//{点击|[447,427,50]|延时=1000}
{找图 | 镜之地牢 | 点击=['T',567,406,50] | 延时=500 | 范围=[[392,310,685,465]] | 图片=['镜之地牢','镜之地牢2','镜之地牢-无字',85]}

{找图 | 服务器加载 | 循环=['T',999,100] | 范围=[[1250,22,1575,158]] | 图片=['加载中',85]}
{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
//{找图|岚之镜1|点击=['T',242,359,50]|延时=500|范围=[[110,187,220,279],[1167,192,1262,278]]|图片=['岚之镜','岚之镜2',65]|开关={'镜本普通'}}
//{找图|岚之镜2|点击=['T',1322,384,50]|延时=500|范围=[[110,187,220,279],[1167,192,1262,278]]|图片=['岚之镜','岚之镜2',65]|开关={'镜本困难'}}
//{找图|梦之镜|点击=['T',1369,619,50]|延时=1000|范围=[[612,114,735,224]]|图片=['梦之镜',75]}
//{比色|岚之镜1|点击=['T',242,359,50]|延时=500|颜色=['175,235,#A375D1',70]|开关={'镜本普通'}}
//{比色|岚之镜2|点击=['T',1322,384,50]|延时=500|颜色=['175,235,#A375D1',70]|开关={'镜本困难'}}
//{点击|[242,359,50]|延时=500|开关={'镜本普通'}}
{找图 | 无限镜牢 | 点击=['T',1359,470,50] | 延时=10 | 范围=[[1246,376,1488,498]] | 图片=['无限镜牢',85]}
{点击 | [958,602,50] | 延时=800}
//{点击|[1322,384,50]|延时=500|开关={'镜本困难'}}
//是否重新开车
{找图 | 重新开车 | 组=['T重新开车','F开车'] | 延时=500 | 范围=[[583,445,989,659]] | 图片=['重新开车','重新开车2',85]}
{跳转 | '主界面'}
)

[升级自动换门票]=(
{找色 | 体力条 | 点击=['T',0,0,50] | 跳出='F' | 延时=1000 | 范围=[[435,823,605,859]] | 颜色=['#01EF56','5,7,#01B940',80]}
//选第一页

//选全部制作
{点击 | [1007,416,50] | 延时=500}
//确认
{点击 | [958,670,50] | 延时=400}
{找图 | 服务器加载 | 循环=['T',999,100] | 范围=[[1250,22,1575,158]] | 图片=['加载中',85]}
{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{延时 | 100}
//点击空白处
{点击 | [1380,673,50] | 延时=700}
{跳出 | 'TF'}
)

[开车]=(
//入场
{按键 | ['ENTER',50]}
{延时 | 100}
{找图 | 服务器加载 | 循环=['T',999,100] | 范围=[[1250,22,1575,158]] | 图片=['加载中',85]}
{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{延时 | 500}
{跳转 | '主界面'}
)
[星之恩惠]=(
//第十个加成卡包
{点击 | [1270,630,50] | 延时=500 | 开关={'星之恩惠10'}}
//第九个加成卡包
{点击 | [1020,630,50] | 延时=500 | 开关={'星之恩惠9'}}
//第八个加成卡包
{点击 | [800,630,50] | 延时=500 | 开关={'星之恩惠8'}}
//第七个加成卡包
{点击 | [580,630,50] | 延时=500 | 开关={'星之恩惠7'}}
//第六个加成卡包
{点击 | [350,630,50] | 延时=500 | 开关={'星之恩惠6'}}
//第五个加成卡包
{点击 | [1270,350,50] | 延时=500 | 开关={'星之恩惠5'}}
//第四个加成卡包
{点击 | [1020,350,50] | 延时=500 | 开关={'星之恩惠4'}}
//第三个加成卡包
{点击 | [800,350,50] | 延时=500 | 开关={'星之恩惠3'}}
//第二个加成卡包
{点击 | [580,350,50] | 延时=500 | 开关={'星之恩惠2'}}
//第一个加成卡包
{点击 | [350,350,50] | 延时=500 | 开关={'星之恩惠1'}}

//确定1
{点击 | [1410,854,50] | 延时=500}
//确定2
{点击 | [943,678,50] | 延时=100}
{延时 | 100}
{找图 | 服务器加载 | 循环=['T',999,100] | 范围=[[1250,22,1575,158]] | 图片=['加载中',85]}
{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{延时 | 700}
{跳转 | '首次选择EGO礼物'}
)
[重新开车]=(
//再开
{赋值 | [[{'开局重新选人2'},1]]}
{点击 | [801,494,50] | 延时=500}
{跳转 | '主界面'}
)

[小退]=(
//设置
{点击 | [1539,60,50] | 延时=500}
//小退
{点击 | [864,606,50] | 延时=500}
//确定
{点击 | [864,606,50] | 延时=500}
{赋值 | [[{'寻路遍数'},0]]}
{跳转 | '主界面'}
)

[选择特定人格]=(
{点击 | [1435,597,50] | 延时=500}
{找图 | 通用确认 | 按键=['T','enter',50] | 延时=300 | 范围=[[419,125,1568,871]] | 图片=['确认','确认-中字1','确认-中字2','确认1','确认2',65]}
{点击 | [1435,597,50] | 延时=100}
{赋值 | [[{'已选人检测'},0]]}
{赋值 | [[{'重新选人'},0]]}
{赋值 | [[{'死亡人数'},0]]}
{赋值 | [[{'开局重新选人2'},0]]}
{组 | {'变量_角色1_优先级'}}
{组 | {'变量_角色2_优先级'}}
{组 | {'变量_角色3_优先级'}}
{组 | {'变量_角色4_优先级'}}
{组 | {'变量_角色5_优先级'}}
{组 | {'变量_角色6_优先级'}}
{判断 | [[{'死亡人数'},'大于等于',4],{组=['T重新开始这一把']}] | 开关={'全灭重开'}}
//{判断|[[{'困难战斗'},'等于',0],{跳出='T'}]}
{跳出 | 'T' | 开关={'替补位'}}
{组 | {'变量_角色7_优先级'}}
{组 | {'变量_角色8_优先级'}}
{组 | {'变量_角色9_优先级'}}
{组 | {'变量_角色10_优先级'}}
{组 | {'变量_角色11_优先级'}}
{组 | {'变量_角色12_优先级'}}
{判断 | [[{'死亡人数'},'大于等于',4],{组=['T重新开始这一把']}] | 开关={'全灭重开'}}
{跳出 | 'TF'}
)

[▰▰▰▰▰▰[日常-经验本部分]▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰]=(
{跳出 | 'TF'}
)
[经验本准备]=(
//自动体力换门票按钮
{组 | '升级自动换门票' | 开关={'升级自动换门票'}}

{找图 | 经验本结算 | 组=['T经验本结算'] | 延时=200 | 范围=[[1198,95,1480,214],[510,125,1086,250]] | 图片=['战斗胜利','战斗胜利-中字','战斗败北','战斗败北-中字','探查完',85]}
{判断 | [[{'经验本次数'},'小于等于',0],{操作开关=['T',['开车准备','经验本开关',0]]}]}
{判断 | [[{'经验本次数'},'小于等于',0],{跳出='T'}]}
//运转席
{找图 | 镜像地牢主页 | 点击=['T',1087,804,50] | 跳出='F' | 延时=500 | 范围=[[973,734,1216,863],[1416,752,1536,849]] | 图片=['主页1','主页2','主页3','主页4','主页-无字1','主页-无字2',75]}
{找图 | 经验本战斗中 | 组=['T经验本战斗中'] | 延时=200 | 范围=[[1298,4,1594,160]] | 图片=['战斗中标志','战斗中标志2','战斗中标志3',85]}
{找图 | 经验本战斗选人找图 | 组=['T经验本战斗处理'] | 延时=200 | 范围=[[1342,118,1500,238]] | 图片=['战斗选人','战斗选人2','战斗选人3',70]}

{点击 | [1096,804,50] | 延时=1000}
{找图 | 页面判断 | 循环=['F',999,100] | 范围=[[392,310,685,465]] | 图片=['镜之地牢','镜之地牢2','镜之地牢-无字',85]}
{延时 | 100}
//入场
{点击 | [582,213,50] | 延时=1000}

{空参 | 喵}
{组 | '升级自动换门票' | 开关={'升级自动换门票'}}
//入经验本
{点击 | [198,331,50] | 延时=1000}
{找图 | 经验本-斩击 | 赋值=['T',[{'斩击经验'},1]] | 范围=[[1429,359,1555,493]] | 图片=['经验本-斩击',85]}
{找图 | 经验本-突刺 | 赋值=['T',[{'突刺经验'},1]] | 范围=[[1429,359,1555,493]] | 图片=['经验本-突刺',85]}
{找图 | 经验本-打击 | 赋值=['T',[{'打击经验'},1]] | 范围=[[1429,359,1555,493]] | 图片=['经验本-打击',85]}
//第?个经验本
{点击 | [1393,591,50] | 延时=1000 | 开关={'最高级'}}
{点击 | [957,597,50] | 延时=1000 | 开关={'次级'}}
{点击 | [527,594,50] | 延时=1000 | 开关={'最次级'}}
//确实5个人
{找图 | 经验本战斗选人找图 | 组=['T经验本战斗处理'] | 延时=200 | 范围=[[1342,118,1500,238]] | 图片=['战斗选人','战斗选人2','战斗选人3',70]}

//{跳出|'TF'}
)
[经验本抗性选择]=(
{找图 | 经验本 | 点击=['T',0,0,50] | 赋值=['T',[{'第一次经验本'},0]] | 跳至=['T','经验本战斗处理','喵'] | 延时=300 | 范围=[[64,440,235,717]] | 图片=['经验本','经验本2','混合采掘1','混合采掘2',85] | 开关={'经验本队伍抗性选择2'}}
{点击 | [145,510,50] | 延时=300 | 开关={'经验本队伍抗性选择2'}}
{跳出 | 'TF' | 开关={'经验本队伍抗性选择2'}}
{组 | '经验本选择固定队伍' | 开关={'经验本固定编队'}}
{点击 | [145,510,50] | 延时=300 | 开关={'经验本固定编队'}}
{跳出 | 'TF' | 开关={'经验本固定编队'}}
{空参 | 喵}
{找图 | 斩击 | 点击=['T',0,0,50] | 赋值=['T',[{'队伍X'},{'X'}],[{'队伍Y'},{'Y'}]] | 跳至=['T','经验本抗性选择','喵喵'] | 延时=300 | 范围=[[64,440,235,717]] | 图片=['队伍-斩击',85]}
{找图 | 纽 | 点击=['T',0,0,50] | 赋值=['T',[{'队伍X'},{'X'}],[{'队伍Y'},{'Y'}]] | 跳至=['T','经验本抗性选择','喵喵'] | 延时=300 | 范围=[[64,440,235,717]] | 图片=['纽本','纽本2',85]}
{空参 | 喵喵}
{点击 | ['T',{'队伍X'},{'队伍Y'},50,'L',1]}
{移动 | [145,500,7]}
{点击 | ['T',145,500,500,'L',2]}

{移动 | [40,830,200,2] | 延时=300}
{找图 | 队伍-斩击 | 点击=['T',0,0,50] | 延时=300 | 范围=[[64,440,235,717]] | 图片=['队伍-斩击',85] | 开关={'斩击经验'}}
{找图 | 队伍-突刺 | 点击=['T',0,0,50] | 延时=300 | 范围=[[64,440,235,717]] | 图片=['队伍-突刺',85] | 开关={'突刺经验'}}
{找图 | 队伍-打击 | 点击=['T',0,0,50] | 延时=300 | 范围=[[64,440,235,717]] | 图片=['队伍-打击',85] | 开关={'打击经验'}}
{赋值 | [[{'第一次经验本'},0]]}
//{延时|99999}
{跳出 | 'TF'}
)
[经验本选择固定队伍]=(
{赋值 | [[{'第一队'},0],[{'第二队'},0],[{'第三队'},0],[{'第四队'},0],[{'第五队'},0],[{'第六队'},0]]}
{组 | {'变量_经验本_队伍优先级'}}
{点击 | [145,510,50] | 延时=100 | 开关={'第一队'}}
{点击 | [145,560,50] | 延时=100 | 开关={'第二队'}}
{点击 | [145,600,50] | 延时=100 | 开关={'第三队'}}
{点击 | [145,650,50] | 延时=100 | 开关={'第四队'}}
{点击 | [145,680,50] | 延时=100 | 开关={'第五队'}}
{空参 | 跳转 | 跳至=['T','经验本战斗处理','喵']}
)
[经验本战斗处理]=(
{组 | '经验本抗性选择' | 开关={'第一次经验本'}}
{空参 | 喵}
{点击 | [1418,729,50] | 延时=500}
{赋值 | [[{'拉条变量'},1]]}
{计算 | [[{'斩击拉条回合'},'+',1,{'斩击拉条回合'}]]}
{计算 | [[{'突刺拉条回合'},'+',1,{'突刺拉条回合'}]]}
{计算 | [[{'打击拉条回合'},'+',1,{'打击拉条回合'}]]}
{判断 | [[{'斩击经验拉条'},'等于',1],{跳转=['T经验本拉条准备']}] | 开关={'斩击经验'}}
{判断 | [[{'突刺经验拉条'},'等于',1],{跳转=['T经验本拉条准备']}] | 开关={'突刺经验'}}
{判断 | [[{'打击经验拉条'},'等于',1],{跳转=['T经验本拉条准备']}] | 开关={'打击经验'}}
{找图 | 经验本战斗中 | 跳转=['T经验本战斗中'] | 延时=200 | 范围=[[1298,4,1594,160]] | 图片=['战斗中标志','战斗中标志2','战斗中标志3',85] | 开关={'经验本开关'}}
{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{跳转 | '经验本战斗处理'}
)

[经验本结算]=(
{找图 | 升级 | 点击=['T',790,674,50] | 延时=500 | 范围=[[423,333,768,561]] | 图片=['升级',85]}
{找图 | 失败 | 计算=['T',[{'经验本次数'},'+',1,{'经验本次数'}]] | 范围=[[1089,114,1553,305]] | 图片=['战斗败北','战斗败北-中字',85]}
//确认
{点击 | [1451,730,50] | 延时=1000}
{打印变量 | ['经验本次数']}
//{计算|[[{'经验本次数'},'-',1,{'经验本次数'}]]}
{找图 | 采光 | 计算=['T',[{'经验本次数'},'-',1,{'经验本次数'}]] | 按键=['F','ENTER',50] | 循环=['F',999,100] | 范围=[[42,153,310,311]] | 图片=['采光界面','采光页面2',85]}
{判断 | [[{'经验本次数'},'小于等于',0],{赋值=['T',[{'经验本开关'},0]] | 跳至=['F','经验本准备','喵'] | 操作开关=['T',['主界面','经验本开关',0]]}]}
{判断 | [[{'纽本次数'},'小于等于',0],{赋值=['T',[{'纽本开关'},0]] | 跳至=['F','纽本准备','喵']}] | 开关={'纽本开关'}}
//退出
{点击 | [129,62,50] | 延时=1000}
//退出
{点击 | [129,62,50] | 延时=1000}
//主界面
//{点击|[842,810,50]|延时=1000}

{比色 | 主页 | 跳转=['T主界面','F处理错误'] | 延时=200 | 颜色=['1542,863,#3B0000/1159,861,#3E0000/901,858,#3E0000',90]}
//{跳出|'TF'}
)
[经验本战斗中]=(
{延时 | 200 | 开关={'循环模式1'}}
{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{找图 | 经验本结算 | 组=['T经验本结算'] | 延时=500 | 范围=[[1089,114,1553,305],[42,153,310,311]] | 图片=['战斗胜利','战斗胜利-中字','战斗败北','战斗败北-中字','采光界面','采光页面2',85]}
{按键 | ['P',50] | 开关={'循环模式1'}}
{找图 | P | 按键=['T','P',50] | 范围=[[1298,4,1594,160],[3,13,111,121]] | 图片=['战斗中标志','战斗中标志2','战斗中标志3','战斗中标志4',80] | 开关={'循环模式2'}}
{按键 | ['ENTER',50] | 开关={'循环模式1'}}
{找图 | ENTER | 按键=['T','ENTER',50] | 范围=[[1298,4,1594,160],[3,13,111,121]] | 图片=['战斗中标志','战斗中标志2','战斗中标志3','战斗中标志4',80] | 开关={'循环模式2'}}
//有人会挂着经验本次数打镜牢
{找图 | 地图界面 | 赋值=['T',[{'经验本开关'},0],[{'纽本开关'},0],[{'一次日常'},0]] | 组=['T镜本'] | 范围=[[1423,11,1587,173]] | 图片=['地图界面','地图界面2','地图界面3',75]}
{跳转 | '经验本战斗中'}
)
[经验本拉条准备]=(
{空参 | 喵}
{点击 | [1418,729,50] | 延时=500}
{找图 | 经验本战斗中 | 跳转=['T道中检测A'] | 延时=200 | 范围=[[1298,4,1594,160]] | 图片=['战斗中标志','战斗中标志2','战斗中标志3',85] | 开关={'经验本开关'}}
{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{跳转 | '经验本拉条准备'}
)
[▰▰▰▰▰▰[日常-纽本部分]▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰]=(
{跳出 | 'TF'}
)
[纽本准备]=(
//自动体力换门票按钮
{组 | '升级自动换门票' | 开关={'升级自动换门票'}}

{找图 | 纽本结算 | 组=['T纽本结算'] | 延时=200 | 范围=[[1082,102,1561,297],[510,125,1086,250]] | 图片=['战斗胜利','战斗胜利-中字','战斗败北','战斗败北-中字','探查完',85]}
{找图 | 战斗问号 | 组=['T战斗问号'] | 延时=200 | 范围=[[364,40,514,155]] | 图片=['问号','问号2',85]}

{判断 | [[{'纽本次数'},'小于等于',0],{操作开关=['T',['开车准备','经验本开关',0]]}]}
{判断 | [[{'纽本次数'},'小于等于',0],{跳出='T'}]}
{找图 | 纽本战斗中 | 组=['T纽本战斗中'] | 延时=200 | 范围=[[1298,4,1594,160]] | 图片=['战斗中标志','战斗中标志2','战斗中标志3',85]}
{找图 | 纽本战斗选人找图 | 组=['T纽本战斗处理'] | 延时=200 | 范围=[[1342,118,1500,238]] | 图片=['战斗选人','战斗选人2','战斗选人3',70]}
{找图 | 镜像地牢主页 | 点击=['T',1087,804,50] | 跳出='F' | 延时=200 | 范围=[[973,734,1216,863],[1416,752,1536,849]] | 图片=['主页1','主页2','主页3','主页-无字1','主页-无字2',75]}
//运转席
{点击 | [1096,804,50] | 延时=1000}
//入场
{点击 | [582,213,50] | 延时=1000}

{空参 | 喵}
{组 | '升级自动换门票' | 开关={'升级自动换门票'}}
//入纽本
{点击 | [202,434,50] | 延时=1000}
{找图 | 纽本-嫉妒 | 赋值=['T',[{'嫉妒纽'},1]] | 范围=[[376,182,551,283]] | 图片=['纽本-嫉妒',85]}
{找图 | 纽本-傲慢 | 赋值=['T',[{'傲慢纽'},1]] | 范围=[[376,182,551,283]] | 图片=['纽本-傲慢',85]}
{找图 | 纽本-忧郁 | 赋值=['T',[{'忧郁纽'},1]] | 范围=[[376,182,551,283]] | 图片=['纽本-忧郁',85]}
{找图 | 纽本-暴食 | 赋值=['T',[{'暴食纽'},1]] | 范围=[[376,182,551,283]] | 图片=['纽本-暴食',85]}
{找图 | 纽本-怠惰 | 赋值=['T',[{'怠惰纽'},1]] | 范围=[[376,182,551,283]] | 图片=['纽本-怠惰',85]}
{找图 | 纽本-色欲 | 赋值=['T',[{'色欲纽'},1]] | 范围=[[376,182,551,283]] | 图片=['纽本-色欲',85]}
{找图 | 纽本-愤怒 | 赋值=['T',[{'愤怒纽'},1]] | 范围=[[376,182,551,283]] | 图片=['纽本-愤怒',85]}
//第个1纽本
{点击 | [477,589,50] | 延时=1000}
//进入
{点击 | [774,587,50] | 延时=1000 | 开关={'纽最高级'}}
{点击 | [774,455,50] | 延时=1000 | 开关={'纽次级'}}
{点击 | [774,324,50] | 延时=1000 | 开关={'纽最次级'}}

//确实5个人
{找图 | 纽本战斗选人找图 | 组=['T纽本战斗处理'] | 延时=200 | 范围=[[1342,118,1500,238]] | 图片=['战斗选人','战斗选人2','战斗选人3',70]}
//{跳出|'TF'}
)
[纽本抗性选择]=(
{找图 | 纽本 | 点击=['T',0,0,50] | 赋值=['T',[{'第一次纽本'},0]] | 跳至=['T','纽本战斗处理','喵'] | 延时=300 | 范围=[[64,440,235,717]] | 图片=['纽本','纽本2','混合采掘1','混合采掘2',85] | 开关={'纽本队伍抗性选择2'}}
{点击 | [145,510,50] | 延时=300 | 开关={'纽本队伍抗性选择2'}}
{跳出 | 'TF' | 开关={'纽本队伍抗性选择2'}}
{组 | '纽本选择固定队伍' | 开关={'纽本固定编队'}}
{点击 | [145,510,50] | 延时=300 | 开关={'纽本固定编队'}}
{跳出 | 'TF' | 开关={'纽本固定编队'}}
{空参 | 喵}
{找图 | 暴食 | 点击=['T',0,0,50] | 赋值=['T',[{'队伍X'},{'X'}],[{'队伍Y'},{'Y'}]] | 跳至=['T','纽本抗性选择','喵喵'] | 延时=300 | 范围=[[64,440,235,717]] | 图片=['队伍-暴食',85]}
{找图 | 愤怒 | 点击=['T',0,0,50] | 赋值=['T',[{'队伍X'},{'X'}],[{'队伍Y'},{'Y'}]] | 跳至=['T','纽本抗性选择','喵喵'] | 延时=300 | 范围=[[64,440,235,717]] | 图片=['队伍-愤怒',85]}
{找图 | 斩击 | 点击=['T',0,0,50] | 赋值=['T',[{'队伍X'},{'X'}],[{'队伍Y'},{'Y'}]] | 跳至=['T','纽本抗性选择','喵喵'] | 延时=300 | 范围=[[64,440,235,717]] | 图片=['队伍-斩击',85]}
{找图 | 纽本 | 点击=['T',0,0,50] | 赋值=['T',[{'队伍X'},{'X'}],[{'队伍Y'},{'Y'}]] | 跳至=['T','纽本抗性选择','喵喵'] | 延时=300 | 范围=[[64,440,235,717]] | 图片=['纽本','纽本2',85]}
{空参 | 喵喵}
{点击 | ['T',{'队伍X'},{'队伍Y'},50,'L',1]}
{移动 | [145,500,7]}
{点击 | ['T',145,500,500,'L',2]}
{移动 | [40,830,200,2] | 延时=400}
{找图 | 队伍-嫉妒 | 点击=['T',0,0,50] | 赋值=['T',[{'第一次纽本'},0]] | 跳至=['T','纽本战斗处理','喵'] | 延时=300 | 范围=[[64,440,235,717]] | 图片=['队伍-嫉妒',85] | 开关={'嫉妒纽'}}
{找图 | 队伍-傲慢 | 点击=['T',0,0,50] | 赋值=['T',[{'第一次纽本'},0]] | 跳至=['T','纽本战斗处理','喵'] | 延时=300 | 范围=[[64,440,235,717]] | 图片=['队伍-傲慢',85] | 开关={'傲慢纽'}}
{找图 | 队伍-忧郁 | 点击=['T',0,0,50] | 赋值=['T',[{'第一次纽本'},0]] | 跳至=['T','纽本战斗处理','喵'] | 延时=300 | 范围=[[64,440,235,717]] | 图片=['队伍-忧郁',80] | 开关={'忧郁纽'}}
{找图 | 队伍-暴食 | 点击=['T',0,0,50] | 赋值=['T',[{'第一次纽本'},0]] | 跳至=['T','纽本战斗处理','喵'] | 延时=300 | 范围=[[64,440,235,717]] | 图片=['队伍-暴食',85] | 开关={'暴食纽'}}
{找图 | 队伍-怠惰 | 点击=['T',0,0,50] | 赋值=['T',[{'第一次纽本'},0]] | 跳至=['T','纽本战斗处理','喵'] | 延时=300 | 范围=[[64,440,235,717]] | 图片=['队伍-怠惰',85] | 开关={'怠惰纽'}}
{找图 | 队伍-色欲 | 点击=['T',0,0,50] | 赋值=['T',[{'第一次纽本'},0]] | 跳至=['T','纽本战斗处理','喵'] | 延时=300 | 范围=[[64,440,235,717]] | 图片=['队伍-色欲',85] | 开关={'色欲纽'}}
{找图 | 队伍-愤怒 | 点击=['T',0,0,50] | 赋值=['T',[{'第一次纽本'},0]] | 跳至=['T','纽本战斗处理','喵'] | 延时=300 | 范围=[[64,440,235,717]] | 图片=['队伍-愤怒',85] | 开关={'愤怒纽'}}
{跳至 | ['纽本抗性选择','喵']}
)
[纽本选择固定队伍]=(
{赋值 | [[{'第一队'},0],[{'第二队'},0],[{'第三队'},0],[{'第四队'},0],[{'第五队'},0],[{'第六队'},0]]}
{组 | {'变量_纽本_队伍优先级'}}
{点击 | [145,510,50] | 延时=100 | 开关={'第一队'}}
{点击 | [145,560,50] | 延时=100 | 开关={'第二队'}}
{点击 | [145,600,50] | 延时=100 | 开关={'第三队'}}
{点击 | [145,650,50] | 延时=100 | 开关={'第四队'}}
{点击 | [145,680,50] | 延时=100 | 开关={'第五队'}}
{空参 | 跳转 | 跳至=['T','纽本战斗处理','喵']}
)
[纽本战斗处理]=(
{组 | '纽本抗性选择' | 开关={'第一次纽本'}}
{空参 | 喵}
//{延时|4000}
{点击 | [1418,729,50] | 延时=500}
{判断 | [[{'十罗单通铜牛'},'等于',1],{跳转=['T十协罗佳单通准备']}] | 开关={'忧郁纽'}}
{找图 | 纽本战斗中 | 跳转=['T纽本战斗中'] | 延时=200 | 范围=[[1298,4,1594,160]] | 图片=['战斗中标志','战斗中标志2','战斗中标志3',85] | 开关={'纽本开关'}}
{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{跳转 | '纽本战斗处理'}
)
[纽本结算]=(
{找图 | 升级 | 点击=['T',790,674,50] | 延时=500 | 范围=[[423,333,768,561]] | 图片=['升级',85]}
{找图 | 失败 | 计算=['T',[{'纽本次数'},'+',1,{'纽本次数'}]] | 范围=[[1089,114,1553,305]] | 图片=['战斗败北','战斗败北-中字',85]}
//确认
{点击 | [1451,730,50] | 延时=1000}
{打印变量 | ['纽本次数']}
//{计算|[[{'纽本次数'},'-',1,{'纽本次数'}]]}
{找图 | 采光 | 计算=['T',[{'纽本次数'},'-',1,{'纽本次数'}]] | 按键=['F','ENTER',50] | 循环=['F',999,100] | 范围=[[42,153,310,311]] | 图片=['采光界面','采光页面2',85]}
{判断 | [[{'纽本次数'},'小于等于',0],{赋值=['T',[{'纽本开关'},0]] | 跳至=['F','纽本准备','喵'] | 操作开关=['T',['主界面','纽本开关',0]]}]}
{判断 | [[{'经验本次数'},'小于等于',0],{赋值=['T',[{'纽本开关'},0]] | 跳至=['F','经验本准备','喵']}] | 开关={'经验本开关'}}
//退出
{点击 | [129,62,50] | 延时=1000}
//退出
{点击 | [129,62,50] | 延时=1000}
{比色 | 主页 | 跳转=['T主界面','F处理错误'] | 延时=200 | 颜色=['1542,863,#3B0000/1159,861,#3E0000/901,858,#3E0000',90]}
)
[纽本战斗中]=(
{赋值 | [[{'纽本单通变量'},0]]}
{延时 | 200 | 开关={'循环模式1'}}
{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{找图 | 纽本结算 | 组=['T纽本结算'] | 延时=500 | 范围=[[1089,114,1553,305],[42,153,310,311]] | 图片=['战斗胜利','战斗胜利-中字','战斗败北','战斗败北-中字','采光界面','采光页面2',85]}
{移动 | [1500,800,200,2] | 开关={'循环模式1'}}
{点击 | [1500,800,10] | 延时=100 | 开关={'循环模式1'}}
{找图 | bug | 点击=['T',1500,800,50] | 范围=[[1298,4,1594,160],[3,13,111,121]] | 图片=['战斗中标志','战斗中标志2','战斗中标志3','战斗中标志4',80] | 开关={'循环模式2'}}
{按键 | ['P',50] | 开关={'循环模式1'}}
{找图 | P | 按键=['T','P',50] | 范围=[[1298,4,1594,160],[3,13,111,121]] | 图片=['战斗中标志','战斗中标志2','战斗中标志3','战斗中标志4',80] | 开关={'循环模式2'}}
{按键 | ['ENTER',50] | 开关={'循环模式1'}}
{找图 | ENTER | 按键=['T','ENTER',50] | 范围=[[1298,4,1594,160],[3,13,111,121]] | 图片=['战斗中标志','战斗中标志2','战斗中标志3','战斗中标志4',80] | 开关={'循环模式2'}}
{找图 | 战斗问号 | 组=['T战斗问号'] | 延时=200 | 范围=[[364,40,514,155]] | 图片=['问号','问号2',85]}
//有人会挂着经验本次数打镜牢
{找图 | 地图界面 | 赋值=['T',[{'经验本开关'},0],[{'纽本开关'},0],[{'一次日常'},0]] | 组=['T镜本'] | 范围=[[1423,11,1587,173]] | 图片=['地图界面','地图界面2','地图界面3',75]}
{跳转 | '纽本战斗中'}
)
[十协罗佳单通准备]=(
{空参 | 喵}
{点击 | [1418,729,50] | 延时=500}
{找图 | 纽本战斗中 | 跳转=['T十协罗佳单通铜牛'] | 延时=200 | 范围=[[1298,4,1594,160]] | 图片=['战斗中标志','战斗中标志2','战斗中标志3',85] | 开关={'纽本开关'}}
{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{跳转 | '十协罗佳单通准备'}
)
[十协罗佳单通铜牛]=(
{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{找图 | 纽本结算 | 组=['T纽本结算'] | 延时=500 | 范围=[[1089,114,1553,305],[42,153,310,311]] | 图片=['战斗胜利','战斗胜利-中字','战斗败北','战斗败北-中字','采光界面','采光页面2',85]}
{找图 | 战斗问号 | 组=['T战斗问号'] | 延时=200 | 范围=[[364,40,514,155]] | 图片=['问号','问号2',85]}
{延时 | 200}
{找图 | 回合判断 | 点击=['T',1195,30,50] | 延时=500 | 计算=['T',[{'纽本单通变量'},'+',1,{'纽本单通变量'}]] | 跳转=['F十协罗佳单通铜牛'] | 范围=[[1298,4,1594,160],[3,13,111,121]] | 图片=['战斗中标志','战斗中标志2','战斗中标志3','战斗中标志4',80]}
//{赋值|[[{'纽本单通变量'},5]]}
{判断 | [[{'纽本单通变量'},'等于',1],{跳转=['T十协罗佳单通铜牛回合1']}]}
{判断 | [[{'纽本单通变量'},'等于',2],{跳转=['T十协罗佳单通铜牛回合2']}]}
{判断 | [[{'纽本单通变量'},'等于',3],{跳转=['T十协罗佳单通铜牛回合3']}]}
{判断 | [[{'纽本单通变量'},'等于',4],{跳转=['T十协罗佳单通铜牛回合4']}]}
{判断 | [[{'纽本单通变量'},'等于',5],{跳转=['T十协罗佳单通铜牛回合5']}]}

)
[十协罗佳单通铜牛回合1]=(
//换守备
{点击 | [760,830,50] | 偏移=[-125,-105] | 延时=200}
{点击 | [760,830,50] | 延时=200}
//技能1
{点击 | [760,725,50] | 延时=200}
{点击 | [695,400,50] | 延时=200}
{按键 | ['ENTER',50]}
{延时 | 1000}
{移动 | [1195,30,200,2]}
{跳转 | '十协罗佳单通铜牛'}
)
[十协罗佳单通铜牛回合2]=(
//换守备
{点击 | [710,830,50] | 偏移=[-125,-105] | 延时=200}
//{点击|[710,830,50]|延时=200}
{点击 | [805,830,50] | 延时=200}
//技能1
{点击 | [710,725,50] | 延时=200}
{点击 | [695,400,50] | 延时=200}
//技能2
{点击 | [805,725,50] | 延时=200}
{点击 | [695,400,50] | 延时=200}

//{点击|[770,400,50]|延时=200}
{按键 | ['ENTER',50]}
{延时 | 1000}
{移动 | [1195,30,200,2]}
{跳转 | '十协罗佳单通铜牛'}
)
[十协罗佳单通铜牛回合3]=(
//换守备
{点击 | [655,830,50] | 偏移=[-125,-105] | 延时=200}
//{点击|[655,830,50]|延时=200}
//{点击|[760,830,50]|延时=200}
{点击 | [855,830,50] | 延时=200}
//技能1
{点击 | [655,725,50] | 延时=200}
{点击 | [695,400,50] | 延时=200}
//技能2
{点击 | [760,725,50] | 延时=200}
{点击 | [695,400,50] | 延时=200}
//{点击|[770,400,50]|延时=200}
//技能3
{点击 | [855,725,50] | 延时=200}
{点击 | [695,400,50] | 延时=200}
//{点击|[840,400,50]|延时=200}
{按键 | ['ENTER',50]}
{延时 | 1000}
{移动 | [1195,30,200,2]}
{跳转 | '十协罗佳单通铜牛'}
)
[十协罗佳单通铜牛回合4]=(
{按键 | ['P',50]}
{延时 | 200}
{按键 | ['ENTER',50]}
{延时 | 1000}
{移动 | [1195,30,200,2]}
{点击 | ['T',1195,30,50,'L',1]}
{跳转 | '十协罗佳单通铜牛'}
)
[十协罗佳单通铜牛回合5]=(
{点击 | ['T',1195,30,50,'L',2]}
{按键 | ['P',50]}
{延时 | 500}
{按键 | ['P',50]}
{延时 | 200}
{按键 | ['ENTER',50]}
{延时 | 1000}
{移动 | [1195,30,200,2]}
{跳转 | '纽本战斗中'}
)
[▰▰▰▰▰▰[寻路部分]▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰]=(
{跳出 | 'TF'}
)
[地图界面]=(
{找图 | 地图界面 | 跳出='F' | 延时=50 | 范围=[[1423,11,1587,173]] | 图片=['地图界面','地图界面2','地图界面3',75]}
{组 | 'EGO计数重置'}
{找图 | 错误-效果选择 | 组=['T效果选择'] | 范围=[[340,163,1009,391]] | 图片=['效果选择','效果选择-中字','效果选择2',70]}
{找图 | 获得EGO | 点击=['T',0,0,50] | 延时=800 | 范围=[[621,588,989,739]] | 图片=['确认','确认-中字1','确认-中字2',85]}
{找图 | 获得EGO | 点击=['T',800,666,50] | 延时=200 | 范围=[[552,170,1093,287]] | 图片=['获得EGO礼物',85]}
{找图 | 中途楼层判断 | 组=['T中途楼层判断'] | 范围=[[1423,11,1587,173]] | 图片=['地图界面','地图界面2','地图界面3','楼层卡包选择','楼层卡包选择2','楼层卡包选择3','楼层卡包选择4',75] | 开关={'中途楼层判断'}}
//{判断|[[{'房间数'},'大于等于',18],{跳转=['T三层退']}]|开关={'三层退'}}
{空参 | 寻路}
{找图 | 服务器加载 | 循环=['T',999,100] | 范围=[[1250,22,1575,158]] | 图片=['加载中',85]}
{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
//试图通过延迟来让换层不退出
{延时 | 2250 | 开关={'选择了楼层卡包'}}
//{计算|[[{'选择了楼层卡包'},'+',{'镜本困难'},{'重选变量'}]]|开关={'第四层'}}
{计算 | [[{'选择了楼层卡包'},'+',{'镜本困难'},{'重选变量'}]] | 开关={'第五层'}}
{判断 | [[{'重选变量'},'大于',1],{赋值=['T',[{'开局重新选人2'},1]]}] | 开关={'镜本困难'}}
{空参 | 喵}
{赋值 | [[{'选择了楼层卡包'},0]]}
{移动 | [650,364,200,2] | 延时=200}

{组 | '找图寻路' | 开关={'找图寻路'}}
{组 | '寻路'}
{跳转 | '镜本'}
)


[死亡判定]=(
{赋值 | [[{'Num'},1]] | 开关={'EGO在战斗中只释放一次'}}
{判断 | [[{'Num2'},'等于',0],{跳出='T'}]}
{赋值 | [[{'Num'},99]] | 开关={'EGO在战斗中只释放一次'}}
{赋值 | [[{'Num2'},0]]}
{跳出 | 'TF'}
)

[找图寻路]=(
{延时 | 150 | 开关={'镜本困难'}}
{空参 | 事件}
{找图 | 结算 | 组=['T结算'] | 范围=[[1119,47,1546,304],[1227,604,1551,809],[153,100,443,237],[7,229,394,446]] | 图片=['战斗胜利','战斗胜利-中字','战斗败北','战斗败北-中字','探查完了','确认领取','确认领取2','数据分析',85]}

{比色 | 标记 | 点击=['T',590,352,50] | 延时=300 | 颜色=['567,379,#E9A700/583,380,#342700/596,380,#F1AD00/596,386,#362800/583,388,#D99900/568,388,#392A00',90]}
{找图 | 特殊 | 点击=['T',0,0,50] | 延时=300 | 范围=[[820,15,993,723]] | 图片=['问号-时杀时',70]}
{找图 | 入场 | 跳转=['T入场'] | 范围=[[1157,429,1584,873]] | 图片=['入场',85]}

{找图 | 事件点上 | 跳至=['T','找图寻路','运行1'] | 范围=[[819,38,995,275]] | 图片=['地图-问号','地图-问号2','地图-问号3','地图-问号4','地图-问号5','地图-问号6','地图-问号7',52]}
{找图 | 事件点下 | 跳至=['T','找图寻路','运行2'] | 范围=[[819,420,995,709]] | 图片=['地图-问号','地图-问号2','地图-问号3','地图-问号4','地图-问号5','地图-问号6','地图-问号7',52]}
{找图 | 事件点中 | 跳至=['T','找图寻路','运行3'] | 范围=[[819,260,995,1080]] | 图片=['地图-问号','地图-问号2','地图-问号3','地图-问号4','地图-问号5','地图-问号6','地图-问号7',52]}
{空参 | 寻找拉条战}
{找图 | 拉条战中 | 跳至=['T','找图寻路','运行4'] | 范围=[[819,260,995,1080]] | 图片=['道中1','道中2','道中3','道中4','道中5','道中6','道中7','道中8','道中9',52]}
{找图 | 拉条战上 | 跳至=['T','找图寻路','运行5'] | 范围=[[819,38,995,275]] | 图片=['道中1','道中2','道中3','道中4','道中5','道中6','道中7','道中8','道中9',52]}
{找图 | 拉条战下 | 跳至=['T','找图寻路','运行6'] | 范围=[[819,420,995,709]] | 图片=['道中1','道中2','道中3','道中4','道中5','道中6','道中7','道中8','道中9',52]}
{空参 | 困难战斗避开}
//{空参|困难战斗避开|跳至=['F','找图寻路','寻路']|开关={'困难战斗避开'}}
{找图 | 困难战斗 | 组=['F寻路-中'] | 范围=[[807,248,1003,476]] | 图片=['困难战斗',85]}
{找图 | 困难战斗 | 组=['F寻路-下'] | 范围=[[819,420,995,709]] | 图片=['困难战斗',85]}
{找图 | 困难战斗 | 组=['F寻路-上'] | 范围=[[819,38,995,275]] | 图片=['困难战斗',85]}
{组 | '寻路'}
{空参 | 运行1}
{移动 | [902,85,100,2] | 延时=250}
{比色 | 标记 | 点击=['T',902,85,50] | 延时=300 | 颜色=['853,78,#DD6F00/862,77,#312400/872,77,#E5A700/848,88,#E9AB00/857,88,#332600/868,88,#B17000',90]}
{找图 | 入场 | 跳转=['T入场'] | 跳至=['F','找图寻路','事件点下'] | 范围=[[1157,429,1584,873]] | 图片=['入场',85]}

{空参 | 运行2}
{移动 | [902,617,100,2] | 延时=250}
{比色 | 标记 | 点击=['T',902,617,50] | 延时=300 | 颜色=['845,614,#E35F05/858,614,#8B4400/867,614,#F1B300/850,626,#EDA900/861,626,#362800/871,626,#DB9300',90]}
{找图 | 入场 | 跳转=['T入场'] | 跳至=['F','找图寻路','事件点中'] | 范围=[[1157,429,1584,873]] | 图片=['入场',85]}

{空参 | 运行3}
{移动 | [902,346,100,2] | 延时=250}
{比色 | 标记 | 点击=['T',902,346,50] | 延时=300 | 颜色=['867,326,#EF5B03/878,325,#362800/886,326,#EBA500/858,337,#F5AF00/867,338,#342400/875,338,#E39F00',90]}
{找图 | 入场 | 跳转=['T入场'] | 跳至=['F','找图寻路','寻找拉条战'] | 范围=[[1157,429,1584,873]] | 图片=['入场',85]}

{空参 | 运行4}
{移动 | [902,346,100,2] | 延时=250}
{比色 | 标记 | 点击=['T',902,346,50] | 延时=300 | 颜色=['867,326,#EF5B03/878,325,#362800/886,326,#EBA500/858,337,#F5AF00/867,338,#342400/875,338,#E39F00',90]}
{找图 | 入场 | 跳转=['T入场'] | 跳至=['F','找图寻路','拉条战上'] | 范围=[[1157,429,1584,873]] | 图片=['入场',85]}

{空参 | 运行5}
{移动 | [902,85,100,2] | 延时=250}
{比色 | 标记 | 点击=['T',902,85,50] | 延时=300 | 颜色=['853,78,#DD6F00/862,77,#312400/872,77,#E5A700/848,88,#E9AB00/857,88,#332600/868,88,#B17000',90]}
{找图 | 入场 | 跳转=['T入场'] | 跳至=['F','找图寻路','拉条战下'] | 范围=[[1157,429,1584,873]] | 图片=['入场',85]}

{空参 | 运行6}
{移动 | [902,617,100,2] | 延时=250}
{比色 | 标记 | 点击=['T',902,617,50] | 延时=300 | 颜色=['845,614,#E35F05/858,614,#8B4400/867,614,#F1B300/850,626,#EDA900/861,626,#362800/871,626,#DB9300',90]}
{找图 | 入场 | 跳转=['T入场'] | 跳至=['F','找图寻路','困难战斗避开'] | 范围=[[1157,429,1584,873]] | 图片=['入场',85]}
{跳至 | ['找图寻路','困难战斗避开']}
)
[寻路-中]=(
{判断 | [[{'找图寻路'},'等于',0],{延时=150}] | 开关={'镜本困难'}}
{找图 | 战斗选人 | 跳转=['T战斗选人'] | 延时=111 | 范围=[[1342,118,1500,238]] | 图片=['战斗选人','战斗选人2','战斗选人3',70]}
{移动 | [894,350,400,2] | 延时=50}
{点击 | [894,350,10,'L',0,50] | 延时=100}
{延时 | 300}
{找图 | 入场 | 跳转=['T入场'] | 范围=[[1157,429,1584,873]] | 图片=['入场','入场2',85]}
{跳出 | 'TF'}
)
[寻路-下]=(
{找图 | 战斗选人 | 跳转=['T战斗选人'] | 延时=111 | 范围=[[1342,118,1500,238]] | 图片=['战斗选人','战斗选人2','战斗选人3',70]}
{移动 | [905,618,400,2] | 延时=50}
{点击 | [905,618,10,'L',0,50] | 延时=100}
{延时 | 300}
{找图 | 入场 | 跳转=['T入场'] | 范围=[[1157,429,1584,873]] | 图片=['入场','入场2',85]}
{跳出 | 'TF'}
)
[寻路-上]=(
{找图 | 战斗选人 | 跳转=['T战斗选人'] | 延时=111 | 范围=[[1342,118,1500,238]] | 图片=['战斗选人','战斗选人2','战斗选人3',70]}
{移动 | [898,83,400,2] | 延时=50}
{点击 | [898,83,10,'L',0,50] | 延时=100}
{延时 | 300}
{找图 | 入场 | 跳转=['T入场'] | 范围=[[1157,429,1584,873]] | 图片=['入场','入场2',85]}
{跳出 | 'TF'}
)


[寻路]=(
{组 | '死亡判定' | 开关={'第五层开始释放EGO'}}
//{比色|黑屏等待|延时=2000|颜色=['663,351,#000000/782,333,#000000/938,351,#000000/693,423,#000000/788,423,#000000/921,423,#000000/661,543,#000000/797,531,#000000/907,523,#000000',90]}
{找图 | 通用确认 | 点击=['T',0,0,500,'2L'] | 延时=1000 | 范围=[[419,125,1568,871]] | 图片=['确认','确认-中字1','确认-中字2','确认1','确认2',85]}
{找图 | 通用确认 | 点击=['T',0,0,500,'2L'] | 延时=1000 | 范围=[[419,125,1568,871]] | 图片=['确认','确认-中字1','确认-中字2','确认1','确认2',85]}

{空参 | 火车头}
{移动 | [582,347,200,2] | 延时=100}
{点击 | [582,347,10,'L',0,50] | 延时=450}
{找图 | 入场 | 跳转=['T入场'] | 延时=100 | 范围=[[1157,429,1584,873]] | 图片=['入场',85]}
//结算前可能有地图界面
{找图 | 结算 | 组=['T结算'] | 范围=[[1119,47,1546,304],[1227,604,1551,809],[153,100,443,237]] | 图片=['战斗胜利','战斗胜利-中字','战斗败北','战斗败北-中字','探查完了','确认领取','确认领取2','数据分析',85]}
{组 | '寻路-中'}
{组 | '寻路-上'}
{组 | '寻路-下'}

{跳转 | '小退'}

)

[入场]=(
{点击 | [1458,700,10] | 延时=300}
{找图 | 服务器加载 | 循环=['T',999,100] | 范围=[[1250,22,1575,158]] | 图片=['加载中',85]}
{找图 | 重连 | 点击=['T',859,584,50] | 跳至=['T','入场','服务器加载'] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{延时 | 300}
{跳至 | ['入场','名称'] | 开关={'镜本普通'}}
{判断 | [[{'困难战斗'},'等于',1],{赋值=['T',[{'开局重新选人2'},1]]}] | 开关={'第五层'}}
{判断 | [[{'困难战斗'},'等于',1],{赋值=['T',[{'开局重新选人2'},1]]}] | 开关={'第四层'}}
{空参 | 名称}
{跳转 | '房间判断' | 开关={'开局重新选人2'}}
//{赋值|[[{'寻路遍数'},0]]}
//{计算|[[{'房间数'},'+',1,{'房间数'}]]}
{计算 | [[{'节点数'},'+',1,{'节点数'}]]}
{按键 | ['enter',50] | 开关={'选人跳过'}}
{按键 | ['enter',50] | 开关={'选人跳过'}}

{跳转 | '房间判断'}
)
[房间判断]=(
{找图 | 战斗中标志 | 组=['T战斗中标志'] | 重置计次=['T','确认次数'] | 范围=[[1298,4,1594,160],[3,13,111,121]] | 图片=['战斗中标志','战斗中标志2','战斗中标志3','战斗中标志4',80]}
{找图 | 战斗选人 | 组=['T战斗选人'] | 重置计次=['T','确认次数'] | 范围=[[1342,118,1500,238]] | 图片=['战斗选人','战斗选人2','战斗选人3',70]}
{找图 | 商店 | 组=['T商店'] | 重置计次=['T','确认次数'] | 范围=[[248,115,670,443]] | 图片=['商店',75]}
{找图 | 问号 | 组=['T问号'] | 重置计次=['T','确认次数'] | 范围=[[364,40,514,155]] | 图片=['问号','问号2',85]}
{空参 | 确认次数 | 延时=200 | 计次=['T','确认次数',20,{组=['T次数过多问题检查']}]}
{跳转 | '房间判断'}
)

[次数过多问题检查]=(
{空参 | 名称 | 重置计次=['TF','确认次数']}
{组 | '镜本'}
)

[战斗选人]=(
//{找图|错误-战斗编成界面|点击=['F',121,55,50]|范围=[[1315,543,1451,713]]|图片=['错误-战斗编成界面','错误-战斗编成界面-中字',75]}
{找图 | 通用确认 | 按键=['T','enter',50] | 延时=200 | 范围=[[419,125,1568,871]] | 图片=['确认','确认-中字1','确认-中字2','确认1','确认2',65]}
{组 | '选择特定人格' | 开关={'开局重新选人2'}}
{按键 | ['enter',50] | 开关={'选人跳过'}}
{点击 | [1435,740,50] | 开关={'选人跳过'}}
//{找图|没选人2|点击=['F',826,74,50]|范围=[[280,170,1292,672]]|图片=['已选人',80]|开关={'选人跳过'}}

{赋值 | [[{'开局重新选人2'},0]]}
{找图 | 通用确认 | 按键=['T','enter',50] | 延时=200 | 范围=[[419,125,1568,871]] | 图片=['确认','确认-中字1','确认-中字2','确认1','确认2',65]}
//开局重新选人
//{移动|[1435,74,10]}
//{识数|战斗选人|判断=['大于等于',6]|模式=0|按键=['T','enter',50]|延时=1000|范围=[[1382,629,1480,690]]}
{组 | '已选人检测'}
//{找图|战斗满员|按键=['T','enter',50]|延时=300|范围=[[1293,543,1571,809]]|图片=['六人','连续战斗','连续战斗-中字',70]}
//{找图|没选人2|按键=['T','enter',50]|延时=300|组=['T选择特定人格']|范围=[[475,4,1293,221]]|图片=['没选人2',60]}
//{找图|没选人|延时=300|组=['T选择特定人格']|范围=[[1311,109,1550,798]]|图片=['没选人',80]}

{空参 | 喵}
//防止识图不准
{点击 | [1435,740,50] | 延时=1000}
{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
//{找图|错误-下方人格栏|点击=['F',103,77,50]|延时=100|范围=[[1301,542,1556,627]]|图片=['错误-下方人格栏',85]}
{找图 | 战斗中标志 | 组=['T战斗中标志'] | 范围=[[1298,4,1594,160],[3,13,111,121]] | 图片=['战斗中标志','战斗中标志2','战斗中标志3','战斗中标志4',80]}
{找图 | 战斗问号 | 组=['T战斗问号'] | 范围=[[308,18,565,183]] | 图片=['问号','问号2',80]}
{延时 | 200}
{空参 | 战斗计次 | 计次=['T','战斗计次',300,{组=['T镜本']}]}
{跳至 | ['战斗选人','战斗中标志']}
)
[已选人检测]=(
{找图 | 战斗选人 | 跳出='F' | 范围=[[1342,118,1500,238]] | 图片=['战斗选人','战斗选人2','战斗选人3',70]}
{赋值 | [[{'已选人检测'},1]]}
{组 | {'变量_角色1_优先级'}}
{组 | {'变量_角色2_优先级'}}
{组 | {'变量_角色3_优先级'}}
{组 | {'变量_角色4_优先级'}}
{组 | {'变量_角色5_优先级'}}
{组 | {'变量_角色6_优先级'}}
{找图 | 战斗选人 | 跳出='F' | 范围=[[1342,118,1500,238]] | 图片=['战斗选人','战斗选人2','战斗选人3',70]}
{组 | '选择特定人格' | 开关={'重新选人'}}
{跳出 | 'TF'}
)

[▰▰▰▰▰▰[镜之迷宫战斗部分]▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰]=(
{跳出 | 'TF'}
)
[战斗中标志]=(
{重置计次 | '战斗计次'}
{赋值 | [[{'自动拉条1'},1]] | 开关={'自动拉条五人'}}
{赋值 | [[{'自动拉条2'},1]] | 开关={'自动拉条六人'}}
{组 | '困难战斗' | 开关={'困难战斗'}}
{组 | '自动拉条A' | 开关={'拉条模式A'}}
{组 | '自动拉条B' | 开关={'拉条模式B'}}
{组 | '普通战斗'}
{跳出 | 'TF'}
)
[战斗中识别]=(
{找图 | 经验本结算 | 组=['T经验本结算'] | 延时=500 | 范围=[[1198,95,1480,214],[510,125,1086,250],[42,153,310,311]] | 图片=['战斗胜利','战斗胜利-中字','战斗败北','战斗败北-中字','探查完','采光界面','采光页面2',85] | 开关={'经验本开关'}}
{延时 | 400 | 开关={'经验本开关'}}
{跳转 | '战斗中识别' | 开关={'经验本开关'}}
{重置计次 | '战斗计次' | 开关={'道中模式2'}}

{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{找图 | 三层退 | 赋值=['T',[{'困难战斗'},0],[{'战斗释放特定EGO'},0]] | 组=['T三层退'] | 范围=[[1423,11,1587,173]] | 图片=['地图界面','地图界面2','地图界面3',75] | 开关={'三层退'}}
{找图 | 四层退 | 赋值=['T',[{'困难战斗'},0],[{'战斗释放特定EGO'},0]] | 组=['T四层退'] | 范围=[[1423,11,1587,173]] | 图片=['地图界面','地图界面2','地图界面3',75] | 开关={'四层退'}}
{找图 | 中途楼层判断 | 赋值=['T',[{'困难战斗'},0],[{'战斗释放特定EGO'},0]] | 组=['T中途楼层判断'] | 范围=[[1423,11,1587,173]] | 图片=['地图界面','地图界面2','地图界面3','楼层卡包选择','楼层卡包选择2','楼层卡包选择3','楼层卡包选择4',75] | 开关={'中途楼层判断'}}
{找图 | 地图界面 | 赋值=['T',[{'困难战斗'},0],[{'战斗释放特定EGO'},0]] | 重置计次=['T','战斗计次'] | 组=['T地图界面'] | 范围=[[1423,11,1587,173]] | 图片=['地图界面','地图界面2','地图界面3',75]}
{找图 | EGO礼物选择 | 赋值=['T',[{'困难战斗'},0],[{'战斗释放特定EGO'},0]] | 重置计次=['T','战斗计次'] | 组=['TEGO礼物选择'] | 范围=[[996,601,1562,825]] | 图片=['EGO礼物选择','EGO礼物选择2','EGO礼物选择3',85]}
{找图 | 楼层卡包选择 | 赋值=['T',[{'困难战斗'},0],[{'战斗释放特定EGO'},0]] | 重置计次=['T','战斗计次'] | 组=['T楼层卡包选择'] | 范围=[[867,11,1433,109]] | 图片=['楼层卡包选择','楼层卡包选择2',85]}
{找图 | 战斗报酬选择 | 赋值=['T',[{'困难战斗'},0],[{'战斗释放特定EGO'},0]] | 重置计次=['T','战斗计次'] | 组=['T战斗报酬选择'] | 范围=[[259,26,994,237]] | 图片=['战斗报酬选择','战斗报酬选择-中字1','战斗报酬选择-中字2','不跳过报酬获取-中字1','不跳过报酬获取',85]}
{找图 | 结算 | 赋值=['T',[{'困难战斗'},0],[{'战斗释放特定EGO'},0]] | 重置计次=['T','战斗计次'] | 组=['T结算'] | 范围=[[1119,47,1546,304],[1227,604,1551,809],[153,100,443,237]] | 图片=['战斗胜利','战斗胜利-中字','战斗败北','战斗败北-中字','探查完了','确认领取','确认领取2','数据分析',85]}
//{找图|错误-战斗中进入人格界面|点击=['T',403,81,50]|延时=1000|范围=[[768,10,1586,404]]|图片=['错误-战斗中进入人格界面',85]}
{找图 | 战斗中标志 | 组=['T战斗中标志'] | 范围=[[1298,4,1594,160],[3,13,111,121]] | 图片=['战斗中标志','战斗中标志2','战斗中标志3','战斗中标志4',80] | 开关={'道中模式2'}}
{找图 | 加载条 | 赋值=['T',[{'战斗问号'},0]] | 范围=[[1409,326,1571,434]] | 图片=['加载条1','加载条2',70]}
{找图 | 通用确认 | 点击=['T',0,0,500,'2L'] | 延时=100 | 范围=[[419,125,1568,871]] | 图片=['确认','确认-中字1','确认-中字2','确认1','确认2',85]}
{空参 | 确认次数 | 延时=200 | 计次=['T','确认次数',80,{组=['T次数过多问题检查']}]}
{组 | '困难战斗' | 开关={'困难战斗'}}
{组 | '战斗中识别' | 开关={'道中模式2'}}
{组 | '普通战斗'}
)
[自动拉条A]=(
{赋值 | [[{'拉条变量'},0]] | 开关={'自动拉条1'}}
{赋值 | [[{'拉条变量'},1]] | 开关={'自动拉条2'}}
{找图 | 道中作战 | 组=['T道中检测A'] | 范围=[[386,653,448,764]] | 图片=['道中作战2',60] | 开关={'自动拉条1'}}
{找图 | 道中作战 | 组=['T道中检测A'] | 范围=[[332,646,402,778]] | 图片=['道中作战2',60] | 开关={'自动拉条2'}}
{跳出 | 'TF'}
)
[自动拉条B]=(
{赋值 | [[{'拉条变量'},0]] | 开关={'自动拉条1'}}
{赋值 | [[{'拉条变量'},1]] | 开关={'自动拉条2'}}
{找图 | 道中作战 | 组=['T道中检测B'] | 范围=[[386,653,448,764]] | 图片=['道中作战2',60] | 开关={'自动拉条1'}}
{找图 | 道中作战 | 组=['T道中检测B'] | 范围=[[332,646,402,778]] | 图片=['道中作战2',60] | 开关={'自动拉条2'}}
{跳出 | 'TF'}
)
[普通战斗]=(
{重置计次 | '两回合'}
{组 | '困难战斗判定' | 开关={'战斗时检测'}}
{组 | '困难战斗' | 开关={'困难战斗'}}


{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638]] | 图片=['重连','重连-中字',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{找图 | 战斗问号 | 组=['T战斗问号'] | 赋值=['T',[{'困难战斗'},0],[{'战斗释放特定EGO'},0]] | 延时=200 | 范围=[[364,40,514,155]] | 图片=['问号','问号2',85]}
{找图 | 暂停 | 点击=['T',0,0,50] | 延时=200 | 范围=[[1401,10,1561,114]] | 图片=['暂停',85]}
{找图 | 卡住退出 | 点击=['T',0,0,50] | 延时=100 | 范围=[[672,477,934,511]] | 图片=['卡住退出',85]}

{按键 | ['P',50] | 开关={'循环模式1'}}
{找图 | P | 按键=['T','P',50] | 重置计次=['T','战斗计次'] | 范围=[[1298,4,1594,160],[3,13,111,121]] | 图片=['战斗中标志','战斗中标志2','战斗中标志3','战斗中标志4',80] | 开关={'循环模式2'}}
//bug

{移动 | [1500,800,200,2] | 开关={'循环模式1'}}
{点击 | [1500,800,10] | 延时=100 | 开关={'循环模式1'}}
{找图 | bug | 点击=['T',1500,800,50] | 范围=[[1298,4,1594,160],[3,13,111,121]] | 图片=['战斗中标志','战斗中标志2','战斗中标志3','战斗中标志4',80] | 开关={'循环模式2'}}

{找图 | 死亡重开 | 跳转=['T死亡重开'] | 范围=[[403,774,1587,897]] | 图片=['死亡重开',75] | 开关={'死亡重开'}}
//{找图|空血条|赋值=['T',[{'战斗释放特定EGO'},1]]|延时=100|范围=[[481,786,524,801],[481,786,524,801],[678,781,730,803],[774,775,832,799],[882,778,936,802],[982,780,1038,804]]|图片=['空血条',55]|开关={'低血量使用EGO'}}
//{找色|空血条|赋值=['T',[{'战斗释放特定EGO'},1]]|延时=100|范围=[[481,786,524,801],[481,786,524,801],[678,781,730,803],[774,775,832,799],[882,778,936,802],[982,780,1038,804]]|颜色=['#2B201E','13,0,#0E0E0D',95]|开关={'低血量使用EGO'}}
{判断 | [[{'第五层'},'等于',1],{赋值=['T',[{'第五层开始释放EGO2'},1]]}] | 开关={'第五层开始释放EGO'}}
{空参 | 五层释放ego | 赋值=['T',[{'战斗释放特定EGO'},1],[{'第五层释放ego'},1]] | 开关={'第五层开始释放EGO2'}}
{找图 | 罪人混乱 | 赋值=['T',[{'战斗释放特定EGO'},1],[{'低血量释放ego'},1]] | 延时=100 | 范围=[[213,769,1329,894]] | 图片=['罪人混乱1','罪人混乱2',85] | 开关={'低血量使用EGO'}}
{组 | '战斗释放特定EGO' | 开关={'战斗释放特定EGO'}}
{按键 | ['ENTER',50] | 开关={'循环模式1'}}
{找图 | ENTER | 按键=['T','ENTER',50] | 范围=[[1298,4,1594,160],[3,13,111,121]] | 图片=['战斗中标志','战斗中标志2','战斗中标志3','战斗中标志4',80] | 开关={'循环模式2'}}
{赋值 | [[{'第五层开始释放EGO2'},0]]}
//bug
{找图 | 加载条 | 跳转=['T战斗中识别'] | 赋值=['T',[{'战斗问号'},0]] | 范围=[[1409,326,1571,434]] | 图片=['加载条1','加载条2',70]}
{赋值 | [[{'战斗释放特定EGO'},0]]}
{空参 | 战斗计次 | 计次=['T','战斗计次',300,{组=['T镜本']}]}
{延时 | 300 | 开关={'循环模式1'}}
{组 | '普通战斗' | 开关={'道中模式2'}}
{组 | '战斗中识别'}
)
[困难战斗]=(
{赋值 | [[{'战斗释放特定EGO'},1],[{'输出型ego释放'},1],[{'回复型ego释放'},1]]}

{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638]] | 图片=['重连','重连-中字',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{找图 | 战斗问号 | 组=['T战斗问号'] | 延时=200 | 范围=[[364,40,514,155]] | 图片=['问号','问号2',85]}
{找图 | 暂停 | 点击=['T',0,0,50] | 延时=200 | 范围=[[1401,10,1561,114]] | 图片=['暂停',85]}
{找图 | 卡住退出 | 点击=['T',0,0,50] | 延时=100 | 范围=[[672,477,934,511]] | 图片=['卡住退出',85]}

{找图 | 处理 | 跳至=['F','困难战斗','加载条'] | 范围=[[1298,4,1594,160],[3,13,111,121]] | 图片=['战斗中标志','战斗中标志2','战斗中标志3','战斗中标志4',80] | 开关={'循环模式2'}}
{按键 | ['P',50] | 开关={'循环模式1'}}
{找图 | P | 按键=['T','P',50] | 重置计次=['T','战斗计次'] | 范围=[[1298,4,1594,160],[3,13,111,121]] | 图片=['战斗中标志','战斗中标志2','战斗中标志3','战斗中标志4',80] | 开关={'循环模式2'}}
//bug
{移动 | [1500,800,200,2] | 开关={'循环模式1'}}
{点击 | [1500,800,10] | 延时=100 | 开关={'循环模式1'}}
{找图 | bug | 点击=['T',1500,800,50] | 延时=200 | 范围=[[1298,4,1594,160],[3,13,111,121]] | 图片=['战斗中标志','战斗中标志2','战斗中标志3','战斗中标志4',80] | 开关={'循环模式2'}}
{找图 | 死亡 | 赋值=['T',[{'开局重新选人2'},1]] | 延时=200 | 范围=[[403,774,1587,897]] | 图片=['死亡重开',75]}
{找图 | 战斗非常不利 | 赋值=['T',[{'战斗X'},{'x'}]] | 组=['T绝对不利判断'] | 范围=[[283,687,1016,767]] | 图片=['战斗-非常不利',68]}
{空参 | 1}
{重置计次 | '不利循环次数'}
//{组|'战斗释放特定EGO'|开关={'战斗释放特定EGO'}}
{找图 | 释放特定EGO | 组=['T战斗释放特定EGO'] | 范围=[[1298,4,1594,160],[3,13,111,121]] | 图片=['战斗中标志','战斗中标志2','战斗中标志3','战斗中标志4',80] | 开关={'战斗释放特定EGO'}}
{按键 | ['ENTER',50] | 开关={'循环模式1'}}
{找图 | ENTER | 按键=['T','ENTER',50] | 范围=[[1298,4,1594,160],[3,13,111,121]] | 图片=['战斗中标志','战斗中标志2','战斗中标志3','战斗中标志4',80] | 开关={'循环模式2'}}

{找图 | 加载条 | 跳转=['T战斗中识别'] | 赋值=['T',[{'困难战斗'},0],[{'战斗释放特定EGO'},0],[{'战斗问号'},0]] | 范围=[[1409,326,1571,434]] | 图片=['加载条1','加载条2',70]}
{赋值 | [[{'战斗释放特定EGO'},0]]}
{空参 | 战斗计次 | 计次=['T','战斗计次',300,{组=['T镜本']}]}
{延时 | 300}
{组 | '困难战斗'}
)
[退出战斗]=(
{按键 | ['esc',50] | 延时=100}
{点击 | [798,496,50] | 延时=100}
{跳出 | 'TF'}
)
[困难战斗判定]=(
//疯了才去做这个,最后还是疯了
//{找图|人皮预言家|组=['T人皮预言家']'|延时=100|范围=[[1150,407,1485,603]]|图片=['人皮预言家',85]}
//{找图|人皮预言家2|组=['T人皮预言家']|延时=100|范围=[[434,0,714,118]]|图片=['人皮预言家2',85]}
{找图 | 噬梦的浊流 | 组=['T困难战斗下一把'] | 范围=[[1172,113,1354,242]] | 图片=['噬梦的浊流',85]}
{找图 | 扭曲金笠 | 组=['T困难战斗下一把'] | 范围=[[1022,10,1329,131]] | 图片=['扭曲金笠',85]}
{找图 | 红炎蛾 | 组=['T困难战斗下一把'] | 范围=[[1096,375,1286,509]] | 图片=['红炎蛾',85]}
//{找图|时间杀人魔|组=['T困难战斗']|赋值=['T',[{'战斗释放特定EGO'},1]]|延时=100|范围=[[842,384,1268,585]]|图片=['时间杀人魔','时间杀人魔2',70]}
{跳出 | 'TF'}
)
[困难战斗下一把]=(
{组 | '退出战斗'}
{空参 | 等待}
{延时 | 5000}
{找图 | 地图界面 | 组=['T重新开始这一把'] | 跳至=['F','困难战斗下一把','等待'] | 范围=[[1423,11,1587,173]] | 图片=['地图界面','地图界面2','地图界面3',75]}
{跳转 | '主界面'}
)

[死亡重开]=(
{点击 | [1544,51,50] | 延时=500}
{点击 | [850,500,50] | 延时=500}
{赋值 | [[{'困难战斗'},1]]}
{赋值 | [[{'第四层'},1]]}
{赋值 | [[{'Num2'},1]] | 开关={'EGO在战斗中只释放一次'}}
{赋值 | [[{'战斗释放特定EGO'},1],[{'输出型ego释放'},1],[{'回复型ego释放'},1]]}
{延时 | 9000}
{跳转 | '镜本'}
)
[绝对不利判断]=(
{找图 | 道中作战 | 组=['T绝对不利释放ego'] | 范围=[[63,612,454,807]] | 图片=['道中作战2',60]}
{赋值 | [[{'不利范围x1'},454],[{'不利范围x2'},602],[{'不利范围x3'},560],[{'不利范围x4'},674],[{'不利范围x5'},656],[{'不利范围x6'},771]]}
{赋值 | [[{'不利范围x7'},754],[{'不利范围x8'},863],[{'不利范围x9'},854],[{'不利范围x10'},960],[{'不利范围x11'},955],[{'不利范围x12'},1063]]}
{空参 | 1}
{找图 | 战斗非常不利 | 计次=['T','不利循环次数',7,{跳至=['T','困难战斗','1']}] | 范围=[[283,687,1016,767]] | 图片=['战斗-非常不利',68]}
{找图 | 战斗-EGO | 赋值=['T',[{'不利范围x1'},1430],[{'不利范围x2'},1586]] | 范围=[[454,651,602,771]] | 图片=['战斗-EGO',65]}
{找图 | 战斗-EGO | 赋值=['T',[{'不利范围x3'},1430],[{'不利范围x4'},1586]] | 范围=[[560,651,674,771]] | 图片=['战斗-EGO',65]}
{找图 | 战斗-EGO | 赋值=['T',[{'不利范围x5'},1430],[{'不利范围x6'},1586]] | 范围=[[656,651,771,771]] | 图片=['战斗-EGO',65]}
{空参 | 2}
{找图 | 战斗-EGO | 赋值=['T',[{'不利范围x7'},1430],[{'不利范围x8'},1586]] | 范围=[[754,651,863,771]] | 图片=['战斗-EGO',65]}
{找图 | 战斗-EGO | 赋值=['T',[{'不利范围x9'},1430],[{'不利范围x10'},1586]] | 范围=[[854,651,960,771]] | 图片=['战斗-EGO',65]}
{找图 | 战斗-EGO | 赋值=['T',[{'不利范围x11'},1430],[{'不利范围x12'},1586]] | 范围=[[954,651,1063,771]] | 图片=['战斗-EGO',65]}

{找图 | 战斗非常不利1 | 赋值=['T',[{'战斗X'},{'x'}]] | 组=['T绝对不利释放ego'] | 范围=[[{'不利范围x1'},657,{'不利范围x2'},769],[{'不利范围x3'},657,{'不利范围x4'},769],[{'不利范围x5'},657,{'不利范围x6'},769]] | 图片=['战斗-非常不利',65]}
{找图 | 战斗非常不利2 | 赋值=['T',[{'战斗X'},{'x'}]] | 组=['T绝对不利释放ego'] | 范围=[[{'不利范围x7'},657,{'不利范围x8'},769],[{'不利范围x9'},657,{'不利范围x10'},769],[{'不利范围x11'},657,{'不利范围x12'},769]] | 图片=['战斗-非常不利',65]}

{找图 | 战斗非常不利1 | 跳至=['T','绝对不利判断','1'] | 范围=[[{'不利范围x1'},657,{'不利范围x2'},769],[{'不利范围x3'},657,{'不利范围x4'},769],[{'不利范围x5'},657,{'不利范围x6'},769]] | 图片=['战斗-非常不利',65]}
{找图 | 战斗非常不利2 | 跳至=['T','绝对不利判断','1'] | 范围=[[{'不利范围x7'},657,{'不利范围x8'},769],[{'不利范围x9'},657,{'不利范围x10'},769],[{'不利范围x11'},657,{'不利范围x12'},769]] | 图片=['战斗-非常不利',65]}

{跳至 | ['困难战斗','1']}
)
[绝对不利释放ego]=(
{点击 | [{'战斗X'},840,50] | 偏移=[-23,0] | 延时=100}
{点击 | [{'战斗X'},840,50] | 偏移=[-23,0] | 延时=100}
{点击 | [{'战斗X'},840,1000] | 偏移=[-23,0] | 延时=500}
{点击 | [1123,590,50,'2L'] | 延时=100}
//{找图|战斗-没资源|点击=['T',846,590,50,'2L']|延时=200|范围=[[1179,292,1243,310]]|图片=['战斗-没资源',85]}
{点击 | [1500,800,50] | 延时=200}
{按键 | ['P',50]}
{延时 | 200}
{按键 | ['P',50]}
{延时 | 200}
{按键 | ['P',50]}
{找图 | 道中作战 | 跳至=['T','困难战斗','1'] | 范围=[[63,612,454,807]] | 图片=['道中作战2',60]}
//{空参|没资源|跳至=['T','困难战斗','1']|赋值=['T',[{'未命名开关1'},0]]|开关={'未命名开关1'}}
{跳至 | ['绝对不利判断','1']}
)
[侵蚀冰桥]=(
{延时 | 200}
{找色 | EGO_嫉妒 | 跳出='F' | 延时=10 | 范围=[[1552,411,1557,435]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找色 | EGO_抑郁 | 跳出='F' | 延时=10 | 范围=[[1552,330,1557,353]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找图 | 罗佳_十协会 | 赋值=['T',[{'头像X'},{'X'}],[{'头像Y'},{'Y'}]] | 组=['TEGO_选择指定ego'] | 范围=[[205,790,1417,871]] | 图片=['罗佳_十协会_小头像1','罗佳_十协会_小头像2','罗佳_黑云会_小头像','小六罗',75]}
{找图 | EGO_冰桥 | 点击=['T',0,0,50,'2L',1] | 计算=['T',[{'罗佳执行次数'},'+',1,{'罗佳执行次数'}]] | 延时=500 | 范围=[[4,2,1586,884]] | 图片=['EGO_冰桥',80]}
{延时 | 200}
{找图 | 冰桥侵蚀 | 点击=['T',0,0,50,'2L',2] | 延时=100 | 范围=[[4,2,1586,884]] | 图片=['冰桥侵蚀',75]}
{延时 | 200}
{找图 | 冰桥侵蚀2 | 点击=['T',0,0,50,'2L'] | 延时=100 | 范围=[[627,137,944,416]] | 图片=['冰桥侵蚀2',75]}
{点击 | [1500,800,50] | 延时=500}
{跳出 | 'TF'}
)
[▰▰▰▰▰▰[自动拉条]▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰]=(
{跳出 | 'TF'}
)
[道中检测A]=(
{空参 | 正在运行TT2加速协议}
{找图 | 死亡重开 | 跳转=['T死亡重开'] | 范围=[[403,774,1587,897]] | 图片=['死亡重开',75] | 开关={'死亡重开'}}
{找图 | 战斗中标志 | 跳至=['T','道中检测A','开拉'] | 计算=['T',[{'拉条变量'},'+',1,{'拉条变量'}]] | 范围=[[1298,4,1594,160],[3,13,111,121]] | 图片=['战斗中标志','战斗中标志2','战斗中标志3','战斗中标志4',80]}

{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638]] | 图片=['重连','重连-中字',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{找图 | 加载条 | 跳转=['T战斗中识别'] | 范围=[[1409,326,1571,434]] | 图片=['加载条1','加载条2',70]}
{延时 | 200}
{找图 | 死亡重开 | 跳转=['T死亡重开'] | 范围=[[403,774,1587,897]] | 图片=['死亡重开',75] | 开关={'死亡重开'}}
{空参 | 两回合 | 计次=['T','两回合',250,{组=['T普通战斗']}]}
{跳至 | ['道中检测A','正在运行TT2加速协议']}

{空参 | 开拉}
{找图 | 1 | 判断=['T',[{'拉条变量'},'等于',1],{组=['T道中技能检查1']}] | 范围=[[1298,4,1594,160],[3,13,111,121]] | 图片=['战斗中标志','战斗中标志2','战斗中标志3','战斗中标志4',80]}
{找图 | 2 | 判断=['T',[{'拉条变量'},'等于',2],{组=['T道中技能检查2']}] | 范围=[[1298,4,1594,160],[3,13,111,121]] | 图片=['战斗中标志','战斗中标志2','战斗中标志3','战斗中标志4',80]}
{找图 | 3 | 判断=['T',[{'拉条变量'},'等于',3],{组=['T道中技能检查3']}] | 范围=[[1298,4,1594,160],[3,13,111,121]] | 图片=['战斗中标志','战斗中标志2','战斗中标志3','战斗中标志4',80]}
{找图 | 4 | 判断=['T',[{'拉条变量'},'等于',4],{组=['T道中技能检查4']}] | 范围=[[1298,4,1594,160],[3,13,111,121]] | 图片=['战斗中标志','战斗中标志2','战斗中标志3','战斗中标志4',80]}
{找图 | 5 | 判断=['T',[{'拉条变量'},'等于',5],{组=['T道中技能检查5']}] | 范围=[[1298,4,1594,160],[3,13,111,121]] | 图片=['战斗中标志','战斗中标志2','战斗中标志3','战斗中标志4',80]}
{找图 | 6 | 判断=['T',[{'拉条变量'},'等于',6],{组=['T道中技能检查6']}] | 范围=[[1298,4,1594,160],[3,13,111,121]] | 图片=['战斗中标志','战斗中标志2','战斗中标志3','战斗中标志4',80]}
{找图 | 7 | 判断=['T',[{'拉条变量'},'等于',7],{组=['T道中技能检查7']}] | 范围=[[1298,4,1594,160],[3,13,111,121]] | 图片=['战斗中标志','战斗中标志2','战斗中标志3','战斗中标志4',80]}
{找图 | 8 | 判断=['T',[{'拉条变量'},'等于',8],{组=['T道中技能检查8']}] | 范围=[[1298,4,1594,160],[3,13,111,121]] | 图片=['战斗中标志','战斗中标志2','战斗中标志3','战斗中标志4',80]}

)
[道中技能检查1]=(
{移动 | [565,732,200,2]}
{延时 | 100}
//+84
{找图 | 1 | 赋值=['T',[{'仪表盘1'},840]] | 范围=[[576,630,660,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 2 | 赋值=['T',[{'仪表盘2'},840]] | 范围=[[660,630,744,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 3 | 赋值=['T',[{'仪表盘3'},840]] | 范围=[[744,630,828,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 4 | 赋值=['T',[{'仪表盘4'},840]] | 范围=[[828,630,912,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 5 | 赋值=['T',[{'仪表盘5'},840]] | 范围=[[912,630,996,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{跳转 | '道中作战1'}
)
[道中作战1]=(
//起始+135,后面+96
{点击 | ['T',426,710,50,'L',1]}
{移动 | [426,785,25,10]}
{移动 | [561,{'仪表盘1'},75,10]}
{移动 | [657,{'仪表盘2'},75,10]}
{移动 | [753,{'仪表盘3'},75,10]}
{移动 | [849,{'仪表盘4'},75,10]}
{移动 | [945,{'仪表盘5'},75,10]}
{点击 | ['T',1094,779,50,'L',2]}
{按键 | ['ENTER',50]}
{延时 | 2000}
{重置计次 | '两回合'}
{跳转 | '仪表盘重新赋值'}
)
[道中技能检查2]=(
{移动 | [611,732,200,2]}
//+84
{延时 | 100}
{找图 | 1 | 赋值=['T',[{'仪表盘1'},840]] | 范围=[[535,630,619,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 2 | 赋值=['T',[{'仪表盘2'},840]] | 范围=[[619,630,703,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 3 | 赋值=['T',[{'仪表盘3'},840]] | 范围=[[703,630,787,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 4 | 赋值=['T',[{'仪表盘4'},840]] | 范围=[[787,630,871,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 5 | 赋值=['T',[{'仪表盘5'},840]] | 范围=[[871,630,955,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 6 | 赋值=['T',[{'仪表盘6'},840]] | 范围=[[955,630,1039,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{跳转 | '道中作战2'}
)
[道中作战2]=(
//起始+135,后面+96
{点击 | ['T',378,710,50,'L',1]}
{移动 | [378,785,25,10]}
{移动 | [520,{'仪表盘1'},75,10]}
{移动 | [616,{'仪表盘2'},75,10]}
{移动 | [712,{'仪表盘3'},75,10]}
{移动 | [808,{'仪表盘4'},75,10]}
{移动 | [904,{'仪表盘5'},75,10]}
{移动 | [1000,{'仪表盘6'},75,10]}
{点击 | ['T',1149,779,50,'L',2]}
{按键 | ['ENTER',50]}
{延时 | 2000}
{重置计次 | '两回合'}
{跳转 | '仪表盘重新赋值'}
)
[道中技能检查3]=(
{移动 | [565,732,200,2]}
//+84
{延时 | 100}
{找图 | 1 | 赋值=['T',[{'仪表盘1'},840]] | 范围=[[492,630,576,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 2 | 赋值=['T',[{'仪表盘2'},840]] | 范围=[[576,630,660,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 3 | 赋值=['T',[{'仪表盘3'},840]] | 范围=[[660,630,744,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 4 | 赋值=['T',[{'仪表盘4'},840]] | 范围=[[744,630,828,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 5 | 赋值=['T',[{'仪表盘5'},840]] | 范围=[[828,630,912,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 6 | 赋值=['T',[{'仪表盘6'},840]] | 范围=[[912,630,996,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 7 | 赋值=['T',[{'仪表盘7'},840]] | 范围=[[996,630,1080,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{跳转 | '道中作战3'}
)
[道中作战3]=(
//起始+135,后面+96
{点击 | ['T',331,710,50,'L',1]}
{移动 | [331,785,25,10]}
{移动 | [466,{'仪表盘1'},75,10]}
{移动 | [562,{'仪表盘2'},75,10]}
{移动 | [658,{'仪表盘3'},75,10]}
{移动 | [754,{'仪表盘4'},75,10]}
{移动 | [850,{'仪表盘5'},75,10]}
{移动 | [946,{'仪表盘6'},75,10]}
{移动 | [1042,{'仪表盘7'},75,10]}
{点击 | ['T',1191,779,50,'L',2]}
{按键 | ['ENTER',50]}
{延时 | 2000}
{重置计次 | '两回合'}
{跳转 | '仪表盘重新赋值'}
)
[道中技能检查4]=(
{移动 | [611,732,200,2]}
//+84
{延时 | 100}
{找图 | 1 | 赋值=['T',[{'仪表盘1'},840]] | 范围=[[451,630,535,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 2 | 赋值=['T',[{'仪表盘2'},840]] | 范围=[[535,630,619,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 3 | 赋值=['T',[{'仪表盘3'},840]] | 范围=[[619,630,703,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 4 | 赋值=['T',[{'仪表盘4'},840]] | 范围=[[703,630,787,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 5 | 赋值=['T',[{'仪表盘5'},840]] | 范围=[[787,630,871,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 6 | 赋值=['T',[{'仪表盘6'},840]] | 范围=[[871,630,955,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 7 | 赋值=['T',[{'仪表盘7'},840]] | 范围=[[955,630,1039,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 8 | 赋值=['T',[{'仪表盘8'},840]] | 范围=[[1039,630,1123,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{跳转 | '道中作战4'}
)
[道中作战4]=(
//起始+135,后面+96
{点击 | ['T',283,710,50,'L',1]}
{移动 | [283,785,25,10]}
{移动 | [418,{'仪表盘1'},75,10]}
{移动 | [514,{'仪表盘2'},75,10]}
{移动 | [610,{'仪表盘3'},75,10]}
{移动 | [706,{'仪表盘4'},75,10]}
{移动 | [802,{'仪表盘5'},75,10]}
{移动 | [898,{'仪表盘6'},75,10]}
{移动 | [994,{'仪表盘7'},75,10]}
{移动 | [1090,{'仪表盘8'},75,10]}
{点击 | ['T',1239,779,50,'L',2]}
{按键 | ['ENTER',50]}
{延时 | 2000}
{重置计次 | '两回合'}
{跳转 | '仪表盘重新赋值'}
)
[道中技能检查5]=(
{移动 | [565,732,200,2]}
//+84
{延时 | 100}
{找图 | 道中作战 | 组=['F普通战斗'] | 范围=[[129,653,284,783]] | 图片=['道中作战2',60]}
{找图 | 1 | 赋值=['T',[{'仪表盘1'},840]] | 范围=[[408,630,492,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 2 | 赋值=['T',[{'仪表盘2'},840]] | 范围=[[492,630,576,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 3 | 赋值=['T',[{'仪表盘3'},840]] | 范围=[[576,630,660,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 4 | 赋值=['T',[{'仪表盘4'},840]] | 范围=[[660,630,744,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 5 | 赋值=['T',[{'仪表盘5'},840]] | 范围=[[744,630,828,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 6 | 赋值=['T',[{'仪表盘6'},840]] | 范围=[[828,630,912,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 7 | 赋值=['T',[{'仪表盘7'},840]] | 范围=[[912,630,996,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 8 | 赋值=['T',[{'仪表盘8'},840]] | 范围=[[996,630,1080,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 9 | 赋值=['T',[{'仪表盘9'},840]] | 范围=[[1080,630,1164,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{跳转 | '道中作战5'}
)
[道中作战5]=(
//起始+135,后面+96
{点击 | ['T',236,710,50,'L',1]}
{移动 | [236,785,25,10]}
{移动 | [371,{'仪表盘1'},75,10]}
{移动 | [467,{'仪表盘2'},75,10]}
{移动 | [563,{'仪表盘3'},75,10]}
{移动 | [659,{'仪表盘4'},75,10]}
{移动 | [755,{'仪表盘5'},75,10]}
{移动 | [851,{'仪表盘6'},75,10]}
{移动 | [947,{'仪表盘7'},75,10]}
{移动 | [1043,{'仪表盘8'},75,10]}
{移动 | [1139,{'仪表盘9'},75,10]}
{点击 | ['T',1288,779,50,'L',2]}
{按键 | ['ENTER',50]}
{重置计次 | '两回合'}
{延时 | 2000}
{跳转 | '仪表盘重新赋值'}
)
[道中技能检查6]=(
{移动 | [611,732,200,2]}
//+84
{延时 | 100}
{找图 | 1 | 赋值=['T',[{'仪表盘1'},840]] | 范围=[[367,630,451,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 2 | 赋值=['T',[{'仪表盘2'},840]] | 范围=[[451,630,535,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 3 | 赋值=['T',[{'仪表盘3'},840]] | 范围=[[535,630,619,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 4 | 赋值=['T',[{'仪表盘4'},840]] | 范围=[[619,630,703,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 5 | 赋值=['T',[{'仪表盘5'},840]] | 范围=[[703,630,787,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 6 | 赋值=['T',[{'仪表盘6'},840]] | 范围=[[787,630,871,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 7 | 赋值=['T',[{'仪表盘7'},840]] | 范围=[[871,630,955,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 8 | 赋值=['T',[{'仪表盘8'},840]] | 范围=[[955,630,1039,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 9 | 赋值=['T',[{'仪表盘9'},840]] | 范围=[[1039,630,1123,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 10 | 赋值=['T',[{'仪表盘10'},840]] | 范围=[[1123,630,1207,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{跳转 | '道中作战6'}
)
[道中作战6]=(
//起始+135,后面+96
{点击 | ['T',189,710,50,'L',1]}
{移动 | [189,785,25,10]}
{移动 | [324,{'仪表盘1'},75,10]}
{移动 | [420,{'仪表盘2'},75,10]}
{移动 | [516,{'仪表盘3'},75,10]}
{移动 | [612,{'仪表盘4'},75,10]}
{移动 | [708,{'仪表盘5'},75,10]}
{移动 | [804,{'仪表盘6'},75,10]}
{移动 | [900,{'仪表盘7'},75,10]}
{移动 | [996,{'仪表盘8'},75,10]}
{移动 | [1092,{'仪表盘9'},75,10]}
{移动 | [1188,{'仪表盘10'},75,10]}
{点击 | ['T',1337,779,50,'L',2]}
{按键 | ['ENTER',50]}
{延时 | 2000}
{重置计次 | '两回合'}
{跳转 | '仪表盘重新赋值'}
)
[道中技能检查7]=(
{移动 | [565,732,200,2]}
//+84
{延时 | 100}
{找图 | 1 | 赋值=['T',[{'仪表盘1'},840]] | 范围=[[292,630,408,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 2 | 赋值=['T',[{'仪表盘2'},840]] | 范围=[[408,630,492,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 3 | 赋值=['T',[{'仪表盘3'},840]] | 范围=[[492,630,576,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 4 | 赋值=['T',[{'仪表盘4'},840]] | 范围=[[576,630,660,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 5 | 赋值=['T',[{'仪表盘5'},840]] | 范围=[[660,630,744,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 6 | 赋值=['T',[{'仪表盘6'},840]] | 范围=[[744,630,828,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 7 | 赋值=['T',[{'仪表盘7'},840]] | 范围=[[828,630,912,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 8 | 赋值=['T',[{'仪表盘8'},840]] | 范围=[[912,630,996,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 9 | 赋值=['T',[{'仪表盘9'},840]] | 范围=[[996,630,1080,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 10 | 赋值=['T',[{'仪表盘10'},840]] | 范围=[[1080,630,1164,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 11 | 赋值=['T',[{'仪表盘11'},840]] | 范围=[[1164,630,1248,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{跳转 | '道中作战7'}
)
[道中作战7]=(
//起始+135,后面+96
{点击 | ['T',142,710,50,'L',1]}
{移动 | [142,785,25,10]}
{移动 | [277,{'仪表盘1'},75,10]}
{移动 | [373,{'仪表盘2'},75,10]}
{移动 | [469,{'仪表盘3'},75,10]}
{移动 | [565,{'仪表盘4'},75,10]}
{移动 | [661,{'仪表盘5'},75,10]}
{移动 | [757,{'仪表盘6'},75,10]}
{移动 | [853,{'仪表盘7'},75,10]}
{移动 | [949,{'仪表盘8'},75,10]}
{移动 | [1045,{'仪表盘9'},75,10]}
{移动 | [1141,{'仪表盘10'},75,10]}
{移动 | [1237,{'仪表盘11'},75,10]}
{点击 | ['T',1385,779,50,'L',2]}
{按键 | ['ENTER',50]}
{重置计次 | '两回合'}
{延时 | 2000}
{跳转 | '仪表盘重新赋值'}
)
[道中技能检查8]=(
{移动 | [611,732,200,2]}
//+84
{延时 | 100}
{找图 | 道中作战 | 组=['F普通战斗'] | 范围=[[34,648,197,788]] | 图片=['道中作战2',60]}
{找图 | 1 | 赋值=['T',[{'仪表盘1'},840]] | 范围=[[283,630,367,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 2 | 赋值=['T',[{'仪表盘2'},840]] | 范围=[[367,630,451,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 3 | 赋值=['T',[{'仪表盘3'},840]] | 范围=[[451,630,535,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 4 | 赋值=['T',[{'仪表盘4'},840]] | 范围=[[535,630,619,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 5 | 赋值=['T',[{'仪表盘5'},840]] | 范围=[[619,630,703,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 6 | 赋值=['T',[{'仪表盘6'},840]] | 范围=[[703,630,787,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 7 | 赋值=['T',[{'仪表盘7'},840]] | 范围=[[787,630,871,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 8 | 赋值=['T',[{'仪表盘8'},840]] | 范围=[[871,630,955,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 9 | 赋值=['T',[{'仪表盘9'},840]] | 范围=[[955,630,1039,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 10 | 赋值=['T',[{'仪表盘10'},840]] | 范围=[[1039,630,1123,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 11 | 赋值=['T',[{'仪表盘11'},840]] | 范围=[[1123,630,1207,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 12 | 赋值=['T',[{'仪表盘12'},840]] | 范围=[[1207,630,1291,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{跳转 | '道中作战8'}
)
[道中作战8]=(
//起始+135,后面+96
{点击 | ['T',93,710,50,'L',1]}
{移动 | [93,785,25,10]}
{移动 | [228,{'仪表盘1'},75,10]}
{移动 | [324,{'仪表盘2'},75,10]}
{移动 | [420,{'仪表盘3'},75,10]}
{移动 | [516,{'仪表盘4'},75,10]}
{移动 | [612,{'仪表盘5'},75,10]}
{移动 | [708,{'仪表盘6'},75,10]}
{移动 | [804,{'仪表盘7'},75,10]}
{移动 | [900,{'仪表盘8'},75,10]}
{移动 | [996,{'仪表盘9'},75,10]}
{移动 | [1092,{'仪表盘10'},75,10]}
{移动 | [1188,{'仪表盘11'},75,10]}
{移动 | [1284,{'仪表盘12'},75,10]}
{点击 | ['T',1385,779,50,'L',2]}
{按键 | ['ENTER',50]}
{计算 | [[{'拉条变量'},'-',1,{'拉条变量'},{'拉条变量'}]]}
{重置计次 | '两回合'}
{空参 | 确认次数 | 延时=200 | 计次=['T','确认次数',5,{组=['T次数过多问题检查']}]}
{延时 | 2000}
{跳转 | '仪表盘重新赋值'}
)
[仪表盘重新赋值]=(
{赋值 | [[{'仪表盘1'},710]]}
{赋值 | [[{'仪表盘2'},710]]}
{赋值 | [[{'仪表盘3'},710]]}
{赋值 | [[{'仪表盘4'},710]]}
{赋值 | [[{'仪表盘5'},710]]}
{赋值 | [[{'仪表盘6'},710]]}
{赋值 | [[{'仪表盘7'},710]]}
{赋值 | [[{'仪表盘8'},710]]}
{赋值 | [[{'仪表盘9'},710]]}
{赋值 | [[{'仪表盘10'},710]]}
{赋值 | [[{'仪表盘11'},710]]}
{赋值 | [[{'仪表盘12'},710]]}
{赋值 | [[{'自动拉条1'},0]]}
{赋值 | [[{'自动拉条2'},0]]}
{移动 | [1195,30,200,2]}
{跳至 | ['仪表盘重新赋值','2'] | 开关={'经验本开关'}}
{空参 | 1}
{跳转 | '道中检测A' | 开关={'经验本开关'}}
{跳转 | '道中检测A' | 开关={'拉条模式A'}}
{跳转 | '道中检测B' | 开关={'拉条模式B'}}
{空参 | 2}
{判断 | [[{'拉条变量'},'大于等于',{'斩击拉条回合'}],{跳转=['T经验本战斗中']}] | 开关={'斩击经验'}}
{判断 | [[{'拉条变量'},'大于等于',{'突刺拉条回合'}],{跳转=['T经验本战斗中']}] | 开关={'突刺经验'}}
{判断 | [[{'拉条变量'},'大于等于',{'打击拉条回合'}],{跳转=['T经验本战斗中']}] | 开关={'打击经验'}}
{跳至 | ['仪表盘重新赋值','1']}
)
[道中检测B]=(
{空参 | 正在运行TT2加速协议}
{找图 | 死亡重开 | 跳转=['T死亡重开'] | 范围=[[403,774,1587,897]] | 图片=['死亡重开',75] | 开关={'死亡重开'}}
{找图 | 战斗中标志 | 跳至=['T','道中检测B','开拉'] | 计算=['T',[{'拉条变量'},'+',1,{'拉条变量'}]] | 范围=[[1298,4,1594,160],[3,13,111,121]] | 图片=['战斗中标志','战斗中标志2','战斗中标志3','战斗中标志4',80]}

{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638]] | 图片=['重连','重连-中字',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{找图 | 加载条 | 跳转=['T战斗中识别'] | 范围=[[1409,326,1571,434]] | 图片=['加载条1','加载条2',70]}
{延时 | 200}
{找图 | 死亡重开 | 跳转=['T死亡重开'] | 范围=[[403,774,1587,897]] | 图片=['死亡重开',75] | 开关={'死亡重开'}}
{空参 | 两回合 | 计次=['T','两回合',250,{组=['T普通战斗']}]}
{跳至 | ['道中检测B','正在运行TT2加速协议']}

{空参 | 开拉}
{找图 | 1 | 判断=['T',[{'拉条变量'},'等于',1],{组=['T道中作战B1']}] | 范围=[[1298,4,1594,160],[3,13,111,121]] | 图片=['战斗中标志','战斗中标志2','战斗中标志3','战斗中标志4',80]}
{找图 | 2 | 判断=['T',[{'拉条变量'},'等于',2],{组=['T道中作战B2']}] | 范围=[[1298,4,1594,160],[3,13,111,121]] | 图片=['战斗中标志','战斗中标志2','战斗中标志3','战斗中标志4',80]}
{找图 | 3 | 判断=['T',[{'拉条变量'},'等于',3],{组=['T道中作战B3']}] | 范围=[[1298,4,1594,160],[3,13,111,121]] | 图片=['战斗中标志','战斗中标志2','战斗中标志3','战斗中标志4',80]}
{找图 | 4 | 判断=['T',[{'拉条变量'},'等于',4],{组=['T道中作战B4']}] | 范围=[[1298,4,1594,160],[3,13,111,121]] | 图片=['战斗中标志','战斗中标志2','战斗中标志3','战斗中标志4',80]}
{找图 | 5 | 判断=['T',[{'拉条变量'},'等于',5],{组=['T道中作战B5']}] | 范围=[[1298,4,1594,160],[3,13,111,121]] | 图片=['战斗中标志','战斗中标志2','战斗中标志3','战斗中标志4',80]}
{找图 | 6 | 判断=['T',[{'拉条变量'},'等于',6],{组=['T道中作战B6']}] | 范围=[[1298,4,1594,160],[3,13,111,121]] | 图片=['战斗中标志','战斗中标志2','战斗中标志3','战斗中标志4',80]}
{找图 | 7 | 判断=['T',[{'拉条变量'},'等于',7],{组=['T道中作战B7']}] | 范围=[[1298,4,1594,160],[3,13,111,121]] | 图片=['战斗中标志','战斗中标志2','战斗中标志3','战斗中标志4',80]}
{找图 | 8 | 判断=['T',[{'拉条变量'},'等于',8],{组=['T道中作战B8']}] | 范围=[[1298,4,1594,160],[3,13,111,121]] | 图片=['战斗中标志','战斗中标志2','战斗中标志3','战斗中标志4',80]}

)
[道中作战B1]=(
{点击 | ['T',440,710,50,'L',1]}
{移动 | [440,785,25,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘1'},840]] | 范围=[[548,670,616,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [550,{'仪表盘1'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘2'},840]] | 范围=[[641,670,712,756]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [650,{'仪表盘2'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘3'},840]] | 范围=[[741,670,807,755]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [740,{'仪表盘3'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘4'},840]] | 范围=[[829,670,898,744]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [830,{'仪表盘4'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘5'},840]] | 范围=[[926,670,989,748]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [930,{'仪表盘5'},75,10]}
{点击 | ['T',1085,779,50,'L',2]}
{按键 | ['ENTER',50]}
{延时 | 2000}
{重置计次 | '两回合'}
{跳转 | '仪表盘重新赋值'}
)
[道中作战B2]=(
{延时 | 200}
{点击 | ['T',400,710,50,'L',1]}
{移动 | [400,785,25,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘1'},840]] | 范围=[[510,670,575,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [520,{'仪表盘1'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘2'},840]] | 范围=[[615,670,675,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [615,{'仪表盘2'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘3'},840]] | 范围=[[710,670,775,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [710,{'仪表盘3'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘4'},840]] | 范围=[[805,670,865,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [805,{'仪表盘4'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘5'},840]] | 范围=[[900,670,960,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [900,{'仪表盘5'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘6'},840]] | 范围=[[995,670,1065,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [995,{'仪表盘6'},75,10] | 延时=40}
{点击 | ['T',1085,779,50,'L',2]}
{按键 | ['ENTER',50]}
{延时 | 2000}
{重置计次 | '两回合'}
{跳转 | '仪表盘重新赋值'}
)
[道中作战B3]=(
{延时 | 200}
{点击 | ['T',340,710,50,'L',1]}
{移动 | [340,785,25,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘1'},840]] | 范围=[[470,670,520,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [470,{'仪表盘1'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘2'},840]] | 范围=[[560,670,620,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [565,{'仪表盘2'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘3'},840]] | 范围=[[660,670,710,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [660,{'仪表盘3'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘4'},840]] | 范围=[[755,670,805,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [755,{'仪表盘4'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘5'},840]] | 范围=[[850,670,900,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [850,{'仪表盘5'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘6'},840]] | 范围=[[945,670,995,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [945,{'仪表盘6'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘7'},840]] | 范围=[[1040,670,1090,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [1040,{'仪表盘7'},75,10] | 延时=40}
{点击 | ['T',1166,779,50,'L',2]}
{按键 | ['ENTER',50]}
{延时 | 2000}
{重置计次 | '两回合'}
{跳转 | '仪表盘重新赋值'}
)
[道中作战B4]=(
{延时 | 200}
{点击 | ['T',305,710,50,'L',1]}
{移动 | [305,785,25,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘1'},840]] | 范围=[[425,670,475,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [425,{'仪表盘1'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘2'},840]] | 范围=[[520,670,570,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [520,{'仪表盘2'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘3'},840]] | 范围=[[615,670,665,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [615,{'仪表盘3'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘4'},840]] | 范围=[[710,670,760,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [710,{'仪表盘4'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘5'},840]] | 范围=[[805,670,855,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [805,{'仪表盘5'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘6'},840]] | 范围=[[895,670,970,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [895,{'仪表盘6'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘7'},840]] | 范围=[[990,670,1070,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [990,{'仪表盘7'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘8'},840]] | 范围=[[1085,670,1170,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [1085,{'仪表盘8'},75,10] | 延时=40}
{点击 | ['T',1200,779,50,'L',2]}
{按键 | ['ENTER',50]}
{延时 | 2000}
{重置计次 | '两回合'}
{跳转 | '仪表盘重新赋值'}
)
[道中作战B5]=(
{延时 | 200}
{找图 | 道中作战 | 组=['F普通战斗'] | 范围=[[129,653,284,783]] | 图片=['道中作战2',60]}
{延时 | 200}
{点击 | ['T',261,714,50,'L',1]}
{移动 | [261,785,25,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘1'},840]] | 范围=[[380,670,430,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [380,{'仪表盘1'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘2'},840]] | 范围=[[475,670,525,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [475,{'仪表盘2'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘3'},840]] | 范围=[[570,670,620,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [570,{'仪表盘3'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘4'},840]] | 范围=[[665,670,715,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [665,{'仪表盘4'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘5'},840]] | 范围=[[760,670,810,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [760,{'仪表盘5'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘6'},840]] | 范围=[[855,670,905,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [855,{'仪表盘6'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘7'},840]] | 范围=[[950,670,1000,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [950,{'仪表盘7'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘8'},840]] | 范围=[[1045,670,1095,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [1045,{'仪表盘8'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘9'},840]] | 范围=[[1140,670,1190,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [1140,{'仪表盘9'},75,10] | 延时=40}
{点击 | ['T',1267,779,50,'L',2]}
{按键 | ['ENTER',50]}
{延时 | 2000}
{重置计次 | '两回合'}
{跳转 | '仪表盘重新赋值'}
)
[道中作战B6]=(
{延时 | 200}
{点击 | ['T',210,713,50,'L',1]}
{移动 | [210,785,25,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘1'},840]] | 范围=[[330,670,380,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [330,{'仪表盘1'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘2'},840]] | 范围=[[425,670,475,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [425,{'仪表盘2'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘3'},840]] | 范围=[[520,670,570,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [520,{'仪表盘3'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘4'},840]] | 范围=[[615,670,665,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [615,{'仪表盘4'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘5'},840]] | 范围=[[710,670,760,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [710,{'仪表盘5'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘6'},840]] | 范围=[[805,670,866,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [805,{'仪表盘6'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘7'},840]] | 范围=[[900,670,950,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [900,{'仪表盘7'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘8'},840]] | 范围=[[95,670,10745,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [995,{'仪表盘8'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘9'},840]] | 范围=[[1090,670,1140,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [1090,{'仪表盘9'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘10'},840]] | 范围=[[1185,670,1235,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [1185,{'仪表盘10'},75,10] | 延时=40}
{点击 | ['T',1310,779,50,'L',2]}
{按键 | ['ENTER',50]}
{延时 | 2000}
{重置计次 | '两回合'}
{跳转 | '仪表盘重新赋值'}
)
[道中作战B7]=(
{延时 | 200}
{点击 | ['T',160,710,50,'L',1]}
{移动 | [160,785,25,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘1'},840]] | 范围=[[285,670,335,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [285,{'仪表盘1'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘2'},840]] | 范围=[[380,670,430,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [380,{'仪表盘2'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘3'},840]] | 范围=[[475,670,525,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [475,{'仪表盘3'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘4'},840]] | 范围=[[570,670,620,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [570,{'仪表盘4'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘5'},840]] | 范围=[[665,670,715,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [665,{'仪表盘5'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘6'},840]] | 范围=[[760,670,810,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [760,{'仪表盘6'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘7'},840]] | 范围=[[855,670,905,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [855,{'仪表盘7'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘8'},840]] | 范围=[[950,670,1000,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [950,{'仪表盘8'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘9'},840]] | 范围=[[1045,670,1095,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [1045,{'仪表盘9'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘10'},840]] | 范围=[[1140,670,1285,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [1140,{'仪表盘10'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘11'},840]] | 范围=[[1235,670,1380,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [1235,{'仪表盘11'},75,10] | 延时=40}
{点击 | ['T',1370,779,50,'L',2]}
{按键 | ['ENTER',50]}
{延时 | 2000}
{重置计次 | '两回合'}
{跳转 | '仪表盘重新赋值'}
)
[道中作战B8]=(
{延时 | 200}
{找图 | 道中作战 | 组=['F普通战斗'] | 范围=[[34,648,197,788]] | 图片=['道中作战2',60]}
{延时 | 200}
{点击 | ['T',112,710,50,'L',1]}
{移动 | [112,785,25,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘1'},840]] | 范围=[[230,670,280,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [230,{'仪表盘1'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘2'},840]] | 范围=[[325,670,375,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [325,{'仪表盘2'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘3'},840]] | 范围=[[420,670,470,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [420,{'仪表盘3'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘4'},840]] | 范围=[[515,670,565,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [515,{'仪表盘4'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘5'},840]] | 范围=[[610,670,660,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [610,{'仪表盘5'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘6'},840]] | 范围=[[705,670,755,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [705,{'仪表盘6'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘7'},840]] | 范围=[[800,670,850,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [800,{'仪表盘7'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘8'},840]] | 范围=[[895,670,945,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [895,{'仪表盘8'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘9'},840]] | 范围=[[990,670,1040,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [990,{'仪表盘9'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘10'},840]] | 范围=[[1085,670,1135,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [1085,{'仪表盘10'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘11'},840]] | 范围=[[1180,670,1275,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [1180,{'仪表盘11'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘12'},840]] | 范围=[[1280,670,1330,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [1280,{'仪表盘12'},75,10] | 延时=40}
{点击 | ['T',1410,779,50,'L',2]}
{按键 | ['ENTER',50]}
{延时 | 2000}
{计算 | [[{'拉条变量'},'-',1,{'拉条变量'},{'拉条变量'}]]}
{重置计次 | '两回合'}
{空参 | 确认次数 | 延时=200 | 计次=['T','确认次数',5,{组=['T次数过多问题检查']}]}
{跳转 | '仪表盘重新赋值'}
)
[▰▰▰▰▰▰[道中EGO使用]▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰]=(
{跳出 | 'TF'}
)
[道中拉条战斗中释放ego]=(
{组 | '第一回合使用EGO'}
{跳出 | 'TF'}
)
[第一回合使用EGO]=(
{点击 | [550,825,50] | 延时=100}
{点击 | [650,825,50] | 延时=100}
{点击 | [750,825,50] | 延时=100}
{点击 | [850,825,50] | 延时=100}
{点击 | [950,825,50] | 延时=100}
{赋值 | [[{'第五层释放ego'},1]]}
{赋值 | [[{'仪表盘1'},840]]}
{赋值 | [[{'仪表盘2'},840]]}
{赋值 | [[{'仪表盘3'},840]]}
{赋值 | [[{'仪表盘4'},840]]}
{赋值 | [[{'仪表盘5'},840]]}
{组 | '战斗释放特定EGO'}
{赋值 | [[{'第五层释放ego'},0]]}

{组 | '道中作战1'}
)
[▰▰▰▰▰▰[异想体事件处理]▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰]=(
{跳出 | 'TF'}
)
[问号]=(

{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{找图 | 问号 | 组=['F事件结束'] | 范围=[[364,40,514,155]] | 图片=['问号','问号2',85]}

{找图 | 商店 | 组=['T商店'] | 范围=[[248,115,670,443]] | 图片=['商店',75]}
//{跳转|'问号'}
//skip
{点击 | [752,384,50] | 延时=50}
{点击 | [752,384,50] | 延时=50}
{点击 | [752,384,50] | 延时=400}
{组 | '特殊异想体事件'}
//选第一个选项
{点击 | [1390,267,50] | 延时=100}
//选第二个选项
{点击 | [1390,367,50] | 延时=100}
{空参 | 按钮}

{找图 | 服务器加载 | 循环=['T',999,100] | 范围=[[1250,22,1575,158]] | 图片=['加载中',85]}
{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{延时 | 300}

{找图 | 通用确认 | 点击=['T',0,0,500,'2L'] | 延时=100 | 范围=[[419,125,1568,871]] | 图片=['确认','确认-中字1','确认-中字2','确认1','确认2',85]}
{找色 | 红按钮 | 点击=['T',1506,826,50] | 延时=500 | 范围=[[1144,604,1597,897]] | 颜色=['#A93625','-1,15,#AB3521/166,2,#973022/166,17,#8F2E20',70]}
{找图 | 服务器加载 | 循环=['T',999,100] | 范围=[[1250,22,1575,158]] | 图片=['加载中',85]}
{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}

{找图 | 问号 | 组=['F事件结束'] | 范围=[[364,40,514,155]] | 图片=['问号','问号2',85]}
//skip
{点击 | [752,384,50] | 延时=50}
{点击 | [752,384,50] | 延时=50}
{点击 | [752,384,50] | 延时=50}
{点击 | [752,384,50] | 延时=50}
{点击 | [752,384,50] | 延时=400}
{找图 | 投硬币 | 组=['T投硬币'] | 延时=50 | 范围=[[1111,4,1349,215]] | 图片=['投硬币','投硬币2',85]}

{找图 | 通用确认 | 点击=['T',0,0,500,'2L'] | 延时=100 | 范围=[[419,125,1568,871]] | 图片=['确认','确认-中字1','确认-中字2','确认1','确认2',85]}
{找色 | 红按钮 | 点击=['T',1506,826,50] | 延时=500 | 范围=[[1144,604,1597,897]] | 颜色=['#A93625','-1,15,#AB3521/166,2,#973022/166,17,#8F2E20',70]}
{找图 | 服务器加载 | 循环=['T',999,100] | 范围=[[1250,22,1575,158]] | 图片=['加载中',85]}
{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{跳转 | '事件结束'}
)
[事件结束]=(
//流程完成一次之后的检查
{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{找图 | 问号 | 组=['T问号'] | 重置计次=['T','确认次数'] | 范围=[[364,40,514,155]] | 图片=['问号','问号2',85]}
{找图 | 地图界面 | 组=['T地图界面'] | 重置计次=['T','确认次数'] | 范围=[[1423,11,1587,173]] | 图片=['地图界面','地图界面2','地图界面3',75]}
{找图 | 战斗中标志 | 组=['T战斗中标志'] | 重置计次=['T','确认次数'] | 范围=[[1298,4,1594,160]] | 图片=['战斗中标志','战斗中标志2','战斗中标志3',85]}
{找图 | 战斗选人 | 组=['T战斗选人'] | 重置计次=['T','确认次数'] | 范围=[[1342,118,1500,238]] | 图片=['战斗选人','战斗选人2','战斗选人3',70]}
{找图 | EGO礼物选择 | 组=['TEGO礼物选择'] | 重置计次=['T','确认次数'] | 范围=[[996,601,1562,825]] | 图片=['EGO礼物选择','EGO礼物选择2',85]}
{找图 | 战斗报酬选择 | 组=['T战斗报酬选择'] | 重置计次=['T','确认次数'] | 范围=[[259,26,994,237]] | 图片=['战斗报酬选择','战斗报酬选择-中字1','战斗报酬选择-中字2','不跳过报酬获取-中字1',85]}
{空参 | 确认次数 | 延时=200 | 计次=['T','确认次数',10,{组=['T次数过多问题检查']}]}
//改动
{跳转 | '事件结束'}
)
[投硬币]=(
//判定
{找图 | 非常高 | 点击=['T',0,0,50] | 偏移=[0,50] | 组=['F投硬币2'] | 延时=500 | 范围=[[7,705,1586,895]] | 图片=['非常高','高','普通','低','非常低','非常高-中字','高-中字','普通-中字','低-中字','非常低-中字',75]}
{找图 | 事件-员工证 | 赋值=['T',[{'反转'},1]] | 范围=[[263,169,542,372]] | 图片=['事件-员工证',85]}
{找图 | 非常低 | 点击=['T',0,0,50] | 偏移=[0,50] | 组=['F投硬币2'] | 延时=500 | 范围=[[7,705,1586,895]] | 图片=['非常低','低','普通','高','非常高','非常低-中字','低-中字','普通-中字','高-中字','非常高-中字',75] | 开关={'反转'}}

{找色 | 红按钮 | 点击=['T',1506,826,50] | 延时=200 | 范围=[[1144,604,1577,867]] | 颜色=['#A93625','-1,15,#AB3521/166,2,#973022/166,17,#8F2E20',70]}

{找图 | 服务器加载 | 循环=['T',999,100] | 范围=[[1250,22,1575,158]] | 图片=['加载中',85]}
{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{找图 | 判定 | 循环=['F',43,100] | 范围=[[1034,541,1290,678]] | 图片=['判定结束1','判定结束2',85]}
//skip
{点击 | [752,384,50] | 延时=100}
{点击 | [752,384,50] | 延时=100}
{点击 | [752,384,50] | 延时=700}

{找图 | 非常高 | 点击=['T',0,0,50] | 偏移=[0,50] | 组=['F投硬币2'] | 延时=500 | 范围=[[7,705,1586,895]] | 图片=['非常高','高','普通','低','非常低','非常高-中字','高-中字','普通-中字','低-中字','非常低-中字',70]}
{找图 | 非常低 | 点击=['T',0,0,50] | 偏移=[0,50] | 组=['F投硬币2'] | 延时=500 | 范围=[[7,705,1586,895]] | 图片=['非常低','低','普通','高','非常高','非常低-中字','低-中字','普通-中字','高-中字','非常高-中字',70] | 开关={'反转'}}
{赋值 | [[{'反转'},0]]}
{跳出 | 'TF'}
)
[投硬币2]=(
//选第一个人
//{点击|[100,800,50]|延时=100}
//选第二个人
//{点击|[200,800,50]|延时=100}
//选第三个人
//{点击|[300,800,50]|延时=100}
//选第四个人
//{点击|[400,800,50]|延时=100}
//选第五个人
//{点击|[480,800,50]|延时=100}
//选第六个人
//{点击|[580,800,50]|延时=100}
//选第七个人
//{点击|[680,800,50]|延时=100}
//选第八个人
//{点击|[760,800,50]|延时=100}
//选第九个人
//{点击|[860,800,50]|延时=100}
//选第十个人
//{点击|[960,800,50]|延时=100}
//选第十一个人
//{点击|[1060,800,50]|延时=100}
//选第十二个人
//{点击|[1160,800,50]|延时=100}
{找色 | 红按钮 | 点击=['T',1506,826,50] | 延时=500 | 范围=[[1144,604,1597,897]] | 颜色=['#A93625','-1,15,#AB3521/166,2,#973022/166,17,#8F2E20',70]}
{找图 | 服务器加载 | 循环=['T',999,100] | 范围=[[1250,22,1575,158]] | 图片=['加载中',85]}
{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{跳至 | ['投硬币2','战斗'] | 开关={'战斗问号'}}
{跳出 | 'TF'}
{空参 | 战斗}
{赋值 | [[{'战斗问号'},0]]}
{找图 | 纽 | 组=['F纽本战斗中'] | 范围=[[364,40,514,155]] | 图片=['问号','问号2',85] | 开关={'纽本开关'}}
{找图 | 困难 | 组=['F困难战斗'] | 范围=[[364,40,514,155]] | 图片=['问号','问号2',85] | 开关={'困难战斗'}}
{找图 | 普通 | 组=['F普通战斗'] | 范围=[[364,40,514,155]] | 图片=['问号','问号2',85]}
{跳出 | 'TF'}
)


[战斗问号]=(
{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{找图 | 问号 | 跳出='F' | 延时=50 | 范围=[[364,40,514,155]] | 图片=['问号','问号2',85]}
//skip
{点击 | [752,384,50] | 延时=40}
{点击 | [752,384,50] | 延时=40}
{点击 | [752,384,50] | 延时=40}
{点击 | [752,384,50] | 延时=40}
{点击 | [752,384,50] | 延时=40}
{点击 | [752,384,50] | 延时=1000}
{赋值 | [[{'战斗问号'},1]]}
{找图 | 投硬币 | 组=['T投硬币'] | 延时=50 | 范围=[[1111,4,1349,215]] | 图片=['投硬币','投硬币2',85]}

{组 | '特殊异想体事件'}
//选第一个选项
{点击 | [1390,267,50] | 延时=50}
//选第二个选项
{点击 | [1390,367,50] | 延时=50}
//skip
{点击 | [752,384,50] | 延时=50}
{点击 | [752,384,50] | 延时=50}
{点击 | [752,384,50] | 延时=410}

{找色 | 红按钮 | 点击=['T',1506,826,50] | 延时=500 | 范围=[[1144,604,1597,897]] | 颜色=['#A93625','-1,15,#AB3521/166,2,#973022/166,17,#8F2E20',70]}
{找图 | 服务器加载 | 循环=['T',999,100] | 范围=[[1250,22,1575,158]] | 图片=['加载中',85]}
{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{找图 | 投硬币 | 组=['T投硬币'] | 延时=50 | 范围=[[1111,4,1349,215]] | 图片=['投硬币','投硬币2',85]}
{跳出 | 'TF'}
)
//改动
[特殊异想体事件]=(
{找图 | 事件-浸染棉花 | 点击=['T',1068,556,50] | 跳至=['T','问号','按钮'] | 延时=100 | 范围=[[40,39,835,453]] | 图片=['事件-浸染棉花',85]}
{找图 | 事件-遗骸碎片 | 点击=['T',1068,556,50] | 跳至=['T','问号','按钮'] | 延时=100 | 范围=[[40,39,835,453]] | 图片=['事件-遗骸碎片',85]}
{找图 | 事件-卡蜜拉 | 点击=['T',1147,397,50] | 跳至=['T','问号','按钮'] | 延时=100 | 范围=[[40,39,835,453]] | 图片=['事件-卡蜜拉',85]}
{找图 | 事件-雷击木 | 点击=['T',1135,379,50] | 跳至=['T','问号','按钮'] | 延时=100 | 范围=[[40,39,835,453]] | 图片=['事件-雷击木',85]}
{找图 | 事件-冬夜梦 | 点击=['T',1135,379,50] | 跳至=['T','问号','按钮'] | 延时=100 | 范围=[[40,39,835,453]] | 图片=['事件-冬夜梦',85]}
{找图 | 事件-跳舞鸡 | 点击=['T',1135,379,50] | 跳至=['T','问号','按钮'] | 延时=100 | 范围=[[40,39,835,453]] | 图片=['事件-跳舞鸡',85]}
{找图 | 事件-时间缰绳 | 点击=['T',1135,379,50] | 跳至=['T','问号','按钮'] | 延时=100 | 范围=[[40,39,835,453]] | 图片=['事件-时间缰绳',85]}
{找图 | 事件-星象盘碎片 | 点击=['T',1135,220,50] | 跳至=['T','问号','按钮'] | 延时=100 | 范围=[[40,39,835,453]] | 图片=['事件-星象盘碎片',90]}
{找图 | 事件-受缚之王 | 点击=['T',1135,379,50] | 跳至=['T','问号','按钮'] | 延时=100 | 范围=[[40,39,835,453]] | 图片=['事件-受缚之王',75]}
{找图 | 事件-傻逼研究员2 | 点击=['T',1183,477,50] | 延时=100 | 范围=[[40,39,835,453]] | 图片=['事件-傻逼研究员',75]}
{找图 | 事件-傻逼研究员3 | 点击=['T',1110,600,50] | 跳至=['T','问号','按钮'] | 延时=100 | 范围=[[40,39,835,453]] | 图片=['事件-傻逼研究员',75]}
{组 | '异想体事件第一个选项'}
{组 | '异想体事件第二个选项'}
{组 | '异想体事件第三个选项'}
{跳出 | 'TF'}
)
[异想体事件第一个选项]=(
{找图 | 事件战斗 | 跳出='T' | 范围=[[842,208,1472,357]] | 图片=['事件战斗','事件战斗2',70]}
{找图 | EGO礼物获取 | 点击=['T',0,0,50] | 跳至=['T','问号','按钮'] | 延时=100 | 范围=[[842,208,1472,357]] | 图片=['EGO礼物获取','EGO礼物获取2',60]}
{跳出 | 'TF'}
)
[异想体事件第二个选项]=(
{找图 | 事件战斗 | 跳出='T' | 范围=[[859,345,1469,501]] | 图片=['事件战斗','事件战斗2',70]}
{找图 | EGO礼物获取 | 点击=['T',0,0,50] | 跳至=['T','问号','按钮'] | 延时=100 | 范围=[[859,345,1469,501]] | 图片=['EGO礼物获取','EGO礼物获取2',60]}
{找图 | 强化终止 | 点击=['T',0,0,50] | 跳至=['T','问号','按钮'] | 延时=100 | 范围=[[824,338,1380,497]] | 图片=['强化终止','强化终止-中字',85]}
{跳出 | 'TF'}
)
[异想体事件第三个选项]=(
{找图 | 事件战斗 | 跳出='T' | 范围=[[852,485,1467,642]] | 图片=['事件战斗','事件战斗2',70]}
{找图 | EGO礼物获取 | 点击=['T',0,0,50] | 跳至=['T','问号','按钮'] | 延时=100 | 范围=[[852,485,1467,642]] | 图片=['EGO礼物获取','EGO礼物获取2',60]}
{跳出 | 'TF'}
)
[▰▰▰▰▰▰[商店各楼层功能生效]▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰]=(
{跳出 | 'TF'}
)

[商店各楼层功能生效]=(
{赋值 | [[{'饰品升级'},0]]}
{赋值 | [[{'饰品合成'},0]]}
{赋值 | [[{'饰品购买'},0]]}
{组 | '中途楼层判断' | 开关={'中途楼层判断'}}
{判断 | [[{'第一层'},'等于',1],{组=['T第一层商店']}]}
{判断 | [[{'第二层'},'等于',1],{组=['T第二层商店']}]}
{判断 | [[{'第三层'},'等于',1],{组=['T第三层商店']}]}
{判断 | [[{'第四层'},'等于',1],{组=['T第四层商店']}]}
{判断 | [[{'第五层'},'等于',1],{组=['T第五层商店']}]}
{跳出 | 'TF'}
)
[第一层商店]=(
{赋值 | [[{'饰品升级'},1]] | 开关={'升级-第一层'}}
{赋值 | [[{'饰品合成'},1]] | 开关={'合成-第一层'}}
{赋值 | [[{'饰品购买'},1]] | 开关={'购买-第一层'}}
{跳出 | 'TF'}
)
[第二层商店]=(
{赋值 | [[{'饰品升级'},1]] | 开关={'升级-第二层'}}
{赋值 | [[{'饰品合成'},1]] | 开关={'合成-第二层'}}
{赋值 | [[{'饰品购买'},1]] | 开关={'购买-第二层'}}
{跳出 | 'TF'}
)
[第三层商店]=(
{赋值 | [[{'饰品升级'},1]] | 开关={'升级-第三层'}}
{赋值 | [[{'饰品合成'},1]] | 开关={'合成-第三层'}}
{赋值 | [[{'饰品购买'},1]] | 开关={'购买-第三层'}}
{跳出 | 'TF'}
)
[第四层商店]=(
{赋值 | [[{'饰品升级'},1]] | 开关={'升级-第四层'}}
{赋值 | [[{'饰品合成'},1]] | 开关={'合成-第四层'}}
{赋值 | [[{'饰品购买'},1]] | 开关={'购买-第四层'}}
{跳出 | 'TF'}
)
[第五层商店]=(
{赋值 | [[{'饰品升级'},1]] | 开关={'升级-第五层'}}
{赋值 | [[{'饰品合成'},1]] | 开关={'合成-第五层'}}
{赋值 | [[{'饰品购买'},1]] | 开关={'购买-第五层'}}
{跳出 | 'TF'}
)
[▰▰▰▰▰▰[商店处理]▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰]=(
{跳出 | 'TF'}
)
[商店]=(
{计算 | [[{'第一层'},'+',{'第二层'},{'层数变量'}]]}
{计算 | [[{'第三层'},'+',{'层数变量'},{'层数变量'}]]}
{计算 | [[{'第四层'},'+',{'层数变量'},{'层数变量'}]]}
{计算 | [[{'第五层'},'+',{'层数变量'},{'层数变量'}]]}

{组 | '商店各楼层功能生效'}
{按键 | ['F12',50] | 开关={'商店截图'}}

{找图 | 编成 | 点击=['T',1130,411,50] | 延时=100 | 范围=[[956,139,1036,182]] | 图片=['编成',85]}
{找图 | 月之记忆 | 点击=['T',0,0,50] | 延时=300 | 组=['T购买确认'] | 按键=['T','F12',50] | 范围=[[667,241,1464,642]] | 图片=['商店-月之记忆1',85]}
{找图 | 技能组 | 点击=['T',780,310,50] | 组=['T技能组'] | 延时=300 | 范围=[[674,358,880,439]] | 图片=[{'技能组1'},{'技能组2'},{'技能组3'},{'技能组4'},{'技能组5'},{'技能组6'},85] | 开关={'商店技能组'}}
{跳至 | ['商店','唉'] | 开关={'第一层'}}
{跳至 | ['商店','唉'] | 开关={'第二层'}}
{跳至 | ['商店','唉'] | 开关={'第三层'}}
{赋值 | [[{'困难战斗'},1]] | 开关={'镜本困难'}}
{空参 | 唉}
{组 | '升级EGO礼物' | 开关={'取消商店'}}
{组 | '商店回血判断' | 开关={'商店回血'}}
{空参 | 喵}
//没弄好,先注释了
//注释此条以完全禁用不合成公式四级对商店的改动,合成时依旧不合成公式四级
{计算 | [[{'四级饰品合成'},'+',{'不合成公式四级'},{'合成用变量'}]]}

{判断 | [[{'合成用变量'},'等于',2],{组=['T商店2']}]}
{空参 | 合成}
{组 | '四级饰品合成' | 开关={'四级饰品合成'}}
{空参 | 升级}
{组 | '升级EGO礼物' | 开关={'饰品升级'}}


{空参 | 买}
{组 | '退出商店' | 开关={'取消商店'}}

{组 | '商店坐标' | 开关={'饰品购买'}}
{组 | '退出商店'}
{跳出 | 'TF'}
)

[商店2]=(
{判断 | [[{'层数变量'},'小于',1],{赋值=['T',[{'没合成完'},1]]}]}
{赋值 | [[{'没合成完'},1]] | 开关={'第一层'}}
{跳出 | 'TF'}
)
[技能组]=(
{找图 | 技能交换 | 跳出='F' | 延时=100 | 范围=[[813,86,994,202]] | 图片=['技能交换',85]}
{点击 | [385,420,50] | 延时=150 | 开关={'一换二'}}
{点击 | [828,427,50] | 延时=150 | 开关={'二换三'}}
{点击 | [1203,430,50] | 延时=150 | 开关={'一换三'}}
{点击 | [996,664,50] | 延时=500}
{点击 | [996,664,50] | 延时=500}
{找图 | 技能交换 | 点击=['T',752,91,50] | 延时=100 | 范围=[[813,86,994,202]] | 图片=['技能交换',85]}
{找图 | 服务器加载 | 循环=['T',999,100] | 范围=[[1250,22,1575,158]] | 图片=['加载中',85]}
{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{跳出 | 'TF'}
)
[商店回血判断]=(
{找图 | 回过了 | 跳出='T' | 范围=[[931,324,1221,414]] | 图片=['回复完了1','回复完了2',80]}

{找图 | 商店回血1 | 组=['F商店回血'] | 范围=[[84,823,111,857]] | 图片=['商店血量1','商店血量2',80]}
{找图 | 商店回血2 | 组=['F商店回血'] | 范围=[[176,823,209,857]] | 图片=['商店血量1','商店血量2',80]}
{找图 | 商店回血3 | 组=['F商店回血'] | 范围=[[278,823,306,857]] | 图片=['商店血量1','商店血量2',80]}
{找图 | 商店回血4 | 组=['F商店回血'] | 范围=[[375,823,400,857]] | 图片=['商店血量1','商店血量2',80]}
{找图 | 商店回血5 | 组=['F商店回血'] | 范围=[[462,823,496,857]] | 图片=['商店血量1','商店血量2',80]}
{找图 | 商店回血6 | 组=['F商店回血'] | 范围=[[565,823,591,857]] | 图片=['商店血量1','商店血量2',80]}
{找图 | 商店回血7 | 组=['F商店回血'] | 范围=[[656,823,689,857]] | 图片=['商店血量1','商店血量2',80]}
{找图 | 商店回血8 | 组=['F商店回血'] | 范围=[[754,823,786,857]] | 图片=['商店血量1','商店血量2',80]}
{找图 | 商店回血9 | 组=['F商店回血'] | 范围=[[852,823,883,857]] | 图片=['商店血量1','商店血量2',80]}
{找图 | 商店回血11 | 组=['F商店回血'] | 范围=[[949,823,977,857]] | 图片=['商店血量1','商店血量2',80]}
{找图 | 商店回血12 | 组=['F商店回血'] | 范围=[[1043,823,1074,857]] | 图片=['商店血量1','商店血量2',80]}
{找图 | 商店回血13 | 组=['F商店回血'] | 范围=[[1143,823,1171,857]] | 图片=['商店血量1','商店血量2',80]}
{跳出 | 'TF'}
)

[商店回血]=(
{点击 | [255,600,50] | 延时=500}
{点击 | [1174,417,50] | 延时=500}
{找图 | 服务器加载 | 循环=['T',999,100] | 范围=[[1250,22,1575,158]] | 图片=['加载中',85]}
{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{点击 | [748,383,50] | 延时=300}
{点击 | [1208,586,50] | 延时=300}
{找色 | 红按钮 | 点击=['T',1506,826,50] | 延时=500 | 范围=[[1144,604,1597,897]] | 颜色=['#A93625','-1,15,#AB3521/166,2,#973022/166,17,#8F2E20',70]}
{按键 | ['ENTER',50]}
{找图 | 地图界面 | 组=['T地图界面'] | 范围=[[1423,11,1587,173]] | 图片=['地图界面','地图界面2','地图界面3',85]}
{找图 | 商店 | 跳至=['T','商店','喵'] | 范围=[[248,115,670,443]] | 图片=['商店',75]}
{跳出 | 'TF'}
)
[▰▰▰▰▰▰[饰品购买]▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰]=(
{跳出 | 'TF'}
)
[商店坐标]=(
//{赋值|[[{'商店范围坐标X1'},683],[{'商店范围坐标Y1'},237],[{'商店范围坐标X2'},876],[{'商店范围坐标Y2'},430]]}
{赋值 | [[{'商店范围坐标X1'},490],[{'商店范围坐标Y1'},237],[{'商店范围坐标X2'},683],[{'商店范围坐标Y2'},450]]}
{组 | '商店坐标X'}
{跳出 | 'TF'}
)
[商店坐标X]=(
{赋值 | [[{'脏东西'},0]]}
{赋值 | [[{'买过了'},0]]}
{计算 | [[{'商店范围坐标X1'},'+',194,{'商店范围坐标X1'}]]}
{计算 | [[{'商店范围坐标X2'},'+',194,{'商店范围坐标X2'}]]}
{计算 | [[{'坐标X'},'+',1,{'坐标X'}]]}
{判断 | [[{'坐标X'},'等于',5],{组=['T商店坐标Y']}]}
{找图 | 白树棉 | 赋值=['T',[{'脏东西'},1]] | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['商店-白树棉1','商店-白树棉2',85]}
{找图 | 已购买 | 赋值=['T',[{'买过了'},1]] | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['商店-已购买','商店-已购买-中字','商店-已购买2','商店-已购买3',65]}
{找图 | 钱不够 | 组=['T退出商店'] | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['商店-钱不够3','商店-钱不够2','商店-钱不够','商店-钱不够-中字',75]}
{组 | '商店坐标X' | 开关={'脏东西'}}
{组 | '商店坐标X' | 开关={'买过了'}}
{组 | '购买饰品'}
{组 | '商店坐标X'}
)
[商店坐标Y]=(
{计算 | [[{'商店范围坐标Y1'},'+',213,{'商店范围坐标Y1'}]]}
{计算 | [[{'商店范围坐标Y2'},'+',213,{'商店范围坐标Y2'}]]}
{赋值 | [[{'商店范围坐标X1'},490],[{'商店范围坐标X2'},683]]}
{找色 | 超级商店 | 赋值=['F',[{'超级商店'},0]] | 范围=[[1262,541,1454,652]] | 颜色=['#5A3C24','21,15,#4A331E',80]}
{计算 | [[{'坐标Y'},'+',1,{'坐标Y'}]]}
{赋值 | [[{'坐标X'},0]]}
{判断 | [[{'超级商店'},'等于',0],{计算=['T',[{'坐标X'},'+',3,{'坐标X'}]] | 赋值=['T',[{'超级商店'},1]]}]}
{判断 | [[{'坐标Y'},'等于',2],{组=['T商店刷新']}] | 开关={'商店刷新'}}
{组 | '商店坐标X' | 开关={'商店刷新'}}
{判断 | [[{'坐标Y'},'等于',2],{组=['T退出商店']}]}
{组 | '商店坐标X'}
)
[购买饰品]=(
{赋值 | [[{'选择三级'},0]]}
{找图 | 技能组 | 点击=['T',780,310,50] | 组=['T技能组'] | 延时=300 | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=[{'技能组1'},{'技能组2'},{'技能组3'},{'技能组4'},{'技能组5'},{'技能组6'},85] | 开关={'商店技能组'}}
//购买优先级
{组 | '购买饰品2' | 开关={'物理优先'}}
//{找图|没有饰品2|跳出='T'|延时=1000|范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]]|图片=['没有饰品2',85]}

{找图 | 月之记忆 | 点击=['T',0,0,50] | 延时=300 | 组=['T购买确认'] | 范围=[[667,241,1464,642]] | 图片=['商店-月之记忆1',85]}
{找图 | 炎鳞 | 点击=['T',0,0,50] | 延时=300 | 组=['T购买确认'] | 范围=[[667,241,1464,642]] | 图片=['商店-炎鳞1',85] | 开关={'烧伤'}}
//!!没截到{找图|红染棉花|点击=['T',0,0,50]|延时=300|组=['T购买确认']|赋值=['T',[{'未命名开关1'},1]]|范围=[[667,241,1464,642]]|图片=['商店-红染棉花1',85]|开关={'流血'}}
//!!没截到{找图|暴雨|点击=['T',0,0,50]|延时=300|组=['T购买确认']|赋值=['T',[{'未命名开关1'},1]]|范围=[[667,241,1464,642]]|图片=['商店-暴雨1',85]|开关={'震颤'}}
{找图 | 快感 | 点击=['T',0,0,50] | 延时=300 | 组=['T购买确认'] | 范围=[[667,241,1464,642]] | 图片=['商店-快感',85] | 开关={'破裂'}}
{找图 | 美感 | 点击=['T',0,0,50] | 延时=300 | 组=['T购买确认'] | 范围=[[667,241,1464,642]] | 图片=['商店-美感1',85] | 开关={'沉沦'}}
//!!没截到{找图|明镜止水|点击=['T',0,0,50]|延时=300|组=['T购买确认']|赋值=['T',[{'未命名开关1'},1]]|范围=[[667,241,1464,642]]|图片=['商店-明镜止水1',85]|开关={'呼吸'}}
{找图 | 充能式手套 | 点击=['T',0,0,50] | 延时=300 | 组=['T购买确认'] | 范围=[[667,241,1464,642]] | 图片=['商店-充能式手套1',85] | 开关={'充能'}}

{找图 | 雷击木 | 点击=['T',0,0,50] | 延时=300 | 组=['T购买确认'] | 范围=[[667,241,1464,642]] | 图片=['商店-雷击木1',85] | 开关={'破裂'}}

//!!没截到{找图|卡蜜拉/探戈鸡酱料|点击=['T',{'商店范围坐标X1'},{'商店范围坐标Y1'},50]|偏移=[100,68]|组=['T购买确认']|延时=300|范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]]|图片=['商店-卡蜜拉1','商店-卡蜜拉2','商店-探戈鸡酱料1','商店-探戈鸡酱料2',85]}
//锐利针线未截取
{找图 | 锐利的针与线/朱红蛾群 | 点击=['T',{'商店范围坐标X1'},{'商店范围坐标Y1'},50] | 偏移=[100,68] | 组=['T购买确认'] | 延时=300 | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['商店-锐利的针与线1','商店-锐利的针与线2','商店-朱红蛾群1','商店-朱红蛾群2',85]}
{找图 | 锈蚀的纪念币/幻痛 | 点击=['T',{'商店范围坐标X1'},{'商店范围坐标Y1'},50] | 偏移=[100,68] | 组=['T购买确认'] | 延时=300 | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['商店-锈蚀的纪念币1','商店-锈蚀的纪念币2','商店-幻痛1','商店-幻痛2',85]}
{找图 | 特别合约/膏血 | 点击=['T',{'商店范围坐标X1'},{'商店范围坐标Y1'},50] | 偏移=[100,68] | 组=['T购买确认'] | 延时=300 | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['商店-特别合约1','商店-特别合约2','商店-膏血1','商店-膏血2',85]}


//抓三级合四级
{找图 | 三级 | 判断=['T',[{'合成用变量'},'等于',2],{赋值=['T',[{'选择三级'},1]]}] | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['商店-三级','商店-四级',85] | 开关={'没合成完'}}
{找图 | 三级 | 点击=['T',0,0,50] | 组=['T购买确认'] | 延时=300 | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['商店-三级','商店-四级',85] | 开关={'选择三级'}}

{判断 | [[{'经济类'},'等于',0],{跳至=['T','购买饰品','经济']}]}
{找图 | 贪婪之锤/生存的里程标 | 点击=['T',{'商店范围坐标X1'},{'商店范围坐标Y1'},50] | 偏移=[100,68] | 组=['T购买确认'] | 延时=300 | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['商店-贪婪之锤1','商店-贪婪之锤2','商店-生存的里程标1','商店-生存的里程标2',85] | 开关={'经济类'}}
{找图 | 金瓮/返利礼券 | 点击=['T',{'商店范围坐标X1'},{'商店范围坐标Y1'},50] | 偏移=[100,68] | 组=['T购买确认'] | 延时=300 | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['商店-金瓮1','商店-金瓮2','商店-返利礼券1','商店-返利礼券2',85] | 开关={'经济类'}}
{找图 | 新品小册/提前预约优惠券 | 点击=['T',{'商店范围坐标X1'},{'商店范围坐标Y1'},50] | 偏移=[100,68] | 组=['T购买确认'] | 延时=300 | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['商店-新品小册1','商店-新品小册2','商店-提前预约优惠券1','商店-提前预约优惠券2',85] | 开关={'经济类'}}
{找图 | 翻新的商品/声望卡 | 点击=['T',{'商店范围坐标X1'},{'商店范围坐标Y1'},50] | 偏移=[100,68] | 组=['T购买确认'] | 延时=300 | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['商店-翻新的商品1','商店-翻新的商品2','商店-声望卡1','商店-声望卡2',85] | 开关={'经济类'}}
//{找图|特别目录/体验型规划指南|点击=['T',{'商店范围坐标X1'},{'商店范围坐标Y1'},50]|偏移=[100,68]|组=['T购买确认']|延时=300|范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]]|图片=['商店-特别目录1','商店-特别目录2','商店-体验型规划指南1','商店-体验型规划指南2',85]|开关={'经济类'}}
{空参 | 经济}

{判断 | [[{'回复类'},'等于',0],{跳至=['T','购买饰品','回复']}]}
{找图 | 止痛药/石版字符 | 点击=['T',{'商店范围坐标X1'},{'商店范围坐标Y1'},50] | 偏移=[100,68] | 组=['T购买确认'] | 延时=300 | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['商店-止痛药1','商店-止痛药2','商店-石版字符1','商店-石版字符2',85] | 开关={'回复类'}}
{找图 | 采血包/便携式急救包 | 点击=['T',{'商店范围坐标X1'},{'商店范围坐标Y1'},50] | 偏移=[100,68] | 组=['T购买确认'] | 延时=300 | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['商店-采血包1','商店-采血包','商店-便携式急救包1','商店-便携式急救包2',85] | 开关={'回复类'}}
{找图 | 归途 | 点击=['T',{'商店范围坐标X1'},{'商店范围坐标Y1'},50] | 偏移=[100,68] | 组=['T购买确认'] | 延时=300 | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['商店-归途1','商店-归途2',85] | 开关={'回复类'}}
//{找图|灰色大衣/偏见|点击=['T',{'商店范围坐标X1'},{'商店范围坐标Y1'},50]|偏移=[100,68]|组=['T购买确认']|延时=300|范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]]|图片=['商店-灰色大衣1','商店-灰色大衣2','商店-偏见1','商店-偏见2',85]|开关={'回复类'}}
//{找图|重叠的创可贴|点击=['T',{'商店范围坐标X1'},{'商店范围坐标Y1'},50]|偏移=[100,68]|组=['T购买确认']|延时=300|范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]]|图片=['商店-重叠的创可贴1','商店-重叠的创可贴2',85]|开关={'回复类'}}
{空参 | 回复}

{判断 | [[{'资源类'},'等于',0],{跳至=['T','购买饰品','资源']}]}
{找图 | 盛情款待/瓶中婴孩 | 点击=['T',{'商店范围坐标X1'},{'商店范围坐标Y1'},50] | 偏移=[100,68] | 组=['T购买确认'] | 延时=300 | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['商店-盛情款待1','商店-盛情款待2','商店-瓶中婴孩1','商店-瓶中婴孩2',85] | 开关={'资源类'}}
{找图 | 蓝色芝宝牌打火机 | 点击=['T',{'商店范围坐标X1'},{'商店范围坐标Y1'},50] | 偏移=[100,68] | 组=['T购买确认'] | 延时=300 | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['商店-蓝色芝宝牌打火机1','商店-蓝色芝宝牌打火机2',85] | 开关={'资源类'}}
//{找图|咖啡与纸鹤/神谕|点击=['T',{'商店范围坐标X1'},{'商店范围坐标Y1'},50]|偏移=[100,68]|组=['T购买确认']|延时=300|范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]]|图片=['商店-咖啡与纸鹤1','商店-咖啡与纸鹤2','商店-神谕1','商店-神谕2',85]|开关={'资源类'}}
//{找图|倒错症/星象盘碎片|点击=['T',{'商店范围坐标X1'},{'商店范围坐标Y1'},50]|偏移=[100,68]|组=['T购买确认']|延时=300|范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]]|图片=['商店-倒错症1','商店-倒错症2','商店-星象盘碎片1','商店-星象盘碎片2',85]|开关={'资源类'}}
{空参 | 资源}

{找图 | 烧伤 | 点击=['T',0,0,50] | 组=['T购买确认'] | 延时=300 | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['烧伤标识-商店',80] | 开关={'烧伤'}}
{找图 | 流血 | 点击=['T',0,0,50] | 组=['T购买确认'] | 延时=300 | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['流血标识-商店',80] | 开关={'流血'}}
{找图 | 震颤 | 点击=['T',0,0,50] | 组=['T购买确认'] | 延时=300 | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['震颤标识-商店',80] | 开关={'震颤'}}
{找图 | 破裂 | 点击=['T',0,0,50] | 组=['T购买确认'] | 延时=300 | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['破裂标识-商店',80] | 开关={'破裂'}}
{找图 | 沉沦 | 点击=['T',0,0,50] | 组=['T购买确认'] | 延时=300 | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['沉沦标识-商店',80] | 开关={'沉沦'}}
{找图 | 呼吸 | 点击=['T',0,0,50] | 组=['T购买确认'] | 延时=300 | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['呼吸标识-商店',80] | 开关={'呼吸'}}
{找图 | 充能 | 点击=['T',0,0,50] | 组=['T购买确认'] | 延时=300 | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['充能标识-商店',80] | 开关={'充能'}}
{找图 | 斩击 | 点击=['T',0,0,50] | 组=['T购买确认'] | 延时=300 | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['斩击标识-商店',80] | 开关={'斩击'}}
{找图 | 突刺 | 点击=['T',0,0,50] | 组=['T购买确认'] | 延时=300 | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['突刺标识-商店',80] | 开关={'突刺'}}
{找图 | 打击 | 点击=['T',0,0,50] | 组=['T购买确认'] | 延时=300 | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['打击标识-商店',80] | 开关={'打击'}}
{跳转 | '商店坐标X'}
)

[购买饰品2]=(
{找图 | 斩击 | 点击=['T',0,0,50] | 组=['T购买确认'] | 延时=300 | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['斩击标识-商店',85] | 开关={'斩击'}}
{找图 | 突刺 | 点击=['T',0,0,50] | 组=['T购买确认'] | 延时=300 | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['突刺标识-商店',85] | 开关={'突刺'}}
{找图 | 打击 | 点击=['T',0,0,50] | 组=['T购买确认'] | 延时=300 | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['打击标识-商店',85] | 开关={'打击'}}
)


[商店刷新]=(
{找图 | 商店-钱不够 | 组=['T退出商店'] | 范围=[[662,236,1480,642]] | 图片=['商店-钱不够','商店-钱不够-中字','商店-钱不够2','商店-钱不够3',65]}

{判断 | [[{'商店刷新次数'},'小于等于',{'商店已刷新次数'}],{组=['T退出商店']}]}
{点击 | [1250,150,50] | 延时=300 | 开关={'经费刷新'}}
{点击 | [1420,150,50] | 延时=500 | 开关={'定向刷新'}}
{组 | '定向刷新' | 开关={'定向刷新'}}
{空参 | 确认刷新 | 点击=[980,700,50] | 延时=500 | 开关={'定向刷新'}}
{计算 | [[{'商店已刷新次数'},'+',1,{'商店已刷新次数'}]]}
{赋值 | [[{'坐标X'},0],[{'坐标Y'},0]]}
{移动 | [1200,10,200,2]}
{找图 | 服务器加载 | 循环=['T',999,100] | 范围=[[1250,22,1575,158]] | 图片=['加载中',85]}
{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}

{按键 | ['F12',50] | 开关={'商店截图'}}

{组 | '商店坐标'}
{组 | '商店刷新'}
{跳出 | 'TF'}
)

[定向刷新]=(
{组 | '定向刷新2' | 开关={'物理优先'}}
{跳出 | 'TF' | 开关={'物理优先'}}
//{找图|商店刷新-烧伤|点击=['T',0,0,50]|组=['T定向刷新3']|延时=1000|范围=[[290,254,1293,652]]|图片=['大烧伤标识',85]|开关={'烧伤'}}
//{找图|商店刷新-流血|点击=['T',0,0,50]|组=['T定向刷新3']|延时=1000|范围=[[290,254,1293,652]]|图片=['大流血标识',85]|开关={'流血'}}
//{找图|商店刷新-震颤|点击=['T',0,0,50]|组=['T定向刷新3']|延时=1000|范围=[[290,254,1293,652]]|图片=['大震颤标识',85]|开关={'震颤'}}
//{找图|商店刷新-破裂|点击=['T',0,0,50]|组=['T定向刷新3']|延时=1000|范围=[[290,254,1293,652]]|图片=['大破裂标识',85]|开关={'破裂'}}
//{找图|商店刷新-沉沦|点击=['T',0,0,50]|组=['T定向刷新3']|延时=1000|范围=[[290,254,1293,652]]|图片=['大沉沦标识',85]|开关={'沉沦'}}
//{找图|商店刷新-呼吸|点击=['T',0,0,50]|组=['T定向刷新3']|延时=1000|范围=[[290,254,1293,652]]|图片=['大呼吸标识',85]|开关={'呼吸'}}
//{找图|商店刷新-充能|点击=['T',0,0,50]|组=['T定向刷新3']|延时=1000|范围=[[290,254,1293,652]]|图片=['大充能标识',85]|开关={'充能'}}
{空参 | 商店刷新-烧伤 | 点击=['T',400,350,50] | 延时=500 | 跳出='T' | 开关={'烧伤'}}
{空参 | 商店刷新-流血 | 点击=['T',600,350,50] | 延时=500 | 跳出='T' | 开关={'流血'}}
{空参 | 商店刷新-震颤 | 点击=['T',800,350,50] | 延时=500 | 跳出='T' | 开关={'震颤'}}
{空参 | 商店刷新-破裂 | 点击=['T',1000,350,50] | 延时=500 | 跳出='T' | 开关={'破裂'}}
{空参 | 商店刷新-沉沦 | 点击=['T',1200,350,50] | 延时=500 | 跳出='T' | 开关={'沉沦'}}
{空参 | 商店刷新-呼吸 | 点击=['T',400,550,50] | 延时=500 | 跳出='T' | 开关={'呼吸'}}
{空参 | 商店刷新-充能 | 点击=['T',600,550,50] | 延时=500 | 跳出='T' | 开关={'充能'}}
{跳出 | 'TF'}
)
[定向刷新2]=(
//{找图|商店刷新-斩击|点击=['T',0,0,50]|组=['T定向刷新3']|延时=1000|范围=[[290,254,1293,652]]|图片=['大斩击标识',85]|开关={'斩击'}}
//{找图|商店刷新-突刺|点击=['T',0,0,50]|组=['T定向刷新3']|延时=1000|范围=[[290,254,1293,652]]|图片=['大突刺标识',85]|开关={'突刺'}}
//{找图|商店刷新-打击|点击=['T',0,0,50]|组=['T定向刷新3']|延时=1000|范围=[[290,254,1293,652]]|图片=['大打击标识',85]|开关={'打击'}}
{空参 | 商店刷新-斩击 | 点击=['T',800,550,50] | 延时=500 | 跳出='T' | 开关={'斩击'}}
{空参 | 商店刷新-突刺 | 点击=['T',1000,550,50] | 延时=500 | 跳出='T' | 开关={'突刺'}}
{空参 | 商店刷新-打击 | 点击=['T',1200,550,50] | 延时=500 | 跳出='T' | 开关={'打击'}}
{跳出 | 'TF'}
)

[购买确认]=(
//确认
{延时 | 200}
{找图 | 礼物购入 | 点击=['T',0,0,50] | 延时=500 | 范围=[[535,387,1101,710]] | 图片=['礼物购入',75]}
{找图 | 服务器加载 | 循环=['T',999,100] | 范围=[[1250,22,1575,158]] | 图片=['加载中',85]}
{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{找图 | 通用确认 | 点击=['T',0,0,50] | 延时=500 | 范围=[[419,125,1568,871]] | 图片=['确认','确认-中字1','确认-中字2','确认2',85]}
{找图 | 服务器加载 | 循环=['T',999,100] | 范围=[[1250,22,1575,158]] | 图片=['加载中',85]}
{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
//{空参|wow|赋值=['TF',[{'未命名开关1'},0]]|跳出='TF'|开关={'未命名开关1'}}
{组 | '商店坐标X'}
{跳出 | 'TF'}
)

[退出商店]=(
{赋值 | [[{'商店已刷新次数'},0]]}
{赋值 | [[{'坐标X'},0],[{'坐标Y'},0]]}
{点击 | [800,50,50] | 延时=100}
{找色 | 红按钮 | 点击=['T',1506,826,50] | 延时=500 | 范围=[[1144,604,1597,897]] | 颜色=['#A93625','-1,15,#AB3521/166,2,#973022/166,17,#8F2E20',60]}
//{找图|通用确认|点击=['T',0,0,50]|延时=500|范围=[[419,125,1568,871]]|图片=['确认','确认-中字1','确认-中字2','确认2',85]}
{比色 | 确认 | 点击=['T',958,608,50] | 延时=100 | 颜色=['1020,616,#C9AD8B',85]}
{按键 | ['ENTER',50]}
{延时 | 500}
{找图 | 服务器加载 | 循环=['T',999,100] | 范围=[[1250,22,1575,158]] | 图片=['加载中',85]}
{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{跳转 | '镜本'}
)
[▰▰▰▰▰▰[饰品升级]▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰]=(
{跳出 | 'TF'}
)
[升级EGO礼物]=(
{判断 | [[{'初始礼物升级完毕'},'等于',1],{组=['T退出商店']}] | 开关={'取消商店'}}
{延时 | 300}
{点击 | [200,490,50] | 延时=300}
{移动 | [1045,10,200,2]}

{跳至 | ['升级EGO礼物','其他礼物'] | 开关={'初始礼物升级完毕'}}
//开局礼物升级
{空参 | 第一个}
//{找色|初始礼物|点击=['T',0,0,50]|组=['T升级EGO礼物2']|延时=1000|范围=[[804,272,904,376]]|颜色=['#3C281B','53,-60,#3F2B1E',90]}
//{找色|初始礼物|点击=['T',0,0,50]|组=['T升级EGO礼物2']|延时=1000|范围=[[911,270,1022,382]]|颜色=['#3C281B','53,-60,#3F2B1E',90]}
{点击 | [849,325,50] | 延时=150}
{空参 | 初始礼物 | 点击=['TF',849,325,50] | 延时=100 | 组=['T升级EGO礼物2']}
{空参 | 第二个}
//{找图|礼物升级-开局|点击=['T',0,0,50]|组=['T升级EGO礼物2']|延时=1000|范围=[[911,270,1022,382]]|图片=['礼物升级-开局',75]}
//{找图|礼物升级-开局|点击=['T',0,0,50]|组=['T升级EGO礼物2']|延时=1000|范围=[[911,270,1022,382]]|图片=[困难战斗'礼物升级-开局',75]}
{点击 | [967,312,50] | 延时=150 | 开关={'星之恩惠4'}}
{空参 | 初始礼物 | 点击=['TF',967,312,50] | 延时=100 | 组=['T升级EGO礼物2'] | 开关={'星之恩惠4'}}
{判断 | [[{'星之恩惠4'},'等于',1],{跳至=['T','升级EGO礼物','呜']}]}
{点击 | [967,312,50] | 延时=150 | 开关={'星之恩惠10'}}
{空参 | 初始礼物 | 点击=['TF',967,312,50] | 延时=100 | 组=['T升级EGO礼物2'] | 开关={'星之恩惠10'}}

{空参 | 呜}
{赋值 | [[{'初始礼物升级完毕'},1]]}
{空参 | 其他礼物}
{找图 | 升级-炎鳞 | 点击=['T',0,0,50] | 延时=150 | 判断=['T',[{'合成用变量'},'等于',2],{赋值=['T',[{'合成完了'},1],[{'没合成完'},0]]}] | 组=['T升级EGO礼物2'] | 范围=[[777,226,1408,657]] | 图片=['升级-炎鳞',80] | 开关={'烧伤'}}
{找图 | 升级-快感 | 点击=['T',0,0,50] | 延时=150 | 判断=['T',[{'合成用变量'},'等于',2],{赋值=['T',[{'合成完了'},1],[{'没合成完'},0]]}] | 组=['T升级EGO礼物2'] | 范围=[[777,226,1408,657]] | 图片=['升级-快感',80] | 开关={'破裂'}}
{找图 | 升级-雷击木 | 点击=['T',0,0,50] | 延时=150 | 组=['T升级EGO礼物2'] | 范围=[[777,226,1408,657]] | 图片=['升级-雷击木',80] | 开关={'破裂'}}
{找图 | 升级-破伞 | 点击=['T',0,0,50] | 延时=150 | 组=['T升级EGO礼物2'] | 范围=[[777,226,1408,657]] | 图片=['升级-破伞',80] | 开关={'破裂'}}

{组 | '退出升级页面' | 开关={'取消商店'}}
{空参 | 呜呜}
{找图 | 升级卡密拉 | 点击=['T',0,0,50] | 延时=150 | 组=['T升级EGO礼物2'] | 范围=[[749,214,1431,672]] | 图片=['升级卡密拉',85]}
{找图 | 升级卡密拉2 | 点击=['T',0,0,50] | 延时=150 | 组=['T升级EGO礼物2'] | 范围=[[749,214,1431,672]] | 图片=['升级卡密拉2',85]}
{赋值 | [[{'升级范围坐标X1'},795],[{'升级范围坐标Y1'},272],[{'升级范围坐标X2'},909],[{'升级范围坐标Y2'},384]]}
{赋值 | [[{'升级范围坐标X1'},909],[{'升级范围坐标Y1'},272],[{'升级范围坐标X2'},1023],[{'升级范围坐标Y2'},384]] | 开关={'星之恩惠4'}}
{赋值 | [[{'升级范围坐标X1'},909],[{'升级范围坐标Y1'},272],[{'升级范围坐标X2'},1023],[{'升级范围坐标Y2'},384]] | 开关={'星之恩惠10'}}
{组 | '升级坐标X'}

{空参 | 喵}
{重置计次 | '空'}
{赋值 | [[{'坐标X'},0],[{'坐标Y'},0]]}

{组 | '退出升级页面' | 开关={'镜本普通'}}
{找图 | 翻页条 | 组=['F退出升级页面'] | 范围=[[1348,238,1443,655]] | 图片=['翻页条',75] | 开关={'镜本困难'}}

{点击 | ['T',1394,287,50,'L',1]}
{点击 | ['T',1394,601,50,'L',2]}
{延时 | 200}
{赋值 | [[{'升级范围坐标X1'},681],[{'升级范围坐标Y1'},325],[{'升级范围坐标X2'},795],[{'升级范围坐标Y2'},437]]}

{找图 | 升级-炎鳞 | 点击=['T',0,0,50] | 延时=100 | 判断=['T',[{'合成用变量'},'等于',2],{赋值=['T',[{'合成完了'},1],[{'没合成完'},0]]}] | 组=['T升级EGO礼物2'] | 范围=[[768,225,1425,667]] | 图片=['升级-炎鳞',85] | 开关={'烧伤'}}
{找图 | 升级-快感 | 点击=['T',0,0,50] | 延时=100 | 判断=['T',[{'合成用变量'},'等于',2],{赋值=['T',[{'合成完了'},1],[{'没合成完'},0]]}] | 组=['T升级EGO礼物2'] | 范围=[[768,225,1425,667]] | 图片=['升级-快感',85] | 开关={'破裂'}}
{组 | '升级坐标X'}

{空参 | 喵喵}

{找图 | 升级卡密拉 | 点击=['T',0,0,50] | 组=['T升级EGO礼物2'] | 延时=100 | 范围=[[749,214,1431,672]] | 图片=['升级卡密拉',85]}
{找图 | 升级卡密拉2 | 点击=['T',0,0,50] | 组=['T升级EGO礼物2'] | 延时=100 | 范围=[[749,214,1431,672]] | 图片=['升级卡密拉2',85]}
//{找图|升级-巫毒娃娃|点击=['T',0,0,50]|组=['T升级EGO礼物2']|延时=100|范围=[[749,214,1431,672]]|图片=['升级-巫毒娃娃',85]}
{组 | '退出升级页面'}
)
[升级坐标X]=(
//{延时|100}
{计算 | [[{'升级范围坐标X1'},'+',117,{'升级范围坐标X1'}]]}
{计算 | [[{'升级范围坐标X2'},'+',117,{'升级范围坐标X2'}]]}
{计算 | [[{'坐标X'},'+',1,{'坐标X'}]]}
{判断 | [[{'坐标X'},'等于',6],{组=['T升级坐标Y']}]}
{比色 | 没钱升级 | 组=['T退出升级页面'] | 延时=1000 | 颜色=['1325,136,#970000/1329,134,#970000',90]}
{找图 | 已升级 | 组=['T升级坐标X'] | 范围=[[{'升级范围坐标X1'},{'升级范围坐标Y1'},{'升级范围坐标X2'},{'升级范围坐标Y2'}]] | 图片=['已升级',65]}
{找图 | 没有饰品 | 组=['T退出升级页面'] | 范围=[[{'升级范围坐标X1'},{'升级范围坐标Y1'},{'升级范围坐标X2'},{'升级范围坐标Y2'}]] | 图片=['没有饰品',85]}
{组 | '升级EGO礼物3'}
{组 | '升级坐标X'}
)
[升级坐标Y]=(
{计算 | [[{'升级范围坐标Y1'},'+',112,{'升级范围坐标Y1'}]]}
{计算 | [[{'升级范围坐标Y2'},'+',112,{'升级范围坐标Y2'}]]}
{赋值 | [[{'升级范围坐标X1'},800],[{'升级范围坐标X2'},906]]}

{计算 | [[{'坐标Y'},'+',1,{'坐标Y'}]]}
{赋值 | [[{'坐标X'},0]]}
{判断 | [[{'坐标Y'},'等于',3],{跳至=['T','升级EGO礼物','喵喵']}] | 开关={'第二页'}}
{组 | '升级EGO礼物3' | 开关={'第二页'}}
{组 | '升级坐标X' | 开关={'第二页'}}
{判断 | [[{'坐标Y'},'等于',3],{跳至=['T','升级EGO礼物','喵'] | 赋值=['T',[{'第二页'},1]]}]}
{组 | '升级EGO礼物3'}
{组 | '升级坐标X'}
)
[升级EGO礼物2]=(
//点击升级按钮
//{找色|没钱|组=['T退出升级页面']|延时=500|范围=[[1158,98,1397,167]]|颜色=['#970000','0,6,#970000/-4,24,#970000',88]}
//{找图|没钱|组=['T退出升级页面']|范围=[[477,602,715,703]]|图片=['没钱',95]}
//{点击|[993,731,50]|延时=500}
{延时 | 50}
{按键 | ['ENTER',50]}
{延时 | 300}
{找图 | 强化不可 | 跳出='T' | 范围=[[1142,20,1526,177]] | 图片=['强化不可','强化不可-中字',75]}
{找图 | 没钱 | 组=['T退出升级页面'] | 范围=[[477,602,715,703]] | 图片=['没钱',95]}

{按键 | ['ENTER',50]}
{延时 | 100}
{找图 | 服务器加载 | 循环=['T',999,100] | 范围=[[1250,22,1575,158]] | 图片=['加载中',85]}
{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{延时 | 100}

{按键 | ['ENTER',50]}
{延时 | 300}
{找图 | 强化不可 | 跳出='T' | 范围=[[1142,20,1526,177]] | 图片=['强化不可','强化不可-中字',75]}
{找图 | 没钱 | 组=['T退出升级页面'] | 范围=[[477,602,715,703]] | 图片=['没钱',95]}

{按键 | ['ENTER',50]}
{延时 | 100}
{找图 | 服务器加载 | 循环=['T',999,100] | 范围=[[1250,22,1575,158]] | 图片=['加载中',85]}
{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{空参 | 确认}
{找图 | 强化不可 | 跳出='T' | 范围=[[1142,20,1526,177]] | 图片=['强化不可','强化不可-中字',75]}
{找图 | 没钱 | 组=['T退出升级页面'] | 范围=[[477,602,715,703]] | 图片=['没钱',95]}

{跳出 | 'TF'}
)
[升级EGO礼物3]=(
{找图 | 礼物升级-烧伤 | 点击=['T',0,0,50] | 偏移=[-40,-40] | 组=['T升级EGO礼物2'] | 延时=250 | 范围=[[{'升级范围坐标X1'},{'升级范围坐标Y1'},{'升级范围坐标X2'},{'升级范围坐标Y2'}]] | 图片=['礼物升级-烧伤','礼物升级-烧伤2',85] | 开关={'烧伤'}}
{找图 | 礼物升级-流血 | 点击=['T',0,0,50] | 偏移=[-40,-40] | 组=['T升级EGO礼物2'] | 延时=250 | 范围=[[{'升级范围坐标X1'},{'升级范围坐标Y1'},{'升级范围坐标X2'},{'升级范围坐标Y2'}]] | 图片=['礼物升级-流血','礼物升级-流血2',85] | 开关={'流血'}}
{找图 | 礼物升级-震颤 | 点击=['T',0,0,50] | 偏移=[-40,-40] | 组=['T升级EGO礼物2'] | 延时=250 | 范围=[[{'升级范围坐标X1'},{'升级范围坐标Y1'},{'升级范围坐标X2'},{'升级范围坐标Y2'}]] | 图片=['礼物升级-震颤','礼物升级-震颤2',85] | 开关={'震颤'}}
{找图 | 礼物升级-破裂 | 点击=['T',0,0,50] | 偏移=[-40,-40] | 组=['T升级EGO礼物2'] | 延时=250 | 范围=[[{'升级范围坐标X1'},{'升级范围坐标Y1'},{'升级范围坐标X2'},{'升级范围坐标Y2'}]] | 图片=['礼物升级-破裂','礼物升级-破裂2',85] | 开关={'破裂'}}
{找图 | 礼物升级-沉沦 | 点击=['T',0,0,50] | 偏移=[-40,-40] | 组=['T升级EGO礼物2'] | 延时=250 | 范围=[[{'升级范围坐标X1'},{'升级范围坐标Y1'},{'升级范围坐标X2'},{'升级范围坐标Y2'}]] | 图片=['礼物升级-沉沦','礼物升级-沉沦2',85] | 开关={'沉沦'}}
{找图 | 礼物升级-呼吸 | 点击=['T',0,0,50] | 偏移=[-40,-40] | 组=['T升级EGO礼物2'] | 延时=250 | 范围=[[{'升级范围坐标X1'},{'升级范围坐标Y1'},{'升级范围坐标X2'},{'升级范围坐标Y2'}]] | 图片=['礼物升级-呼吸','礼物升级-呼吸2',85] | 开关={'呼吸'}}
{找图 | 礼物升级-充能 | 点击=['T',0,0,50] | 偏移=[-40,-40] | 组=['T升级EGO礼物2'] | 延时=250 | 范围=[[{'升级范围坐标X1'},{'升级范围坐标Y1'},{'升级范围坐标X2'},{'升级范围坐标Y2'}]] | 图片=['礼物升级-充能','礼物升级-充能2',85] | 开关={'充能'}}
{找图 | 礼物升级-斩击 | 点击=['T',0,0,50] | 偏移=[-40,-40] | 组=['T升级EGO礼物2'] | 延时=250 | 范围=[[{'升级范围坐标X1'},{'升级范围坐标Y1'},{'升级范围坐标X2'},{'升级范围坐标Y2'}]] | 图片=['礼物升级-斩击','礼物升级-斩击2',85] | 开关={'斩击'}}
{找图 | 礼物升级-突刺 | 点击=['T',0,0,50] | 偏移=[-40,-40] | 组=['T升级EGO礼物2'] | 延时=250 | 范围=[[{'升级范围坐标X1'},{'升级范围坐标Y1'},{'升级范围坐标X2'},{'升级范围坐标Y2'}]] | 图片=['礼物升级-突刺','礼物升级-突刺2',85] | 开关={'突刺'}}
{找图 | 礼物升级-打击 | 点击=['T',0,0,50] | 偏移=[-40,-40] | 组=['T升级EGO礼物2'] | 延时=250 | 范围=[[{'升级范围坐标X1'},{'升级范围坐标Y1'},{'升级范围坐标X2'},{'升级范围坐标Y2'}]] | 图片=['礼物升级-打击','礼物升级-打击2',85] | 开关={'打击'}}
{跳出 | 'TF'}
)
[退出升级页面]=(
{赋值 | [[{'第二页'},0]]}
{赋值 | [[{'坐标X'},0],[{'坐标Y'},0]]}
{点击 | [614,727,50] | 延时=300}
{点击 | [614,727,50] | 延时=300}
{找图 | 战斗中标志 | 组=['T战斗中标志'] | 范围=[[1298,4,1594,160],[3,13,111,121]] | 图片=['战斗中标志','战斗中标志2','战斗中标志3','战斗中标志4',80]}
{找图 | 地图界面 | 组=['T地图界面'] | 范围=[[1423,11,1587,173]] | 图片=['地图界面','地图界面2','地图界面3',75]}

{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{空参 | 确认次数 | 延时=200 | 计次=['T','确认次数',30,{组=['T次数过多问题检查']}]}
{找图 | 商店 | 组=['F退出升级页面'] | 范围=[[248,115,670,443]] | 图片=['商店',75]}

{判断 | [[{''},'等于',2],{组=['T退出商店']}] | 开关={'第一层'}}
{判断 | [[{'合成用变量'},'等于',2],{组=['T商店坐标']}] | 开关={'第三层'}}
{跳至 | ['商店','买']}
)
[▰▰▰▰▰▰[饰品合成]▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰]=(
{跳出 | 'TF'}
)
[四级饰品合成]=(
{判断 | [[{'饰品合成'},'等于',0],{跳至=['T','四级饰品合成','退出']}]}
{组 | '公式四级饰品合成'}
{空参 | 合成1}
{判断 | [[{'一号位合成'},'等于','0'],{跳至=['T','四级饰品合成','合成2']}]}
{组 | '普通四级饰品合成1'}
{空参 | 合成2}
{判断 | [[{'二号位合成'},'等于','0'],{跳至=['T','四级饰品合成','退出']}]}
{组 | '普通四级饰品合成2'}
{空参 | 退出}
{跳至 | ['商店','升级']}
)
[合成前置]=(
//点击合成界面
{延时 | 1000}
{点击 | [350,490,50] | 延时=300}
{找图 | 服务器加载 | 循环=['T',999,100] | 范围=[[1250,22,1575,158]] | 图片=['加载中',85]}
{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{延时 | 300}
{跳出 | 'TF'}
)
[普通四级饰品合成1]=(
{组 | '合成前置'}
{空参 | 定向}

{判断 | [[{'饰品合成'},'等于',0],{跳出='T'}]}
{判断 | [[{'合成完了1'},'等于',1],{跳出='T'}]}
//{判断|[[{'层数变量'},'等于',0],{跳出='T'}]}
{赋值 | [[{'合成1'},1],[{'合成2'},0]]}
{找图 | 商店 | 跳出='T' | 范围=[[248,115,670,443]] | 图片=['商店',75]}
{组 | '合成定向1'}

{点击 | [992,709,50] | 延时=200}
{重置计次 | '三级'}
{重置计次 | '坐标X'}
{重置计次 | '坐标Y'}
{重置计次 | '数量'}
{赋值 | [[{'二级饰品'},0],[{'三级饰品'},1]]}
{组 | '一般合成1'}
{空参 | 退出}
{组 | '退出合成页面'}
{跳至 | ['四级饰品合成','合成2']}
)
[普通四级饰品合成2]=(


{空参 | 定向}
{赋值 | [[{'合成2'},1],[{'合成1'},0]]}
{判断 | [[{'饰品合成'},'等于',0],{跳出='T'}]}
{判断 | [[{'合成完了2'},'等于',1],{跳出='T'}]}
//{判断|[[{'层数变量'},'等于',0],{跳出='T'}]}
{组 | '合成前置'}
{找图 | 商店 | 跳出='T' | 范围=[[248,115,670,443]] | 图片=['商店',75]}
{组 | '合成定向2'}
//{判断|[[{'合成2'},'等于','0'],{跳转=['T','普通四级饰品合成2','定向']}]}
{点击 | [992,709,50] | 延时=200}
{重置计次 | '三级'}
{重置计次 | '坐标X'}
{重置计次 | '坐标Y'}
{重置计次 | '数量'}
{赋值 | [[{'二级饰品'},0],[{'三级饰品'},1]]}
{组 | '一般合成2'}
//退出
{空参 | 退出}
{组 | '退出合成页面'}
{跳至 | ['四级饰品合成','退出']}
)
[公式四级饰品合成]=(
{跳出 | 'TF' | 开关={'不合成公式四级'}}
{组 | '合成前置'}
{找图 | 商店 | 跳出='T' | 范围=[[248,115,670,443]] | 图片=['商店',75]}
{空参 | 定向}

{组 | '合成定向1'}
{点击 | [992,709,50] | 延时=200}
{移动 | [1045,10,200,2]}
{组 | '合成-烹饪秘诀书' | 开关={'合成_烧伤'}}
{组 | '合成-镇魂' | 开关={'合成_烧伤'}}
{组 | '合成-虔诚' | 开关={'合成_流血'}}
{组 | '合成-血雾' | 开关={'合成_流血'}}
{组 | '合成-追忆' | 开关={'合成_呼吸'}}
{组 | '合成-福袋' | 开关={'合成_呼吸'}}
{组 | '合成-恍惚' | 开关={'合成_破裂'}}
{组 | '合成-震颤耦合' | 开关={'合成_震颤'}}
{组 | '合成-黑色乐谱' | 开关={'合成_沉沦'}}
{组 | '合成-足迹' | 开关={'合成_沉沦'}}
{组 | '合成-永动机' | 开关={'合成_充能'}}
{赋值 | [[{'合成-镇魂'},0],[{'合成-血雾'},0],[{'合成-福袋'},0],[{'合成-恍惚'},0],[{'合成-震颤耦合'},0],[{'合成-黑色乐谱'},0],[{'合成-足迹'},0],[{'合成-永动机'},0],[{'合成-烹饪秘诀书'},0],[{'合成-虔诚'},0],[{'合成-追忆'},0]]}
{组 | '退出合成页面'}
{跳至 | ['四级饰品合成','合成1']}
)
[一般合成1]=(
{赋值 | [[{'合成范围坐标X1'},792],[{'合成范围坐标Y1'},272],[{'合成范围坐标X2'},906],[{'合成范围坐标Y2'},384]]}
//石头回炉
{找图 | 快感 | 判断=['T',[{'合成用变量'},'等于',2],{跳出='T'}] | 范围=[[784,261,1387,386]] | 图片=['合成-快感',80] | 开关={'合成_破裂'}}
{找图 | 炎鳞 | 判断=['T',[{'合成用变量'},'等于',2],{跳出='T'}] | 范围=[[784,261,1387,386]] | 图片=['合成-炎鳞',80] | 开关={'合成_烧伤'}}
{找图 | 暴雨 | 判断=['T',[{'合成用变量'},'等于',2],{跳出='T'}] | 范围=[[784,261,1387,386]] | 图片=['合成-暴雨',80] | 开关={'合成_震颤'}}
{找图 | 美感 | 判断=['T',[{'合成用变量'},'等于',2],{跳出='T'}] | 范围=[[784,261,1387,386]] | 图片=['合成-美感',80] | 开关={'合成_沉沦'}}
{找图 | 血棉 | 判断=['T',[{'合成用变量'},'等于',2],{跳出='T'}] | 范围=[[784,261,1387,386]] | 图片=['合成-红染棉花',80] | 开关={'合成_流血'}}
{找图 | 明镜 | 判断=['T',[{'合成用变量'},'等于',2],{跳出='T'}] | 范围=[[784,261,1387,386]] | 图片=['合成-明镜止水',80] | 开关={'合成_呼吸'}}
{找图 | 手套 | 判断=['T',[{'合成用变量'},'等于',2],{跳出='T'}] | 范围=[[784,261,1387,386]] | 图片=['合成-充能式手套',80] | 开关={'合成_充能'}}
{找图 | 石头回炉 | 赋值=['T',[{'石头回炉'},1]] | 组=['T石头回炉'] | 范围=[[784,261,1387,386]] | 图片=['回炉-业火残片','回炉-魅惑残片','回炉-傲慢残片','回炉-惰性残片','回炉-摩擦残片','回炉-蚕食残片','回炉-欲望残片',85] | 开关={'石头回炉2'}}
{组 | '合成EGO礼物'}
{跳出 | 'TF'}
)
[一般合成2]=(
{赋值 | [[{'合成范围坐标X1'},792],[{'合成范围坐标Y1'},272],[{'合成范围坐标X2'},906],[{'合成范围坐标Y2'},384]]}
//赋值那些还没做
//{找图|打击记忆|判断=['T',[{'合成用变量'},'等于',2],{跳出='T'}]|范围=[[784,261,1387,386]]|图片=['合成-打击记忆',80]|开关={'合成_打击'}}
{组 | '合成EGO礼物'}
{跳出 | 'TF'}
)
[合成坐标X]=(
{延时 | 100}
{计算 | [[{'合成范围坐标X1'},'+',117,{'合成范围坐标X1'}]]}
{计算 | [[{'合成范围坐标X2'},'+',117,{'合成范围坐标X2'}]]}
{计算 | [[{'坐标X'},'+',1,{'坐标X'}]]}
//{判断|[[{'坐标X'},'等于',3],{组=['T退出合成页面']}]|开关={'未命名开关2'}}
{判断 | [[{'坐标X'},'等于',5],{组=['T合成坐标Y']}]}
{组 | '石头回炉' | 开关={'石头回炉'}}
{组 | '合成EGO礼物'}
)
[合成坐标Y]=(
{计算 | [[{'合成范围坐标Y1'},'+',112,{'合成范围坐标Y1'}]]}
{计算 | [[{'合成范围坐标Y2'},'+',112,{'合成范围坐标Y2'}]]}
{赋值 | [[{'合成范围坐标X1'},792],[{'合成范围坐标X2'},906]]}

//至少看一眼第二行...
{计算 | [[{'坐标Y'},'+',1,{'坐标Y'}]]}
{赋值 | [[{'坐标X'},0]]}
{计算 | [[{'坐标Y'},'+',{'三级饰品'},{'未命名开关1'}]]}
//{判断|[[{'未命名开关1'},'等于',2],{赋值=['T',[{'未命名开关2'},1]]}]}
{判断 | [[{'坐标Y'},'等于',3],{跳至=['T','普通四级饰品合成1','退出']}] | 开关={'合成1'}}
{判断 | [[{'坐标Y'},'等于',3],{跳至=['T','普通四级饰品合成2','退出']}] | 开关={'合成2'}}
//{跳至|['普通四级饰品合成1','退出']|开关={'合成1'}}
//{跳至|['普通四级饰品合成2','退出']|开关={'合成2'}}
{组 | '石头回炉' | 开关={'石头回炉'}}
{组 | '合成EGO礼物'}
)
[合成EGO礼物]=(
{点击 | [1000,195,50]}
{找图 | 石头回炉 | 赋值=['T',[{'石头回炉'},1]] | 组=['T石头回炉'] | 范围=[[784,261,1387,386]] | 图片=['回炉-业火残片','回炉-魅惑残片','回炉-傲慢残片','回炉-惰性残片','回炉-摩擦残片','回炉-蚕食残片','回炉-欲望残片',85] | 开关={'石头回炉2'}}
{组 | '合成避开同体系饰品' | 开关={'合成避开同体系饰品'}}
{找图 | 鸡腿 | 组=['T合成坐标X'] | 范围=[[{'合成范围坐标X1'},{'合成范围坐标Y1'},{'合成范围坐标X2'},{'合成范围坐标Y2'}]] | 图片=['合成-鸡腿',85] | 开关={'合成_烧伤'}}
{找图 | 鸡胸肉 | 组=['T合成坐标X'] | 范围=[[{'合成范围坐标X1'},{'合成范围坐标Y1'},{'合成范围坐标X2'},{'合成范围坐标Y2'}]] | 图片=['合成-鸡胸肉',85] | 开关={'合成_破裂'}}
{组 | '合成避开同体系饰品' | 开关={'二级饰品'}}
{找图 | 合成-二级饰品 | 组=['T合成坐标X'] | 范围=[[{'合成范围坐标X1'},{'合成范围坐标Y1'},{'合成范围坐标X2'},{'合成范围坐标Y2'}]] | 图片=['合成-三级饰品',85] | 开关={'二级饰品'}}
{找图 | 合成-二级饰品 | 组=['F合成坐标X'] | 范围=[[{'合成范围坐标X1'},{'合成范围坐标Y1'},{'合成范围坐标X2'},{'合成范围坐标Y2'}]] | 图片=['合成-二级饰品',85] | 开关={'二级饰品'}}
{找图 | 合成-三级饰品 | 计次=['T','三级',2,{赋值=['T',[{'二级饰品'},1],[{'三级饰品'},0]]}] | 组=['F合成坐标X'] | 范围=[[{'合成范围坐标X1'},{'合成范围坐标Y1'},{'合成范围坐标X2'},{'合成范围坐标Y2'}]] | 图片=['合成-三级饰品',85] | 开关={'三级饰品'}}
//{延时|300}
{空参 | 数量 | 点击=['TF',{'合成范围坐标X2'},{'合成范围坐标Y2'},50] | 偏移=[-40,-40] | 计次=['T','数量',3,{组=['T开始合成']}]}
{点击 | [921,195,50]}
//{点击|[{'合成范围坐标X2'},{'升级范围坐标Y2'},50]|计次=['T','数量',3,{组=['T开始合成']}]}
{组 | '合成坐标X'}
)
[开始合成]=(
{点击 | [975,724,50] | 延时=1000}
{点击 | [981,720,50] | 延时=1000}
{找图 | 服务器加载 | 循环=['T',999,100] | 范围=[[1250,22,1575,158]] | 图片=['加载中',85]}
{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{点击 | [799,661,50] | 延时=500}
//{点击|[371,65,50]|延时=300}
//{点击|[371,65,50]|延时=300}
{重置计次 | '三级'}
{重置计次 | '数量'}
//石头回炉
{赋值 | [[{'合成范围坐标X1'},792],[{'合成范围坐标Y1'},272],[{'合成范围坐标X2'},906],[{'合成范围坐标Y2'},384]]}
{赋值 | [[{'二级饰品'},0],[{'三级饰品'},1]]}
{赋值 | [[{'坐标X'},0],[{'坐标Y'},0]]}
//{赋值|[[{'未命名开关1'},0],[{'未命名开关2'},0]]}
{组 | '检查合成饰品' | 开关={'合成1'}}
{赋值 | [[{'石头回炉'},0]]}
{赋值 | [[{'合成完了'},1],[{'没合成完'},0]] | 开关={'不合成公式四级'}}
{跳至 | ['普通四级饰品合成1','退出'] | 开关={'合成1'}}
{跳至 | ['普通四级饰品合成2','退出'] | 开关={'合成2'}}
{组 | '退出合成页面'}
)
[检查合成饰品]=(
{找图 | 快感 | 赋值=['T',[{'合成完了'},1]] | 组=['F石头回炉'] | 范围=[[784,261,1387,386]] | 图片=['合成-快感',80] | 开关={'合成_破裂'}}
{找图 | 炎鳞 | 赋值=['T',[{'合成完了'},1]] | 组=['F石头回炉'] | 范围=[[784,261,1387,386]] | 图片=['合成-炎鳞',80] | 开关={'合成_烧伤'}}
{找图 | 暴雨 | 赋值=['T',[{'合成完了'},1]] | 组=['F石头回炉'] | 范围=[[784,261,1387,386]] | 图片=['合成-暴雨',80] | 开关={'合成_震颤'}}
{找图 | 美感 | 赋值=['T',[{'合成完了'},1]] | 组=['F石头回炉'] | 范围=[[784,261,1387,386]] | 图片=['合成-美感',80] | 开关={'合成_沉沦'}}
{找图 | 血棉 | 赋值=['T',[{'合成完了'},1]] | 组=['F石头回炉'] | 范围=[[784,261,1387,386]] | 图片=['合成-红染棉花',80] | 开关={'合成_流血'}}
{找图 | 明镜 | 赋值=['T',[{'合成完了'},1]] | 组=['F石头回炉'] | 范围=[[784,261,1387,386]] | 图片=['合成-明镜止水',80] | 开关={'合成_呼吸'}}
{找图 | 手套 | 赋值=['T',[{'合成完了'},1]] | 组=['F石头回炉'] | 范围=[[784,261,1387,386]] | 图片=['合成-充能式手套',80] | 开关={'合成_充能'}}
//判断=['T',[{'合成用变量'},'等于',2],{赋值=['F',[{'石头回炉'},1]]|
{跳出 | 'TF'}
)
[石头回炉]=(
{点击 | [921,195,50]}
{找图 | 石头回炉 | 计次=['T','四级',1,{赋值=['T',[{'二级饰品'},1],[{'三级饰品'},0]]}] | 跳至=['T','石头回炉','数量'] | 范围=[[{'合成范围坐标X1'},{'合成范围坐标Y1'},{'合成范围坐标X2'},{'合成范围坐标Y2'}]] | 图片=['回炉-业火残片','回炉-魅惑残片','回炉-傲慢残片','回炉-惰性残片','回炉-摩擦残片','回炉-蚕食残片','回炉-欲望残片',85]}
{组 | '合成避开同体系饰品'}
{找图 | 合成-二级饰品 | 组=['T合成坐标X'] | 范围=[[{'合成范围坐标X1'},{'合成范围坐标Y1'},{'合成范围坐标X2'},{'合成范围坐标Y2'}]] | 图片=['合成-三级饰品',85] | 开关={'二级饰品'}}
{找图 | 合成-二级饰品 | 组=['F合成坐标X'] | 范围=[[{'合成范围坐标X1'},{'合成范围坐标Y1'},{'合成范围坐标X2'},{'合成范围坐标Y2'}]] | 图片=['合成-二级饰品',85] | 开关={'二级饰品'}}
{找图 | 合成-四级饰品 | 计次=['T','四级',1,{赋值=['T',[{'二级饰品'},1],[{'三级饰品'},0]]}] | 组=['F合成坐标X'] | 范围=[[{'合成范围坐标X1'},{'合成范围坐标Y1'},{'合成范围坐标X2'},{'合成范围坐标Y2'}]] | 图片=['合成-四级饰品',85] | 开关={'三级饰品'}}
{空参 | 数量 | 点击=['TF',{'合成范围坐标X2'},{'合成范围坐标Y2'},50] | 偏移=[-40,-40] | 计次=['T','数量',3,{组=['T开始合成']}]}
{点击 | [921,195,50]}
{组 | '合成坐标X'}
)
[合成避开同体系饰品]=(
{找图 | 合成-探戈鸡酱料 | 组=['T合成坐标X'] | 范围=[[{'合成范围坐标X1'},{'合成范围坐标Y1'},{'合成范围坐标X2'},{'合成范围坐标Y2'}]] | 图片=['合成-探戈鸡酱料',85] | 开关={'镜本困难'}}
{找图 | 礼物升级-烧伤 | 组=['T合成坐标X'] | 范围=[[{'合成范围坐标X1'},{'合成范围坐标Y1'},{'合成范围坐标X2'},{'合成范围坐标Y2'}]] | 图片=['礼物升级-烧伤','礼物升级-烧伤2','饰品++','饰品+',85] | 开关={'合成_烧伤'}}
{找图 | 礼物升级-流血 | 组=['T合成坐标X'] | 范围=[[{'合成范围坐标X1'},{'合成范围坐标Y1'},{'合成范围坐标X2'},{'合成范围坐标Y2'}]] | 图片=['礼物升级-流血','礼物升级-流血2','饰品++','饰品+',85] | 开关={'合成_流血'}}
{找图 | 礼物升级-震颤 | 组=['T合成坐标X'] | 范围=[[{'合成范围坐标X1'},{'合成范围坐标Y1'},{'合成范围坐标X2'},{'合成范围坐标Y2'}]] | 图片=['礼物升级-震颤','礼物升级-震颤2','饰品++','饰品+',85] | 开关={'合成_震颤'}}
{找图 | 礼物升级-破裂 | 组=['T合成坐标X'] | 范围=[[{'合成范围坐标X1'},{'合成范围坐标Y1'},{'合成范围坐标X2'},{'合成范围坐标Y2'}]] | 图片=['礼物升级-破裂','礼物升级-破裂2','饰品++','饰品+',85] | 开关={'合成_破裂'}}
{找图 | 礼物升级-沉沦 | 组=['T合成坐标X'] | 范围=[[{'合成范围坐标X1'},{'合成范围坐标Y1'},{'合成范围坐标X2'},{'合成范围坐标Y2'}]] | 图片=['礼物升级-沉沦','礼物升级-沉沦2','饰品++','饰品+',85] | 开关={'合成_沉沦'}}
{找图 | 礼物升级-呼吸 | 组=['T合成坐标X'] | 范围=[[{'合成范围坐标X1'},{'合成范围坐标Y1'},{'合成范围坐标X2'},{'合成范围坐标Y2'}]] | 图片=['礼物升级-呼吸','礼物升级-呼吸2','饰品++','饰品+',85] | 开关={'合成_呼吸'}}
{找图 | 礼物升级-充能 | 组=['T合成坐标X'] | 范围=[[{'合成范围坐标X1'},{'合成范围坐标Y1'},{'合成范围坐标X2'},{'合成范围坐标Y2'}]] | 图片=['礼物升级-充能','礼物升级-充能2','饰品++','饰品+',85] | 开关={'合成_充能'}}
{找图 | 礼物升级-斩击 | 组=['T合成坐标X'] | 范围=[[{'合成范围坐标X1'},{'合成范围坐标Y1'},{'合成范围坐标X2'},{'合成范围坐标Y2'}]] | 图片=['礼物升级-斩击','礼物升级-斩击2','饰品++','饰品+',85] | 开关={'斩击'}}
{找图 | 礼物升级-突刺 | 组=['T合成坐标X'] | 范围=[[{'合成范围坐标X1'},{'合成范围坐标Y1'},{'合成范围坐标X2'},{'合成范围坐标Y2'}]] | 图片=['礼物升级-突刺','礼物升级-突刺2','饰品++','饰品+',85] | 开关={'突刺'}}
{找图 | 礼物升级-打击 | 组=['T合成坐标X'] | 范围=[[{'合成范围坐标X1'},{'合成范围坐标Y1'},{'合成范围坐标X2'},{'合成范围坐标Y2'}]] | 图片=['礼物升级-打击','礼物升级-打击2','饰品++','饰品+',85] | 开关={'打击'}}
{跳出 | 'TF'}
)
[退出合成页面]=(
{点击 | [614,727,50] | 延时=300}
{点击 | [614,727,50] | 延时=300}
{重置计次 | '三级'}
{重置计次 | '数量'}
{赋值 | [[{'石头回炉'},0]]}
{赋值 | [[{'二级饰品'},0],[{'三级饰品'},1]]}
{赋值 | [[{'坐标X'},0],[{'坐标Y'},0]]}
//{赋值|[[{'未命名开关1'},0],[{'未命名开关2'},0]]}
{跳出 | 'TF'}
)
[▰▰▰▰▰▰[合成定向]▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰]=(
{跳出 | 'TF'}
)
[合成跟随队伍体系]=(
{赋值 | [[{'合成体系1'},'合成_烧伤']] | 开关={'烧伤1'}}
{赋值 | [[{'合成体系1'},'合成_沉沦']] | 开关={'沉沦1'}}
{赋值 | [[{'合成体系1'},'合成_破裂']] | 开关={'破裂1'}}
{赋值 | [[{'合成体系1'},'合成_流血']] | 开关={'流血1'}}
{赋值 | [[{'合成体系1'},'合成_呼吸']] | 开关={'呼吸1'}}
{赋值 | [[{'合成体系1'},'合成_震颤']] | 开关={'震颤1'}}
{赋值 | [[{'合成体系1'},'合成_充能']] | 开关={'充能1'}}
{赋值 | [[{'合成体系2'},'合成_斩击']] | 开关={'斩击'}}
{赋值 | [[{'合成体系2'},'合成_突刺']] | 开关={'突刺'}}
{赋值 | [[{'合成体系2'},'合成_打击']] | 开关={'打击'}}
{赋值 | [[{'合成体系2'},'合成_礼物_空']] | 开关={'无物理体系'}}
{跳出 | 'TF'}
)
[合成定向1]=(
//{判断|[[{'一号位合成'},'等于','0'],{赋值=['T',[{'合成1'},0]]}]}
{组 | '一号位合成' | 开关={'一号位合成'}}
{跳出 | 'TF'}
//{跳至|['商店','升级']}
)
[合成定向2]=(
//{判断|[[{'二号位合成'},'等于','0'],{赋值=['T',[{'合成2'},0]]}]}
{组 | '二号位合成' | 开关={'二号位合成'}}
{跳出 | 'TF'}
//{跳至|['商店','升级']}
)

[一号位合成]=(
{跳出 | 'T' | 开关={'合成完了1'}}
{组 | {'合成体系1'}}
//{空参|合成1|跳出='T'|开关={'合成1'}}
{跳出 | 'TF'}
)
[二号位合成]=(
{跳出 | 'T' | 开关={'合成完了2'}}
{组 | {'合成体系2'}}
//{空参|合成2|跳出='T'|开关={'合成2'}}
{跳出 | 'TF'}
)
[合成_烧伤]=(
{赋值 | [[{'合成_烧伤'},1]]}
{点击 | [1355,630,50] | 延时=300}
//{找图|合成界面|循环=['F',10,100]|范围=[[600,554,682,622]]|图片=['合成界面',85]}
{点击 | [400,350,50] | 延时=100}
{跳出 | 'TF'}
)
[合成_流血]=(
{赋值 | [[{'合成_流血'},1]]}
{点击 | [1355,630,50] | 延时=300}
{点击 | [600,350,50] | 延时=100}
{跳出 | 'TF'}
)
[合成_震颤]=(
{赋值 | [[{'合成_震颤'},1]]}
{点击 | [1355,630,50] | 延时=300}
{点击 | [800,350,50] | 延时=100}
{跳出 | 'TF'}
)
[合成_破裂]=(
{赋值 | [[{'合成_破裂'},1]]}
{点击 | [1355,630,50] | 延时=300}
{点击 | [1000,350,50] | 延时=100}
{跳出 | 'TF'}
)
[合成_沉沦]=(
{赋值 | [[{'合成_沉沦'},1]]}
{点击 | [1355,630,50] | 延时=300}
{点击 | [1200,350,50] | 延时=100}
{跳出 | 'TF'}
)
[合成_呼吸]=(
{赋值 | [[{'合成_呼吸'},1]]}
{点击 | [1355,630,50] | 延时=300}
{点击 | [400,550,50] | 延时=100}
{跳出 | 'TF'}
)
[合成_充能]=(
{赋值 | [[{'合成_充能'},1]]}
{点击 | [1355,630,50] | 延时=300}
{点击 | [600,550,50] | 延时=100}
{跳出 | 'TF'}
)
[合成_斩击]=(
{点击 | [1355,630,50] | 延时=300}
{点击 | [800,550,50] | 延时=100}
{跳出 | 'TF'}
)
[合成_突刺]=(
{点击 | [1355,630,50] | 延时=300}
{点击 | [1000,550,50] | 延时=100}
{跳出 | 'TF'}
)
[合成_打击]=(
{点击 | [1355,630,50] | 延时=300}
{点击 | [1200,550,50] | 延时=100}
{跳出 | 'TF'}
)
[合成_礼物_空]=(
//理论上不会跳到这里
{跳出 | 'TF'}
)
[▰▰▰▰▰▰[镜牢结算]▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰]=(
{跳出 | 'TF'}
)
[结算]=(
{按键 | ['F12',50] | 开关={'结算时截图'}}
{组 | '不领取奖励' | 开关={'不领取奖励'}}
{空参 | 正在进行能源的提取和精炼程序}
{空参 | 喵}
//{找图|每周加成开启|点击=['T',0,0,50]|延时=1000|范围=[[738,294,882,355]]|图片=['每周加成开启',85]}
{延时 | 500}
{按键 | ['ENTER',50]}
{延时 | 500}
{找图 | 每周加成 | 组=['T每周加成'] | 范围=[[638,118,1149,355]] | 图片=['探查终了报酬','探查终了报酬2','每周加成开启',85]}
{找图 | 存储一局 | 组=['T返回车窗'] | 范围=[[638,118,1149,355]] | 图片=['探查终了报酬','探查终了报酬2','每周加成开启',85] | 开关={'存储一局'}}
{按键 | ['ENTER',50]}
{延时 | 500}
{找图 | 每周加成 | 组=['T每周加成'] | 范围=[[638,118,1149,355]] | 图片=['探查终了报酬','探查终了报酬2','每周加成开启',85]}
{找图 | 存储一局 | 组=['T返回车窗'] | 范围=[[638,118,1149,355]] | 图片=['探查终了报酬','探查终了报酬2','每周加成开启',85] | 开关={'存储一局'}}
{按键 | ['ENTER',50]}
{延时 | 500}
{按键 | ['ENTER',50]}
{延时 | 500}
{按键 | ['ENTER',50]}
{找图 | 无法结算 | 跳转=['T返回车窗'] | 范围=[[682,272,1067,576]] | 图片=['无法结算',85]}
{找图 | 镜像地牢主页 | 按键=['F','ENTER',50] | 循环=['F',999,50] | 范围=[[973,734,1216,863],[1416,752,1536,849]] | 图片=['主页1','主页2','主页3','主页4','主页-无字1','主页-无字2','活动关闭','活动关闭2',65]}
{组 | '升级自动换门票' | 开关={'升级自动换门票'}}
{赋值 | [[{'战斗释放特定EGO'},0]]}
{赋值 | [[{'初始礼物升级完毕'},0]]}
{赋值 | [[{'合成-福袋'},0]]}
{赋值 | [[{'合成-血雾'},0]]}
{赋值 | [[{'合成-烹饪秘诀书'},0]]}
{赋值 | [[{'合成-追忆'},0]]}
{赋值 | [[{'合成-虔诚'},0]]}
{赋值 | [[{'合成-震颤耦合'},0]]}
{赋值 | [[{'合成-黑色乐谱'},0]]}
{赋值 | [[{'合成-永动机'},0]]}
{赋值 | [[{'合成-足迹'},0]]}
{赋值 | [[{'合成-恍惚'},0]]}
{赋值 | [[{'合成-镇魂'},0]]}

{赋值 | [[{'楼层判断-节点'},0],[{'楼层判断-识图'},1]]}
{赋值 | [[{'节点数'},0]]}
{赋值 | [[{'商店已刷新次数'},0]]}
{赋值 | [[{'第二页'},1]]}
{赋值 | [[{'合成完了'},0]]}
{赋值 | [[{'没合成完'},0]]}
{赋值 | [[{'层数变量'},0]]}
{赋值 | [[{'合成用变量'},0]]}
{赋值 | [[{'第五层释放ego'},0]]}
{赋值 | [[{'开局重新选人2'},1]] | 开关={'开局重新选人'}}
{打印变量 | ['地牢次数']}
{计算 | [[{'地牢次数'},'-',1,{'地牢次数'}]]}
{计算 | [[{'地牢完成次数2'},'+',1,{'地牢完成次数2'}]]}
{计算 | [[{'地牢完成次数'},'+',1,{'地牢完成次数'}]]}
{判断 | [[{'地牢次数'},'小于等于',0],{赋值=['T',[{'地牢开关'},0]] | 操作开关=['T',['主界面','地牢开关',0]]}]}
{移动 | [1207,798,200,10]}
{跳转 | '主界面'}
)
[每周加成]=(
{点击 | [940,315,50] | 延时=500 | 开关={'使用单次加成'}}
{点击 | [806,315,50] | 延时=500 | 开关={'不使用加成'}}
{跳出 | 'TF'}
)
[三层退]=(
{判断 | [[{'第四层'},'等于',1],{跳出='F'}]}
{延时 | 3000}
{点击 | [1543,55,50] | 延时=500}
{找图 | 退出界面 | 循环=['F',20,100] | 范围=[[916,448,1058,565]] | 图片=['退出界面',85]}
{找图 | 退出界面 | 组=['F镜本'] | 范围=[[916,448,1058,565]] | 图片=['退出界面',85]}
{点击 | [627,537,50] | 延时=1000}
{点击 | [960,611,50] | 延时=500}
{跳转 | '结算'}
)
[四层退]=(
{判断 | [[{'第五层'},'等于',1],{跳出='F'}]}
{延时 | 3500}
{点击 | [1543,55,50] | 延时=500}
{找图 | 退出界面 | 循环=['F',20,100] | 范围=[[916,448,1058,565]] | 图片=['退出界面',85]}
{找图 | 退出界面 | 组=['F镜本'] | 范围=[[916,448,1058,565]] | 图片=['退出界面',85]}
{点击 | [627,537,50] | 延时=1000}
{点击 | [960,611,50] | 延时=500}
{跳转 | '结算'}
)

[返回车窗]=(
{点击 | [647,613,50] | 延时=1000}
{点击 | [796,687,50] | 延时=1000}
{点击 | [963,616,50] | 延时=1000}
//显示剩余次数与完成次数
{计算 | [[{'地牢次数'},'-',1,{'地牢次数'}]]}
{计算 | [[{'地牢完成次数'},'+',1,{'地牢完成次数'}]]}
{找图 | 镜像地牢主页 | 循环=['F',999,100] | 范围=[[973,734,1216,863],[1416,752,1536,849]] | 图片=['主页1','主页2','主页3','主页4','主页-无字1','主页-无字2',65]}
{空参 | 喵}
{打印变量 | ['地牢次数']}
{打印变量 | ['地牢完成次数']}
{组 | '升级自动换门票' | 开关={'升级自动换门票'}}
{停止 | 脚本}
)
[停止脚本]=(
{跳出 | 'TF' | 开关={'五点自动日常'}}
{赋值 | [[{'脚本开关'},0]]}
{计算 | [[{'地牢开关'},'+',{'经验本开关'},{'脚本开关'}]]}
{计算 | [[{'纽本开关'},'+',{'脚本开关'},{'脚本开关'}]]}

{判断 | [[{'脚本开关'},'小于等于',0],{跳出='F'}]}
{打印变量 | ['地牢次数'] | 开关={'地牢次数统计'}}
{打印变量 | ['地牢完成次数'] | 开关={'地牢次数统计'}}
{停止 | 脚本}
)
[▰▰▰▰▰▰[纠错和修正]▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰]=(
{跳出 | 'TF'}
)
[处理错误]=(
{找图 | 战斗中标志 | 组=['T战斗中标志'] | 范围=[[1298,4,1594,160],[3,13,111,121]] | 图片=['战斗中标志','战斗中标志2','战斗中标志3','战斗中标志4',80]}
{找图 | 重连 | 点击=['T',859,584,50] | 循环=['T',250,250] | 范围=[[549,316,1049,638],[1250,22,1575,158]] | 图片=['重连','重连-中字','加载中',85]}
{找图 | 重连失败 | 跳至=['T','返回车窗','喵'] | 范围=[[561,354,1119,532]] | 图片=['重连失败','重连失败2',85]}
{找图 | 结算 | 组=['T结算'] | 范围=[[1119,47,1546,304],[1227,604,1551,809],[153,100,443,237]] | 图片=['战斗胜利','战斗胜利-中字','战斗败北','战斗败北-中字','探查完了','确认领取','确认领取2',85]}
{找图 | 地图界面 | 组=['T地图界面'] | 延时=200 | 范围=[[1491,80,1587,163]] | 图片=['地图界面','地图界面2','地图界面3',75]}
{找图 | 通用确认按钮 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[419,125,1568,871]] | 图片=['确认','确认-中字1','确认-中字2','确认1','确认2','确认5',85]}
{找图 | 入场 | 点击=['T',0,0,50] | 组=['T镜本'] | 延时=200 | 范围=[[1157,429,1584,873]] | 图片=['入场',85]}
{找色 | i | 点击=['T',115,50,50] | 延时=1000 | 范围=[[169,25,454,106]] | 颜色=['#E9C99F','10,-1,#54483A/19,-1,#E9C99F/24,-1,#E9C99F/30,-1,#E9C99F/38,-1,#786752/48,1,#E9C99F/60,-3,#E9C99F/72,2,#000000/80,2,#000000',80]}
{找图 | 问号 | 组=['T问号'] | 延时=200 | 范围=[[364,40,514,155]] | 图片=['问号','问号2',85]}
{找图 | 退回 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[5,8,300,150]] | 图片=['退回','退回2','退回3','退回4',75]}
{找图 | 活动关闭 | 按键=['T','ESC',50] | 延时=300 | 范围=[[1312,146,1415,248]] | 图片=['活动关闭','活动关闭2',75]}
//{找图|效果选择|组=['T问号']|延时=1000|范围=[[499,189,1110,250]]|图片=['效果选择','效果选择-中字',85]}
{找图 | 获得EGO | 点击=['T',800,666,50] | 延时=200 | 范围=[[552,170,1093,287]] | 图片=['获得EGO礼物',85]}
{找图 | 结算-通行证奖励展示 | 点击=['T',796,589,50] | 延时=1000 | 范围=[[564,258,1020,358]] | 图片=['结算-通行证奖励展示',85]}
{找图 | 错误-EGO礼物强化 | 点击=['T',499,49,50] | 延时=1000 | 范围=[[561,36,1014,196]] | 图片=['错误-EGO礼物强化',85]}
{找图 | 错误-售卖礼物 | 点击=['T',620,750,50] | 延时=1000 | 范围=[[568,53,1027,205]] | 图片=['错误-售卖礼物',85]}
{找图 | 错误-效果选择 | 组=['T效果选择'] | 范围=[[401,49,826,281]] | 图片=['效果选择','效果选择-中字','效果选择2',70]}

{组 | '停止脚本'}
{跳转 | '主界面'}
)
[效果选择]=(
//临时增益冲突
{点击 | [1030,463,50] | 延时=1000}
//几个地方都试试
{点击 | [777,630,50] | 延时=1000}
{点击 | [777,670,50] | 延时=1000}
//{点击|[777,580,50]|延时=1000}
{按键 | ['enter',50]}
{跳出 | 'TF'}
)
[重新开始这一把]=(
{延时 | 1000}
{找图 | 退回 | 点击=['T',0,0,50] | 延时=500 | 范围=[[5,8,300,150]] | 图片=['退回','退回2','退回3',75]}
{点击 | [1543,55,50] | 延时=500}
{点击 | [627,537,50] | 延时=500}
{点击 | [960,611,50] | 延时=500}

{组 | '不领取奖励'}
)
[不领取奖励]=(
{点击 | [1385,730,50] | 延时=500}
{点击 | [1385,730,50] | 延时=500}
{找图 | 拒绝领取 | 点击=['T',0,0,50] | 延时=500 | 范围=[[370,618,672,756]] | 图片=['拒绝领取',85]}
{找图 | 拒绝报酬2 | 点击=['T',956,611,50] | 延时=500 | 范围=[[525,365,706,485]] | 图片=['拒绝报酬2',85]}
{找图 | 镜像地牢主页 | 组=['T主界面'] | 延时=100 | 范围=[[973,734,1216,863]] | 图片=['主页1','主页2','主页3','主页4','活动关闭','活动关闭2','主页-无字1','主页-无字2',75]}
{赋值 | [[{'战斗释放特定EGO'},0]]}
{赋值 | [[{'初始礼物升级完毕'},0]]}
{赋值 | [[{'合成-福袋'},0]]}
{赋值 | [[{'合成-血雾'},0]]}
{赋值 | [[{'合成-烹饪秘诀书'},0]]}
{赋值 | [[{'合成-追忆'},0]]}
{赋值 | [[{'合成-虔诚'},0]]}
{赋值 | [[{'合成-震颤耦合'},0]]}
{赋值 | [[{'合成-黑色乐谱'},0]]}
{赋值 | [[{'合成-永动机'},0]]}
{赋值 | [[{'合成-足迹'},0]]}
{赋值 | [[{'合成-恍惚'},0]]}
{赋值 | [[{'合成-镇魂'},0]]}

{赋值 | [[{'楼层判断-节点'},0],[{'楼层判断-识图'},1]]}
{赋值 | [[{'节点数'},0]]}
{赋值 | [[{'商店已刷新次数'},0]]}
{赋值 | [[{'第二页'},1]]}
{赋值 | [[{'合成完了'},0]]}
{赋值 | [[{'没合成完'},0]]}
{赋值 | [[{'层数变量'},0]]}
{赋值 | [[{'合成用变量'},0]]}
{赋值 | [[{'第五层释放ego'},0]]}
{赋值 | [[{'开局重新选人2'},1]] | 开关={'开局重新选人'}}
{跳转 | '不领取奖励'}
)

[▰▰▰▰▰▰[细项四级合成内容]▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰]=(
{跳出 | 'TF'}
)
[合成-烹饪秘诀书]=(
{找图 | 合成-万年炖锅 | 计算=['T',[{'合成-烹饪秘诀书'},'+',1,{'合成-烹饪秘诀书'}]] | 延时=100 | 范围=[[743,222,1441,669]] | 图片=['合成-万年炖锅',75]}
//翻页
{点击 | ['T',1394,287,50,'L',1]}
{点击 | ['T',1394,601,50,'L',2] | 延时=300}
//第二页
{找图 | 合成-熔化的石蜡 | 计算=['T',[{'合成-烹饪秘诀书'},'+',1,{'合成-烹饪秘诀书'}]] | 延时=100 | 范围=[[743,222,1441,669]] | 图片=['合成-熔化的石蜡',75]}
//翻页
{点击 | ['T',1394,580,50,'L',1] | 延时=300}
{点击 | ['T',1394,287,50,'L',2] | 延时=300}
//第一页
{判断 | [[{'合成-烹饪秘诀书'},'等于',2],{跳出='F'}]}
{找图 | 合成-万年炖锅 | 点击=['T',0,0,50] | 延时=100 | 范围=[[743,222,1441,669]] | 图片=['合成-万年炖锅',75]}
//翻页
{点击 | ['T',1394,287,50,'L',1]}
{点击 | ['T',1394,601,50,'L',2] | 延时=300}
//第二页
{找图 | 合成-熔化的石蜡 | 点击=['T',0,0,50] | 延时=100 | 范围=[[743,222,1441,669]] | 图片=['合成-熔化的石蜡',75]}
//翻页
{点击 | ['T',1394,580,50,'L',1] | 延时=300}
{点击 | ['T',1394,287,50,'L',2] | 延时=300}
//第一页
{点击 | [975,724,50] | 延时=1000}
{点击 | [981,720,50] | 延时=1000}
{点击 | [799,661,50] | 延时=500}
//{点击|[371,65,50]|延时=300}
{跳出 | 'TF'}
)
[合成-虔诚]=(
{找图 | 合成-蜜拉卡 | 计算=['T',[{'合成-虔诚'},'+',1,{'合成-虔诚'}]] | 延时=100 | 范围=[[743,222,1441,669]] | 图片=['合成-蜜拉卡',75]}
//翻页
{点击 | ['T',1394,287,50,'L',1]}
{点击 | ['T',1394,601,50,'L',2] | 延时=300}
//第二页
{找图 | 合成-被扣留的颂歌 | 计算=['T',[{'合成-虔诚'},'+',1,{'合成-虔诚'}]] | 延时=100 | 范围=[[743,222,1441,669]] | 图片=['合成-被扣留的颂歌',75]}
//翻页
{点击 | ['T',1394,580,50,'L',1] | 延时=300}
{点击 | ['T',1394,287,50,'L',2] | 延时=300}
//第一页
{判断 | [[{'合成-虔诚'},'等于',2],{跳出='F'}]}
{找图 | 合成-蜜拉卡 | 点击=['T',0,0,50] | 延时=100 | 范围=[[743,222,1441,669]] | 图片=['合成-蜜拉卡',75]}
//翻页
{点击 | ['T',1394,287,50,'L',1]}
{点击 | ['T',1394,601,50,'L',2] | 延时=300}
//第二页
{找图 | 合成-被扣留的颂歌 | 点击=['T',0,0,50] | 延时=100 | 范围=[[743,222,1441,669]] | 图片=['合成-被扣留的颂歌',75]}
//翻页
{点击 | ['T',1394,580,50,'L',1] | 延时=300}
{点击 | ['T',1394,287,50,'L',2] | 延时=300}
//第一页
{点击 | [975,724,50] | 延时=1000}
{点击 | [981,720,50] | 延时=1000}
{点击 | [799,661,50] | 延时=500}
//{点击|[371,65,50]|延时=300}
{跳出 | 'TF'}
)
[合成-追忆]=(
{找图 | 合成-某日的记忆 | 计算=['T',[{'合成-追忆'},'+',1,{'合成-追忆'}]] | 延时=100 | 范围=[[743,222,1441,669]] | 图片=['合成-某日的记忆',75]}
//翻页
{点击 | ['T',1394,287,50,'L',1]}
{点击 | ['T',1394,601,50,'L',2] | 延时=300}
//第二页
{找图 | 合成-吊坠 | 计算=['T',[{'合成-追忆'},'+',1,{'合成-追忆'}]] | 延时=100 | 范围=[[743,222,1441,669]] | 图片=['合成-吊坠',75]}
//翻页
{点击 | ['T',1394,580,50,'L',1] | 延时=300}
{点击 | ['T',1394,287,50,'L',2] | 延时=300}
//第一页
{判断 | [[{'合成-追忆'},'等于',2],{跳出='F'}]}
{找图 | 合成-某日的记忆 | 点击=['T',0,0,50] | 延时=100 | 范围=[[743,222,1441,669]] | 图片=['合成-某日的记忆',75]}
//翻页
{点击 | ['T',1394,287,50,'L',1]}
{点击 | ['T',1394,601,50,'L',2] | 延时=300}
//第二页
{找图 | 合成-吊坠 | 点击=['T',0,0,50] | 延时=100 | 范围=[[743,222,1441,669]] | 图片=['合成-吊坠',75]}
//翻页
{点击 | ['T',1394,580,50,'L',1] | 延时=300}
{点击 | ['T',1394,287,50,'L',2] | 延时=300}
//第一页
{点击 | [975,724,50] | 延时=1000}
{点击 | [981,720,50] | 延时=1000}
{点击 | [799,661,50] | 延时=500}
//{点击|[371,65,50]|延时=300}
{跳出 | 'TF'}
)
[合成-福袋]=(
{找图 | 合成-四叶草 | 计算=['T',[{'合成-福袋'},'+',1,{'合成-福袋'}]] | 延时=100 | 范围=[[743,222,1441,669]] | 图片=['合成-四叶草',75]}
{找图 | 合成-追忆 | 计算=['T',[{'合成-福袋'},'+',1,{'合成-福袋'}]] | 延时=100 | 范围=[[743,222,1441,669]] | 图片=['合成-追忆',75]}
//翻页
{点击 | ['T',1394,287,50,'L',1]}
{点击 | ['T',1394,601,50,'L',2] | 延时=300}
//第二页
{找图 | 合成-马蹄铁 | 计算=['T',[{'合成-福袋'},'+',1,{'合成-福袋'}]] | 延时=100 | 范围=[[743,222,1441,669]] | 图片=['合成-马蹄铁',75]}
//翻页
{点击 | ['T',1394,580,50,'L',1] | 延时=300}
{点击 | ['T',1394,287,50,'L',2] | 延时=300}
//第一页
{判断 | [[{'合成-福袋'},'等于',3],{跳出='F'}]}
{找图 | 合成-四叶草 | 点击=['T',0,0,50] | 延时=100 | 范围=[[743,222,1441,669]] | 图片=['合成-四叶草',75]}
{点击 | [721,432,50] | 延时=300}
{找图 | 合成-追忆 | 点击=['T',0,0,50] | 延时=300 | 范围=[[743,222,1441,669]] | 图片=['合成-追忆',75]}
//翻页
{点击 | ['T',1394,287,50,'L',1]}
{点击 | ['T',1394,601,50,'L',2] | 延时=300}
//第二页
{找图 | 合成-马蹄铁 | 点击=['T',0,0,50] | 延时=100 | 范围=[[743,222,1441,669]] | 图片=['合成-马蹄铁',75]}
//翻页
{点击 | ['T',1394,580,50,'L',1] | 延时=300}
{点击 | ['T',1394,287,50,'L',2] | 延时=300}
//第一页
{点击 | [975,724,50] | 延时=1000}
{点击 | [981,720,50] | 延时=1000}
{点击 | [799,661,50] | 延时=500}
//{点击|[371,65,50]|延时=300}
{跳出 | 'TF'}
)

[合成-血雾]=(
{找图 | 合成-铁丝网 | 计算=['T',[{'合成-血雾'},'+',1,{'合成-血雾'}]] | 延时=100 | 范围=[[743,222,1441,669]] | 图片=['合成-铁丝网',75]}
{找图 | 合成-虔诚 | 计算=['T',[{'合成-血雾'},'+',1,{'合成-血雾'}]] | 延时=100 | 范围=[[743,222,1441,669]] | 图片=['合成-虔诚',75]}
//翻页
{点击 | ['T',1394,287,50,'L',1]}
{点击 | ['T',1394,601,50,'L',2] | 延时=300}
//第二页
{找图 | 合成-笼头 | 计算=['T',[{'合成-血雾'},'+',1,{'合成-血雾'}]] | 延时=100 | 范围=[[743,222,1441,669]] | 图片=['合成-笼头',75]}
//翻页
{点击 | ['T',1394,580,50,'L',1] | 延时=300}
{点击 | ['T',1394,287,50,'L',2] | 延时=300}
//第一页
{判断 | [[{'合成-血雾'},'等于',3],{跳出='F'}]}
{找图 | 合成-铁丝网 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[735,212,1446,679]] | 图片=['合成-铁丝网',75]}
{点击 | [721,432,50] | 延时=300}
{找图 | 合成-虔诚 | 点击=['T',0,0,50] | 延时=300 | 范围=[[743,222,1441,669]] | 图片=['合成-虔诚',75]}
//翻页
{点击 | ['T',1394,287,50,'L',1]}
{点击 | ['T',1394,601,50,'L',2] | 延时=300}
//第二页
{找图 | 合成-笼头 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[735,212,1446,679]] | 图片=['合成-笼头',75]}
//翻页
{点击 | ['T',1394,580,50,'L',1] | 延时=300}
{点击 | ['T',1394,287,50,'L',2] | 延时=300}
//第一页
{点击 | [975,724,50] | 延时=1000}
{点击 | [981,720,50] | 延时=1000}
{点击 | [799,661,50] | 延时=500}
{跳出 | 'TF'}
)
[合成-镇魂]=(
{找图 | 合成-尘归尘 | 计算=['T',[{'合成-镇魂'},'+',1,{'合成-镇魂'}]] | 延时=100 | 范围=[[743,222,1441,669]] | 图片=['合成-尘归尘',75]}
{找图 | 合成-烹饪秘诀书 | 计算=['T',[{'合成-镇魂'},'+',1,{'合成-镇魂'}]] | 延时=100 | 范围=[[743,222,1441,669]] | 图片=['合成-烹饪秘诀书',75]}
//翻页
{点击 | ['T',1394,287,50,'L',1] | 延时=300}
{点击 | ['T',1394,580,50,'L',2] | 延时=300}
//第二页
{找图 | 合成-土归土 | 计算=['T',[{'合成-镇魂'},'+',1,{'合成-镇魂'}]] | 延时=100 | 范围=[[743,222,1441,669]] | 图片=['合成-土归土',75]}
//翻页
{点击 | ['T',1394,580,50,'L',1] | 延时=300}
{点击 | ['T',1394,287,50,'L',2] | 延时=300}
//第一页
{判断 | [[{'合成-镇魂'},'等于',3],{跳出='F'}]}
{找图 | 合成-尘归尘 | 点击=['T',0,0,50] | 延时=100 | 范围=[[735,212,1446,679]] | 图片=['合成-尘归尘',75]}
{点击 | [721,432,50] | 延时=300}
{找图 | 合成-烹饪秘诀书 | 点击=['T',0,0,50] | 延时=300 | 范围=[[743,222,1441,669]] | 图片=['合成-烹饪秘诀书',75]}
//翻页
{点击 | ['T',1394,287,50,'L',1] | 延时=300}
{点击 | ['T',1394,601,50,'L',2] | 延时=300}
//第二页
{找图 | 合成-土归土 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[735,212,1446,679]] | 图片=['合成-土归土',75]}
//翻页
{点击 | ['T',1394,580,50,'L',1]}
{点击 | ['T',1394,287,50,'L',2] | 延时=300}
//第一页
{点击 | [975,724,50] | 延时=1000}
{点击 | [981,720,50] | 延时=1000}
{点击 | [799,661,50] | 延时=500}
{跳出 | 'TF'}
)
[合成-黑色乐谱]=(
{找图 | 合成-仲冬夜 | 计算=['T',[{'合成-黑色乐谱'},'+',1,{'合成-黑色乐谱'}]] | 延时=100 | 范围=[[743,222,1441,669]] | 图片=['合成-仲冬夜',75]}
{找图 | 合成-碎裂的骨片 | 计算=['T',[{'合成-黑色乐谱'},'+',1,{'合成-黑色乐谱'}]] | 延时=100 | 范围=[[743,222,1441,669]] | 图片=['合成-碎裂的骨片',75]}
//翻页
{点击 | ['T',1394,287,50,'L',1] | 延时=300}
{点击 | ['T',1394,580,50,'L',2] | 延时=300}
//第二页
{找图 | 合成-肖像 | 计算=['T',[{'合成-黑色乐谱'},'+',1,{'合成-黑色乐谱'}]] | 延时=100 | 范围=[[743,222,1441,669]] | 图片=['合成-肖像',75]}
//翻页
{点击 | ['T',1394,580,50,'L',1] | 延时=300}
{点击 | ['T',1394,287,50,'L',2] | 延时=300}
//第一页
{判断 | [[{'合成-黑色乐谱'},'等于',3],{跳出='F'}]}
{找图 | 合成-仲冬夜 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[735,212,1446,679]] | 图片=['合成-仲冬夜',75]}
{点击 | [721,432,50] | 延时=300}
{找图 | 合成-碎裂的骨片 | 点击=['T',0,0,50] | 延时=300 | 范围=[[743,222,1441,669]] | 图片=['合成-碎裂的骨片',75]}
//翻页
{点击 | ['T',1394,287,50,'L',1] | 延时=300}
{点击 | ['T',1394,601,50,'L',2] | 延时=300}
//第二页
{找图 | 合成-肖像 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[735,212,1446,679]] | 图片=['合成-肖像',75]}
//翻页
{点击 | ['T',1394,580,50,'L',1]}
{点击 | ['T',1394,287,50,'L',2] | 延时=300}
//第一页
{点击 | [975,724,50] | 延时=1000}
{点击 | [981,720,50] | 延时=1000}
{点击 | [799,661,50] | 延时=500}
{跳出 | 'TF'}
)
[合成-足迹]=(
{找图 | 合成-舞鞋 | 计算=['T',[{'合成-足迹'},'+',1,{'合成-足迹'}]] | 延时=100 | 范围=[[743,222,1441,669]] | 图片=['合成-舞鞋',75]}
{找图 | 合成-哀嚎 | 计算=['T',[{'合成-足迹'},'+',1,{'合成-足迹'}]] | 延时=100 | 范围=[[743,222,1441,669]] | 图片=['合成-哀嚎',75]}

{判断 | [[{'合成-足迹'},'等于',2],{跳出='F'}]}
{找图 | 合成-舞鞋 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[735,212,1446,679]] | 图片=['合成-舞鞋',75]}
{找图 | 合成-哀嚎 | 点击=['T',0,0,50] | 延时=1000 | 范围=[[735,212,1446,679]] | 图片=['合成-哀嚎',75]}

{点击 | [975,724,50] | 延时=1000}
{点击 | [981,720,50] | 延时=1000}
{点击 | [799,661,50] | 延时=500}

{跳出 | 'TF'}
)
[合成-震颤耦合]=(
{找图 | 合成-真理之钟 | 计算=['T',[{'合成-震颤耦合'},'+',1,{'合成-震颤耦合'}]] | 延时=100 | 范围=[[743,222,1441,669]] | 图片=['合成-真理之钟',75]}
{找图 | 合成-嵌合的齿轮 | 计算=['T',[{'合成-震颤耦合'},'+',1,{'合成-震颤耦合'}]] | 延时=100 | 范围=[[743,222,1441,669]] | 图片=['合成-嵌合的齿轮',75]}
//翻页
{点击 | ['T',1394,287,50,'L',1]}
{点击 | ['T',1394,601,50,'L',2] | 延时=300}
//第二页
{找图 | 合成-辉光管 | 计算=['T',[{'合成-震颤耦合'},'+',1,{'合成-震颤耦合'}]] | 延时=100 | 范围=[[743,222,1441,669]] | 图片=['合成-辉光管',75]}
//翻页
{点击 | ['T',1394,580,50,'L',1] | 延时=300}
{点击 | ['T',1394,287,50,'L',2] | 延时=300}
//第一页
{判断 | [[{'合成-震颤耦合'},'等于',3],{跳出='F'}]}
{找图 | 合成-真理之钟 | 点击=['T',0,0,50] | 延时=100 | 范围=[[743,222,1441,669]] | 图片=['合成-真理之钟',75]}
{点击 | [721,432,50] | 延时=300}
{找图 | 合成-嵌合的齿轮 | 点击=['T',0,0,50] | 延时=300 | 范围=[[743,222,1441,669]] | 图片=['合成-嵌合的齿轮',75]}
//翻页
{点击 | ['T',1394,287,50,'L',1]}
{点击 | ['T',1394,601,50,'L',2] | 延时=300}
//第二页
{找图 | 合成-辉光管 | 点击=['T',0,0,50] | 延时=100 | 范围=[[743,222,1441,669]] | 图片=['合成-辉光管',75]}
//翻页
{点击 | ['T',1394,580,50,'L',1] | 延时=300}
{点击 | ['T',1394,287,50,'L',2] | 延时=300}
//第一页
{点击 | [975,724,50] | 延时=1000}
{点击 | [981,720,50] | 延时=1000}
{点击 | [799,661,50] | 延时=500}
//{点击|[371,65,50]|延时=300}
{跳出 | 'TF'}
)
[合成-恍惚]=(
{找图 | 合成-电池 | 计算=['T',[{'合成-恍惚'},'+',1,{'合成-恍惚'}]] | 延时=100 | 范围=[[743,222,1441,669]] | 图片=['合成-电池',75]}
{找图 | 合成-荆棘捕绳 | 计算=['T',[{'合成-恍惚'},'+',1,{'合成-恍惚'}]] | 延时=100 | 范围=[[743,222,1441,669]] | 图片=['合成-荆棘捕绳',75]}
//翻页
{点击 | ['T',1394,287,50,'L',1]}
{点击 | ['T',1394,601,50,'L',2] | 延时=300}
//第二页
{找图 | 合成-符纸 | 计算=['T',[{'合成-恍惚'},'+',1,{'合成-恍惚'}]] | 延时=100 | 范围=[[743,222,1441,669]] | 图片=['合成-符纸',75]}
//翻页
{点击 | ['T',1394,580,50,'L',1] | 延时=300}
{点击 | ['T',1394,287,50,'L',2] | 延时=300}
//第一页
{判断 | [[{'合成-恍惚'},'等于',3],{跳出='F'}]}
{找图 | 合成-电池 | 点击=['T',0,0,50] | 延时=100 | 范围=[[743,222,1441,669]] | 图片=['合成-电池',75]}
{点击 | [721,432,50] | 延时=300}
{找图 | 合成-荆棘捕绳 | 点击=['T',0,0,50] | 延时=300 | 范围=[[743,222,1441,669]] | 图片=['合成-荆棘捕绳',75]}
//翻页
{点击 | ['T',1394,287,50,'L',1]}
{点击 | ['T',1394,601,50,'L',2] | 延时=300}
//第二页
{找图 | 合成-符纸 | 点击=['T',0,0,50] | 延时=100 | 范围=[[743,222,1441,669]] | 图片=['合成-符纸',75]}
//翻页
{点击 | ['T',1394,580,50,'L',1] | 延时=300}
{点击 | ['T',1394,287,50,'L',2] | 延时=300}
//第一页
{点击 | [975,724,50] | 延时=1000}
{点击 | [981,720,50] | 延时=1000}
{点击 | [799,661,50] | 延时=500}
//{点击|[371,65,50]|延时=300}
{跳出 | 'TF'}
)
[合成-永动机]=(
{找图 | 合成-充能护盾 | 计算=['T',[{'合成-永动机'},'+',1,{'合成-永动机'}]] | 延时=100 | 范围=[[743,222,1441,669]] | 图片=['合成-充能护盾',75]}
{找图 | 合成-1B型八角螺栓 | 计算=['T',[{'合成-永动机'},'+',1,{'合成-永动机'}]] | 延时=100 | 范围=[[743,222,1441,669]] | 图片=['合成-1B型八角螺栓',75]}
//翻页
{点击 | ['T',1394,287,50,'L',1]}
{点击 | ['T',1394,601,50,'L',2] | 延时=300}
//第二页
{找图 | 合成-护腕 | 计算=['T',[{'合成-永动机'},'+',1,{'合成-永动机'}]] | 延时=100 | 范围=[[743,222,1441,669]] | 图片=['合成-护腕',75]}
//翻页
{点击 | ['T',1394,580,50,'L',1] | 延时=300}
{点击 | ['T',1394,287,50,'L',2] | 延时=300}
//第一页
{判断 | [[{'合成-永动机'},'等于',3],{跳出='F'}]}
{找图 | 合成-充能护盾 | 点击=['T',0,0,50] | 延时=300 | 范围=[[743,222,1441,669]] | 图片=['合成-充能护盾',75]}
{点击 | [721,432,50] | 延时=300}
{找图 | 合成-1B型八角螺栓 | 点击=['T',0,0,50] | 延时=300 | 范围=[[743,222,1441,669]] | 图片=['合成-1B型八角螺栓',75]}
//翻页
{点击 | ['T',1394,287,50,'L',1]}
{点击 | ['T',1394,601,50,'L',2] | 延时=300}
//第二页
{找图 | 合成-护腕 | 点击=['T',0,0,50] | 延时=100 | 范围=[[743,222,1441,669]] | 图片=['合成-护腕',75]}
//翻页
{点击 | ['T',1394,580,50,'L',1] | 延时=300}
{点击 | ['T',1394,287,50,'L',2] | 延时=300}
//第一页
{点击 | [975,724,50] | 延时=1000}
{点击 | [981,720,50] | 延时=1000}
{点击 | [799,661,50] | 延时=500}
//{点击|[371,65,50]|延时=300}
{跳出 | 'TF'}
)
[▰▰▰▰▰▰[使用EGO]▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰]=(
{跳出 | 'TF'}
)
[EGO_长按加速]=(
{点击 | [1500,888,50,'L',1] | 延时=8000}
{点击 | [1500,888,50,'L',2] | 延时=100}
{跳出 | 'TF'}
)
[EGO计数重置]=(
{赋值 | [[{'金苹果次数'},0]]}
{赋值 | [[{'液袋次数'},0]]}
{赋值 | [[{'赤眼开次数'},0]]}
{赋值 | [[{'狐雨次数'},0]]}
{赋值 | [[{'电狼兔子次数'},0]]}
{赋值 | [[{'尸体袋次数'},0]]}
{赋值 | [[{'李箱终末次数'},0]]}
{赋值 | [[{'执行次数'},0]]}
{赋值 | [[{'黑枝次数'},0]]}
{赋值 | [[{'罗佳执行次数'},0]]}
{赋值 | [[{'盲目次数'},0]]}
{赋值 | [[{'侵蚀蜜卡拉次数'},0]]}
{赋值 | [[{'蜜卡拉次数'},0]]}
{赋值 | [[{'希斯克利夫束缚次数'},0]]}
{赋值 | [[{'希斯克利夫束缚次数'},0]]}
{赋值 | [[{'奥提斯束缚次数'},0]]}
{赋值 | [[{'罗佳诅咒钉次数'},0]]}
{跳出 | 'TF'}
)

[战斗释放特定EGO]=(
{空参 | 正在提高逆卡巴拉抑制器输出压制}
//此处预留其他战斗释放特定EGO
{组 | 'ego释放类别判断-楼层' | 开关={'第五层释放ego'}}
{组 | 'ego释放类别判断-低血量' | 开关={'低血量释放ego'}}

{组 | '输出型ego释放' | 开关={'输出型ego释放'}}
{组 | '回复型ego释放' | 开关={'回复型ego释放'}}
//{组|{'变量_EGO1_优先级'}}
//{组|{'变量_EGO2_优先级'}}
//{组|{'变量_EGO3_优先级'}}
//{组|{'变量_EGO4_优先级'}}
//{组|{'变量_EGO5_优先级'}}
//{组|{'变量_EGO6_优先级'}}
//{组|{'变量_EGO7_优先级'}}
//{组|{'变量_EGO8_优先级'}}
//{组|{'变量_EGO9_优先级'}}
//{组|{'变量_EGO10_优先级'}}
//{组|{'变量_EGO11_优先级'}}
//{组|{'变量_EGO12_优先级'}}
{赋值 | [[{'回复型ego释放'},0]]}
{赋值 | [[{'输出型ego释放'},0]]}
{跳出 | 'TF'}
)
[ego释放类别判断-楼层]=(
{赋值 | [[{'输出型ego释放'},1]] | 开关={'第五层释放ego-输出'}}
{赋值 | [[{'回复型ego释放'},1]] | 开关={'第五层释放ego-回复'}}
{跳出 | 'TF'}
)
[ego释放类别判断-低血量]=(
{赋值 | [[{'输出型ego释放'},1]] | 开关={'低血量释放ego-输出'}}
{赋值 | [[{'回复型ego释放'},1]] | 开关={'低血量释放ego-回复'}}
{跳出 | 'TF'}
)
[输出型ego释放]=(
{组 | {'变量_EGO1_优先级'}}
{组 | {'变量_EGO2_优先级'}}
{组 | {'变量_EGO3_优先级'}}
{跳出 | 'TF'}
)
[回复型ego释放]=(
{组 | {'变量_EGO4_优先级'}}
{组 | {'变量_EGO5_优先级'}}
{组 | {'变量_EGO6_优先级'}}
{跳出 | 'TF'}
)
[EGO_选择指定ego]=(
{点击 | [{'头像X'},{'头像Y'},50] | 延时=100}
{点击 | [{'头像X'},{'头像Y'},1000] | 延时=500}
{跳出 | 'TF'}
)
[EGO_金苹果]=(
{判断 | [[{'金苹果次数'},'大于等于',{'Num'}],{跳出='T'}] | 开关={'EGO在战斗中只释放一次'}}
{延时 | 200}
{找色 | EGO_怠惰 | 跳出='F' | 延时=10 | 范围=[[1552,249,1557,273]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找色 | EGO_暴食 | 跳出='F' | 延时=10 | 范围=[[1552,290,1557,313]] | 颜色=['#E9B980','0,1,#E8B87F',80]}

{找图 | 格里高尔 | 赋值=['T',[{'头像X'},{'X'}],[{'头像Y'},{'Y'}]] | 组=['TEGO_选择指定ego'] | 范围=[[205,790,1417,871]] | 图片=['格里高尔_旧G公司_小头像1','格里高尔_旧G公司_小头像2','格里高尔_二协会_小头像','小船虫',85]}
{找图 | EGO_金苹果 | 点击=['T',0,0,50,'2L'] | 计算=['T',[{'金苹果次数'},'+',1,{'金苹果次数'}]] | 延时=500 | 范围=[[296,170,1303,214]] | 图片=['Z级EGO',85]}
//{找图|EGO_金苹果|点击=['T',0,0,50,'2L']|计算=['T',[{'金苹果次数'},'+',1,{'金苹果次数'}]]|延时=500|范围=[[4,2,1586,884]]|图片=['EGO_金苹果',80]|开关={'识图点击'}}
//{点击|[441,335,50,'2L']|延时=300|开关={'备用-定向点击'}}
{点击 | [1500,800,50] | 延时=500}
{跳出 | 'TF'}
)

[EGO_液袋]=(
{判断 | [[{'液袋次数'},'大于等于',{'Num'}],{跳出='T'}] | 开关={'EGO在战斗中只释放一次'}}
{延时 | 200}
{找色 | EGO_嫉妒 | 跳出='F' | 延时=10 | 范围=[[1552,411,1557,435]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找色 | EGO_抑郁 | 跳出='F' | 延时=10 | 范围=[[1552,330,1557,353]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找色 | EGO_涩涩 | 跳出='F' | 延时=10 | 范围=[[1552,209,1557,233]] | 颜色=['#E9B980','0,1,#E8B87F',80]}

{找图 | 浮士德 | 赋值=['T',[{'头像X'},{'X'}],[{'头像Y'},{'Y'}]] | 组=['TEGO_选择指定ego'] | 范围=[[205,790,1417,871]] | 图片=['浮士德_L公司_小头像1','浮士德_N公司_小头像1','浮士德_七协会_小头像','浮士德_W公司_小头像','浮士德_悔恨_小头像','浮士德_剑契_小头像','浮士德_呼啸山庄_小头像','浮士德_裂纹事务所_小头像',80]}
{找图 | EGO_液袋 | 点击=['T',0,0,50,'2L'] | 计算=['T',[{'液袋次数'},'+',1,{'液袋次数'}]] | 延时=500 | 范围=[[296,170,1303,214]] | 图片=['H级EGO',85]}
//{找图|浮士德_液袋|点击=['T',0,0,50,'2L']|计算=['T',[{'液袋次数'},'+',1,{'液袋次数'}]]|延时=500|范围=[[4,2,1586,884]]|图片=['浮士德_液袋',75]|开关={'识图点击'}}
//{点击|[1123,325,50,'2L']|延时=300|开关={'备用-定向点击'}}
{点击 | [1500,800,50] | 延时=500}
{跳出 | 'TF'}
)

[EGO_狐雨]=(
{判断 | [[{'狐雨次数'},'大于等于',{'Num'}],{跳出='T'}] | 开关={'EGO在战斗中只释放一次'}}
{延时 | 200}
{找色 | EGO_怠惰 | 跳出='F' | 延时=10 | 范围=[[1552,249,1557,273]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找色 | EGO_暴食 | 跳出='F' | 延时=10 | 范围=[[1552,290,1557,313]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找色 | EGO_忧郁 | 跳出='F' | 延时=10 | 范围=[[1552,330,1557,353]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找色 | EGO_傲慢 | 跳出='F' | 延时=10 | 范围=[[1552,371,1557,393]] | 颜色=['#E9B980','0,1,#E8B87F',80]}

{找图 | 李箱 | 赋值=['T',[{'头像X'},{'X'}],[{'头像Y'},{'Y'}]] | 组=['TEGO_选择指定ego'] | 范围=[[205,790,1417,871]] | 图片=['李箱_檀香梅_小头像_1','李箱_檀香梅_小头像_2','李箱_裴廊德号_小头像_1','李箱_裴廊德号_小头像_2','李箱_W公司_小头像_1',85]}
{找图 | EGO_狐雨 | 点击=['T',0,0,50,'2L'] | 计算=['T',[{'狐雨次数'},'+',1,{'狐雨次数'}]] | 延时=500 | 范围=[[296,170,1303,214]] | 图片=['W级EGO',85]}
//{找图|EGO_狐雨|点击=['T',0,0,50,'2L']|计算=['T',[{'狐雨次数'},'+',1,{'狐雨次数'}]]|延时=500|范围=[[4,2,1586,884]]|图片=['EGO_狐雨',80]|开关={'识图点击'}}
//{点击|[1246,321,50,'2L']|延时=300|开关={'备用-定向点击'}}
{点击 | [1500,800,50] | 延时=500}
{跳出 | 'TF'}
)


[EGO_默尔索执行]=(
{判断 | [[{'执行次数'},'大于等于',{'Num'}],{跳出='T'}] | 开关={'EGO在战斗中只释放一次'}}
{延时 | 200}
{找色 | EGO_怠惰 | 跳出='F' | 延时=10 | 范围=[[1552,249,1557,273]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找色 | EGO_忧郁 | 跳出='F' | 延时=10 | 范围=[[1552,330,1557,353]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找色 | EGO_傲慢 | 跳出='F' | 延时=10 | 范围=[[1552,371,1557,393]] | 颜色=['#E9B980','0,1,#E8B87F',80]}

{找图 | 默尔索 | 赋值=['T',[{'头像X'},{'X'}],[{'头像Y'},{'Y'}]] | 组=['TEGO_选择指定ego'] | 范围=[[205,790,1417,871]] | 图片=['默尔索_N公司_小头像1','默尔索_N公司_小头像2','默尔索_R公司_小头像','默尔索_剑契_小头像',85]}
{找图 | EGO_执行 | 点击=['T',0,0,50,'2L'] | 计算=['T',[{'执行次数'},'+',1,{'执行次数'}]] | 延时=500 | 范围=[[296,170,1303,214]] | 图片=['H级EGO',85]}
//{找图|EGO_执行|点击=['T',0,0,50,'2L']|计算=['T',[{'执行次数'},'+',1,{'执行次数'}]]|延时=500|范围=[[4,2,1586,884]]|图片=['EGO_执行',80]|开关={'识图点击'}}
//{点击|[1123,325,50,'2L']|延时=300|开关={'备用-定向点击'}}
{点击 | [1500,800,50] | 延时=500}
{跳出 | 'TF'}
)

[EGO_黑枝]=(
{判断 | [[{'黑枝次数'},'大于等于',{'Num'}],{跳出='T'}] | 开关={'EGO在战斗中只释放一次'}}
{延时 | 200}
{找色 | EGO_暴食 | 跳出='F' | 延时=10 | 范围=[[1552,290,1557,313]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找色 | EGO_色欲 | 跳出='F' | 延时=10 | 范围=[[1552,209,1557,233]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找色 | EGO_忧郁 | 跳出='F' | 延时=10 | 范围=[[1552,330,1557,353]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找色 | EGO_傲慢 | 跳出='F' | 延时=10 | 范围=[[1552,371,1557,393]] | 颜色=['#E9B980','0,1,#E8B87F',80]}

{找图 | 奥提斯 | 赋值=['T',[{'头像X'},{'X'}],[{'头像Y'},{'Y'}]] | 组=['TEGO_选择指定ego'] | 范围=[[205,790,1417,871]] | 图片=['奥提斯_七协会_小头像1','奥提斯_七协会_小头像2','奥提斯_臼齿_小头像','奥提斯_魔弹射手_小头像',85]}
{找图 | EGO_黑枝 | 点击=['T',0,0,50,'2L'] | 计算=['T',[{'黑枝次数'},'+',1,{'黑枝次数'}]] | 延时=500 | 范围=[[296,170,1303,214]] | 图片=['H级EGO',85]}
//{找图|EGO_黑枝|点击=['T',0,0,50,'2L']|计算=['T',[{'黑枝次数'},'+',1,{'黑枝次数'}]]|延时=500|范围=[[4,2,1586,884]]|图片=['EGO_黑枝',80]|开关={'识图点击'}}
//{点击|[1123,325,50,'2L']|延时=300|开关={'备用-定向点击'}}
{点击 | [1500,800,50] | 延时=500}
{跳出 | 'TF'}
)
[EGO_罗佳执行]=(
{判断 | [[{'罗佳执行次数'},'大于等于',{'Num'}],{跳出='T'}] | 开关={'EGO在战斗中只释放一次'}}
{延时 | 200}
{找色 | EGO_怠惰 | 跳出='F' | 延时=10 | 范围=[[1552,249,1557,273]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找色 | EGO_傲慢 | 跳出='F' | 延时=10 | 范围=[[1552,371,1557,393]] | 颜色=['#E9B980','0,1,#E8B87F',80]}

{找图 | 罗佳 | 赋值=['T',[{'头像X'},{'X'}],[{'头像Y'},{'Y'}]] | 组=['TEGO_选择指定ego'] | 范围=[[205,790,1417,871]] | 图片=['罗佳_十协会_小头像1','罗佳_黑云会_小头像','罗佳_六协会_小头像',85]}
{找图 | EGO_罗执行 | 点击=['T',0,0,50,'2L'] | 计算=['T',[{'罗佳执行次数'},'+',1,{'罗佳执行次数'}]] | 延时=500 | 范围=[[296,170,1303,214]] | 图片=['H级EGO',85]}
//{找图|EGO_罗执行|点击=['T',0,0,50,'2L']|计算=['T',[{'罗佳执行次数'},'+',1,{'罗佳执行次数'}]]|延时=500|范围=[[4,2,1586,884]]|图片=['EGO_罗执行',80]|开关={'识图点击'}}
//{点击|[1123,325,50,'2L']|延时=300|开关={'备用-定向点击'}}
{点击 | [1500,800,50] | 延时=500}
{跳出 | 'TF'}
)
[EGO_以实玛利盲目]=(
{判断 | [[{'盲目次数'},'大于等于',{'Num'}],{跳出='T'}] | 开关={'EGO在战斗中只释放一次'}}
{延时 | 200}
{找色 | EGO_嫉妒 | 跳出='F' | 延时=10 | 范围=[[1552,209,1557,233]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找色 | EGO_暴怒 | 跳出='F' | 延时=10 | 范围=[[1552,168,1557,193]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找色 | EGO_忧郁 | 跳出='F' | 延时=10 | 范围=[[1552,330,1557,353]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找色 | EGO_傲慢 | 跳出='F' | 延时=10 | 范围=[[1552,371,1557,393]] | 颜色=['#E9B980','0,1,#E8B87F',80]}

{找图 | 以实玛利 | 赋值=['T',[{'头像X'},{'X'}],[{'头像Y'},{'Y'}]] | 组=['TEGO_选择指定ego'] | 范围=[[205,790,1417,871]] | 图片=['以实玛利_臼齿_小头像1','以实玛利_臼齿_小头像2','以实玛利_裴廓德号_小头像',85]}
{找图 | EGO_以实玛利盲目 | 点击=['T',0,0,50,'2L'] | 计算=['T',[{'盲目次数'},'+',1,{'盲目次数'}]] | 延时=500 | 范围=[[296,170,1303,214]] | 图片=['W级EGO',85]}
//{找图|EGO_以实玛利盲目|点击=['T',0,0,50,'2L']|计算=['T',[{'盲目次数'},'+',1,{'盲目次数'}]]|延时=500|范围=[[4,2,1586,884]]|图片=['EGO_以实玛利盲目',80]|开关={'识图点击'}}
//{点击|[1246,321,50,'2L']|延时=300|开关={'备用-定向点击'}}
{点击 | [1500,800,50] | 延时=500}
{跳出 | 'TF'}
)
[EGO_辛克莱提灯]=(
{判断 | [[{'辛克莱提灯次数'},'大于等于',{'Num'}],{跳出='T'}] | 开关={'EGO在战斗中只释放一次'}}
{延时 | 200}
{找色 | EGO_色欲 | 跳出='F' | 延时=10 | 范围=[[1552,209,1557,233]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找色 | EGO_暴食 | 跳出='F' | 延时=10 | 范围=[[1552,290,1557,313]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找色 | EGO_傲慢 | 跳出='F' | 延时=10 | 范围=[[1552,371,1557,393]] | 颜色=['#E9B980','0,1,#E8B87F',80]}

{找图 | 辛克莱 | 赋值=['T',[{'头像X'},{'X'}],[{'头像Y'},{'Y'}]] | 组=['TEGO_选择指定ego'] | 范围=[[205,790,1417,871]] | 图片=['辛克莱_五协会_小头像','辛克莱_菲利浦_小头像',85]}
{找图 | EGO_辛克莱提灯 | 点击=['T',0,0,50,'2L'] | 计算=['T',[{'辛克莱提灯次数'},'+',1,{'辛克莱提灯次数'}]] | 延时=500 | 范围=[[296,170,1303,214]] | 图片=['H级EGO',85]}
//{找图|EGO_辛克莱提灯|点击=['T',0,0,50,'2L']|计算=['T',[{'辛克莱提灯次数'},'+',1,{'辛克莱提灯次数'}]]|延时=500|范围=[[4,2,1586,884]]|图片=['EGO_辛克莱提灯',80]|开关={'识图点击'}}
//{点击|[1123,325,50,'2L']|延时=300|开关={'备用-定向点击'}}
{点击 | [1500,800,50] | 延时=500}
{跳出 | 'TF'}
)

[EGO_堂吉诃德蜜卡拉]=(
{判断 | [[{'蜜卡拉次数'},'大于等于',{'Num'}],{跳出='T'}] | 开关={'EGO在战斗中只释放一次'}}
{延时 | 200}
{找色 | EGO_色欲 | 跳出='F' | 延时=10 | 范围=[[1552,209,1557,233]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找色 | EGO_暴食 | 跳出='F' | 延时=10 | 范围=[[1552,290,1557,313]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找色 | EGO_嫉妒 | 跳出='F' | 延时=10 | 范围=[[1552,209,1557,233]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找色 | EGO_傲慢 | 跳出='F' | 延时=10 | 范围=[[1552,371,1557,393]] | 颜色=['#E9B980','0,1,#E8B87F',80]}

{找图 | 堂吉诃德 | 赋值=['T',[{'头像X'},{'X'}],[{'头像Y'},{'Y'}]] | 组=['TEGO_选择指定ego'] | 范围=[[205,790,1417,871]] | 图片=['堂吉诃德_拉曼却_小头像',75]}
{找图 | EGO_堂吉坷德蜜卡拉 | 点击=['T',0,0,50,'2L'] | 计算=['T',[{'蜜卡拉次数'},'+',1,{'蜜卡拉次数'}]] | 延时=500 | 范围=[[296,170,1303,214]] | 图片=['W级EGO',85]}
{点击 | [1500,800,50] | 延时=500}
{跳出 | 'TF'}
)
[EGO_堂吉诃德蜜卡拉_侵蚀]=(
{判断 | [[{'侵蚀蜜卡拉次数'},'大于等于',{'Num'}],{跳出='T'}] | 开关={'EGO在战斗中只释放一次'}}
{延时 | 200}
{找色 | EGO_色欲 | 跳出='F' | 延时=10 | 范围=[[1552,209,1557,233]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找色 | EGO_暴食 | 跳出='F' | 延时=10 | 范围=[[1552,290,1557,313]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找色 | EGO_嫉妒 | 跳出='F' | 延时=10 | 范围=[[1552,209,1557,233]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找色 | EGO_傲慢 | 跳出='F' | 延时=10 | 范围=[[1552,371,1557,393]] | 颜色=['#E9B980','0,1,#E8B87F',80]}

{找图 | 堂吉诃德 | 赋值=['T',[{'头像X'},{'X'}],[{'头像Y'},{'Y'}]] | 组=['TEGO_选择指定ego'] | 范围=[[205,790,1417,871]] | 图片=['堂吉诃德_拉曼却_小头像',75]}
{找图 | EGO_堂吉坷德蜜卡拉_侵蚀 | 点击=['T',0,0,200,'2L','1'] | 偏移=[0,50] | 范围=[[296,170,1303,214]] | 图片=['W级EGO',85]}
{延时 | 1000}
{找图 | EGO_堂吉坷德蜜卡拉_侵蚀 | 点击=['T',0,0,200,'2L','2'] | 偏移=[0,50] | 范围=[[296,170,1303,214]] | 图片=['W级EGO',85]}
{延时 | 200}

{找图 | EGO_堂吉坷德蜜卡拉_侵蚀 | 点击=['T',0,0,50,'2L'] | 计算=['T',[{'侵蚀蜜卡拉次数'},'+',1,{'侵蚀蜜卡拉次数'}]] | 延时=500 | 范围=[[296,170,1303,214]] | 图片=['W级EGO',85]}
{点击 | [1500,800,50] | 延时=500}
{跳出 | 'TF'}
)
[EGO_希斯克利夫束缚]=(
{判断 | [[{'希斯克利夫束缚次数'},'大于等于',{'Num'}],{跳出='T'}] | 开关={'EGO在战斗中只释放一次'}}
{延时 | 200}
{找色 | EGO_嫉妒 | 跳出='F' | 延时=10 | 范围=[[1552,411,1557,435]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找色 | EGO_忧郁 | 跳出='F' | 延时=10 | 范围=[[1552,330,1557,353]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找色 | EGO_色欲 | 跳出='F' | 延时=10 | 范围=[[1552,209,1557,233]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找色 | EGO_傲慢 | 跳出='F' | 延时=10 | 范围=[[1552,371,1557,393]] | 颜色=['#E9B980','0,1,#E8B87F',80]}

{找图 | 希斯克利夫 | 赋值=['T',[{'头像X'},{'X'}],[{'头像Y'},{'Y'}]] | 组=['TEGO_选择指定ego'] | 范围=[[205,790,1417,871]] | 图片=['希斯克利夫_裴廓德号_小头像','希斯克利夫_狂猎_小头像',80]}
{找图 | EGO_希斯克利夫束缚 | 点击=['T',0,0,50,'2L'] | 计算=['T',[{'希斯克利夫束缚次数'},'+',1,{'希斯克利夫束缚次数'}]] | 延时=500 | 范围=[[296,170,1303,214]] | 图片=['W级EGO',85]}
{点击 | [1500,800,50] | 延时=500}
{跳出 | 'TF'}
)
[EGO_奥提斯束缚]=(
{判断 | [[{'奥提斯束缚次数'},'大于等于',{'Num'}],{跳出='T'}] | 开关={'EGO在战斗中只释放一次'}}
{延时 | 200}
{找色 | EGO_暴怒 | 跳出='F' | 延时=10 | 范围=[[1552,168,1557,193]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找色 | EGO_色欲 | 跳出='F' | 延时=10 | 范围=[[1552,209,1557,233]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找色 | EGO_怠惰 | 跳出='F' | 延时=10 | 范围=[[1552,249,1557,273]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找色 | EGO_傲慢 | 跳出='F' | 延时=10 | 范围=[[1552,371,1557,393]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找图 | 奥提斯 | 赋值=['T',[{'头像X'},{'X'}],[{'头像Y'},{'Y'}]] | 组=['TEGO_选择指定ego'] | 范围=[[205,790,1417,871]] | 图片=['奥提斯_七协会_小头像1','奥提斯_七协会_小头像2','奥提斯_臼齿_小头像','奥提斯_魔弹射手_小头像','奥提斯_呼啸山庄_小头像',85]}
{找图 | EGO_奥提斯束缚 | 点击=['T',0,0,50,'2L'] | 计算=['T',[{'奥提斯束缚次数'},'+',1,{'奥提斯束缚次数'}]] | 延时=500 | 范围=[[296,170,1303,214]] | 图片=['W级EGO',85]}
{点击 | [1500,800,50] | 延时=500}
{跳出 | 'TF'}
)
[EGO_罗佳诅咒钉]=(
{判断 | [[{'罗佳诅咒钉次数'},'大于等于',{'Num'}],{跳出='T'}] | 开关={'EGO在战斗中只释放一次'}}
{延时 | 200}
{找色 | EGO_色欲 | 跳出='F' | 延时=10 | 范围=[[1552,209,1557,233]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找色 | EGO_嫉妒 | 跳出='F' | 延时=10 | 范围=[[1552,411,1557,435]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找色 | EGO_傲慢 | 跳出='F' | 延时=10 | 范围=[[1552,371,1557,393]] | 颜色=['#E9B980','0,1,#E8B87F',80]}
{找图 | 罗佳 | 赋值=['T',[{'头像X'},{'X'}],[{'头像Y'},{'Y'}]] | 组=['TEGO_选择指定ego'] | 范围=[[205,790,1417,871]] | 图片=['罗佳_十协会_小头像1','罗佳_黑云会_小头像','罗佳_六协会_小头像','罗佳_拉曼却_小头像',85]}
{找图 | EGO_罗佳诅咒钉 | 点击=['T',0,0,50,'2L'] | 计算=['T',[{'罗佳诅咒钉次数'},'+',1,{'罗佳诅咒钉次数'}]] | 延时=500 | 范围=[[296,170,1303,214]] | 图片=['H级EGO',85]}
{点击 | [1500,800,50] | 延时=500}
{跳出 | 'TF'}
)
[EGO_空]=(
{跳出 | 'TF'}
)
[▰▰▰▰▰▰[固定队伍]▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰]=(
{跳出 | 'TF'}
)
[第一队]=(
{赋值 | [[{'第一队'},1]]}
)
[第二队]=(
{赋值 | [[{'第二队'},1]]}
)
[第三队]=(
{赋值 | [[{'第三队'},1]]}
)
[第四队]=(
{赋值 | [[{'第四队'},1]]}
)
[第五队]=(
{赋值 | [[{'第五队'},1]]}
)
[▰▰▰▰▰▰[备选队伍]▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰]=(
{跳出 | 'TF'}
)
[备选队伍1]=(
{赋值 | [[{'变量_角色1_优先级'},{'备选1_角色1_优先级'}]]}
{赋值 | [[{'变量_角色2_优先级'},{'备选1_角色2_优先级'}]]}
{赋值 | [[{'变量_角色3_优先级'},{'备选1_角色3_优先级'}]]}
{赋值 | [[{'变量_角色4_优先级'},{'备选1_角色4_优先级'}]]}
{赋值 | [[{'变量_角色5_优先级'},{'备选1_角色5_优先级'}]]}
{赋值 | [[{'变量_角色6_优先级'},{'备选1_角色6_优先级'}]]}
{赋值 | [[{'变量_角色7_优先级'},'空']]}
{赋值 | [[{'变量_角色8_优先级'},'空']]}
{赋值 | [[{'变量_角色9_优先级'},'空']]}
{赋值 | [[{'变量_角色10_优先级'},'空']]}
{赋值 | [[{'变量_角色11_优先级'},'空']]}
{赋值 | [[{'变量_角色12_优先级'},'空']]}
{跳出 | 'TF'}
)

[备选队伍2]=(
{赋值 | [[{'变量_角色1_优先级'},{'备选2_角色1_优先级'}]]}
{赋值 | [[{'变量_角色2_优先级'},{'备选2_角色2_优先级'}]]}
{赋值 | [[{'变量_角色3_优先级'},{'备选2_角色3_优先级'}]]}
{赋值 | [[{'变量_角色4_优先级'},{'备选2_角色4_优先级'}]]}
{赋值 | [[{'变量_角色5_优先级'},{'备选2_角色5_优先级'}]]}
{赋值 | [[{'变量_角色6_优先级'},{'备选2_角色6_优先级'}]]}
{赋值 | [[{'变量_角色7_优先级'},'空']]}
{赋值 | [[{'变量_角色8_优先级'},'空']]}
{赋值 | [[{'变量_角色9_优先级'},'空']]}
{赋值 | [[{'变量_角色10_优先级'},'空']]}
{赋值 | [[{'变量_角色11_优先级'},'空']]}
{赋值 | [[{'变量_角色12_优先级'},'空']]}
{跳出 | 'TF'}
)
[备选队伍3]=(
{赋值 | [[{'变量_角色1_优先级'},{'备选3_角色1_优先级'}]]}
{赋值 | [[{'变量_角色2_优先级'},{'备选3_角色2_优先级'}]]}
{赋值 | [[{'变量_角色3_优先级'},{'备选3_角色3_优先级'}]]}
{赋值 | [[{'变量_角色4_优先级'},{'备选3_角色4_优先级'}]]}
{赋值 | [[{'变量_角色5_优先级'},{'备选3_角色5_优先级'}]]}
{赋值 | [[{'变量_角色6_优先级'},{'备选3_角色6_优先级'}]]}
{赋值 | [[{'变量_角色7_优先级'},'空']]}
{赋值 | [[{'变量_角色8_优先级'},'空']]}
{赋值 | [[{'变量_角色9_优先级'},'空']]}
{赋值 | [[{'变量_角色10_优先级'},'空']]}
{赋值 | [[{'变量_角色11_优先级'},'空']]}
{赋值 | [[{'变量_角色12_优先级'},'空']]}
{跳出 | 'TF'}
)
[备选队伍4]=(
{赋值 | [[{'变量_角色1_优先级'},{'备选4_角色1_优先级'}]]}
{赋值 | [[{'变量_角色2_优先级'},{'备选4_角色2_优先级'}]]}
{赋值 | [[{'变量_角色3_优先级'},{'备选4_角色3_优先级'}]]}
{赋值 | [[{'变量_角色4_优先级'},{'备选4_角色4_优先级'}]]}
{赋值 | [[{'变量_角色5_优先级'},{'备选4_角色5_优先级'}]]}
{赋值 | [[{'变量_角色6_优先级'},{'备选4_角色6_优先级'}]]}
{赋值 | [[{'变量_角色7_优先级'},'空']]}
{赋值 | [[{'变量_角色8_优先级'},'空']]}
{赋值 | [[{'变量_角色9_优先级'},'空']]}
{赋值 | [[{'变量_角色10_优先级'},'空']]}
{赋值 | [[{'变量_角色11_优先级'},'空']]}
{赋值 | [[{'变量_角色12_优先级'},'空']]}
{跳出 | 'TF'}
)
[备选队伍5]=(
{赋值 | [[{'变量_角色1_优先级'},{'备选5_角色1_优先级'}]]}
{赋值 | [[{'变量_角色2_优先级'},{'备选5_角色2_优先级'}]]}
{赋值 | [[{'变量_角色3_优先级'},{'备选5_角色3_优先级'}]]}
{赋值 | [[{'变量_角色4_优先级'},{'备选5_角色4_优先级'}]]}
{赋值 | [[{'变量_角色5_优先级'},{'备选5_角色5_优先级'}]]}
{赋值 | [[{'变量_角色6_优先级'},{'备选5_角色6_优先级'}]]}
{赋值 | [[{'变量_角色7_优先级'},'空']]}
{赋值 | [[{'变量_角色8_优先级'},'空']]}
{赋值 | [[{'变量_角色9_优先级'},'空']]}
{赋值 | [[{'变量_角色10_优先级'},'空']]}
{赋值 | [[{'变量_角色11_优先级'},'空']]}
{赋值 | [[{'变量_角色12_优先级'},'空']]}
{跳出 | 'TF'}
)
[备选队伍6]=(
{赋值 | [[{'变量_角色1_优先级'},{'备选6_角色1_优先级'}]]}
{赋值 | [[{'变量_角色2_优先级'},{'备选6_角色2_优先级'}]]}
{赋值 | [[{'变量_角色3_优先级'},{'备选6_角色3_优先级'}]]}
{赋值 | [[{'变量_角色4_优先级'},{'备选6_角色4_优先级'}]]}
{赋值 | [[{'变量_角色5_优先级'},{'备选6_角色5_优先级'}]]}
{赋值 | [[{'变量_角色6_优先级'},{'备选6_角色6_优先级'}]]}
{赋值 | [[{'变量_角色7_优先级'},'空']]}
{赋值 | [[{'变量_角色8_优先级'},'空']]}
{赋值 | [[{'变量_角色9_优先级'},'空']]}
{赋值 | [[{'变量_角色10_优先级'},'空']]}
{赋值 | [[{'变量_角色11_优先级'},'空']]}
{赋值 | [[{'变量_角色12_优先级'},'空']]}
{跳出 | 'TF'}
)


[▰▰▰▰▰▰[体系选择]▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰]=(
{跳出 | 'TF'}
)
[烧伤]=(
//{找色|图标|点击=['T',0,0,50]|延时=1000|范围=[[133,251,1464,507]]|颜色=['#DFA325','0,2,#DFA325/-2,3,#E1A320/1,3,#DDA324',80]}
{赋值 | [[{'烧伤'},1]]}
{赋值 | [[{'烧伤1'},1]] | 开关={'第一顺位'}}
{赋值 | [[{'烧伤2'},1]] | 开关={'第二顺位'}}
{赋值 | [[{'变量_礼物1_优先级_中字'},'烧伤-中字']]}
{找图 | EGO礼物选择 | 跳出='F' | 范围=[[996,601,1562,825]] | 图片=['EGO礼物选择','EGO礼物选择2','EGO礼物选择3',85]}

{找图 | 炎鳞 | 点击=['T',0,0,50] | 延时=50 | 组=['TEGO礼物选择3'] | 范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]] | 图片=['选择-炎鳞1','选择-炎鳞2',85]}
{找图 | 火热多汁琵琶腿 | 点击=['T',0,0,50] | 延时=50 | 组=['TEGO礼物选择3'] | 范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]] | 图片=['选择-火热多汁琵琶腿1','选择-火热多汁琵琶腿2',85]}

{找图 | 图标 | 点击=['T',0,0,50] | 延时=50 | 组=['TEGO礼物选择3'] | 范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]] | 图片=['烧伤标识','烧伤文本',80]}
{跳出 | 'TF'}
)
[流血]=(
//{找色|图标|点击=['T',0,0,50]|延时=1000|范围=[[133,251,1464,507]]|颜色=['#C12D2C','0,2,#C12E2C/4,2,#C0272A/0,-1,#BE292A',80]}
{赋值 | [[{'流血'},1]]}
{赋值 | [[{'流血1'},1]] | 开关={'第一顺位'}}
{赋值 | [[{'流血2'},1]] | 开关={'第二顺位'}}
{赋值 | [[{'变量_礼物1_优先级_中字'},'流血-中字']]}
{找图 | EGO礼物选择 | 跳出='F' | 范围=[[996,601,1562,825]] | 图片=['EGO礼物选择','EGO礼物选择2','EGO礼物选择3',85]}
//我已经完全理解了！我不需要给流血安排这个！
//祝他们好运！
//{找图|白树棉|组=['T有脏东西']|范围=[[83,161,1558,416]]|图片=['EGO礼物获取-白树棉',85]}

{找图 | 图标 | 点击=['T',0,0,50] | 延时=50 | 组=['TEGO礼物选择3'] | 范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]] | 图片=['流血标识','流血文本',80]}
{跳出 | 'TF'}
)
[震颤]=(
{赋值 | [[{'震颤'},1]]}
{赋值 | [[{'震颤1'},1]] | 开关={'第一顺位'}}
{赋值 | [[{'震颤2'},1]] | 开关={'第二顺位'}}
{赋值 | [[{'变量_礼物1_优先级_中字'},'震颤-中字']]}
{找图 | EGO礼物选择 | 跳出='F' | 范围=[[996,601,1562,825]] | 图片=['EGO礼物选择','EGO礼物选择2','EGO礼物选择3',85]}

{找图 | 暴雨 | 点击=['T',0,0,50] | 延时=50 | 组=['TEGO礼物选择3'] | 范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]] | 图片=['选择-暴雨1','选择-暴雨2',85]}

{找图 | 图标 | 点击=['T',0,0,50] | 延时=50 | 组=['TEGO礼物选择3'] | 范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]] | 图片=['震颤标识','震颤文本',80]}
{跳出 | 'TF'}
)
[破裂]=(
{赋值 | [[{'破裂'},1]]}
{赋值 | [[{'破裂1'},1]] | 开关={'第一顺位'}}
{赋值 | [[{'破裂2'},1]] | 开关={'第二顺位'}}
{赋值 | [[{'变量_礼物1_优先级_中字'},'破裂-中字']]}
{找图 | EGO礼物选择 | 跳出='F' | 范围=[[996,601,1562,825]] | 图片=['EGO礼物选择','EGO礼物选择2','EGO礼物选择3',85]}

{找图 | 干巴柴涩鸡胸肉 | 点击=['T',0,0,50] | 延时=50 | 组=['TEGO礼物选择3'] | 范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]] | 图片=['选择-干巴柴涩鸡胸肉1','选择-干巴柴涩鸡胸肉2',85]}
{找图 | 快感 | 点击=['T',0,0,50] | 延时=50 | 组=['TEGO礼物选择3'] | 范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]] | 图片=['选择-快感1','选择-快感2',85]}
{找图 | 雷击木 | 点击=['T',0,0,50] | 延时=50 | 组=['TEGO礼物选择3'] | 范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]] | 图片=['选择-雷击木1','选择-雷击木2',85]}
//未截取{找图|破伞|点击=['T',0,0,50]|延时=50|组=['TEGO礼物选择3']|范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]]|图片=['选择-破伞1','选择-破伞2',85]}
{找图 | 成捆的符咒 | 点击=['T',0,0,50] | 延时=50 | 组=['TEGO礼物选择3'] | 范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]] | 图片=['选择-成捆的符咒1','选择-成捆的符咒2',85]}

{找图 | 图标 | 点击=['T',0,0,50] | 延时=50 | 组=['TEGO礼物选择3'] | 范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]] | 图片=['破裂标识','破裂文本',80]}
{跳出 | 'TF'}
)
[沉沦]=(
{赋值 | [[{'沉沦'},1]]}
{赋值 | [[{'沉沦1'},1]] | 开关={'第一顺位'}}
{赋值 | [[{'沉沦2'},1]] | 开关={'第二顺位'}}
{赋值 | [[{'变量_礼物1_优先级_中字'},'沉沦-中字']]}
{找图 | EGO礼物选择 | 跳出='F' | 范围=[[996,601,1562,825]] | 图片=['EGO礼物选择','EGO礼物选择2','EGO礼物选择3',85]}

{找图 | 图标 | 点击=['T',0,0,50] | 延时=50 | 组=['TEGO礼物选择3'] | 范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]] | 图片=['沉沦标识','沉沦文本',80]}
{跳出 | 'TF'}
)
[呼吸]=(
//{找色|图标|点击=['T',0,0,50]|延时=1000|范围=[[133,251,1464,507]]|颜色=['#A4B9B7','1,0,#BCC4C4/1,1,#A0B7B3/5,5,#BEC3C3',80]}
{赋值 | [[{'呼吸'},1]]}
{赋值 | [[{'呼吸1'},1]] | 开关={'第一顺位'}}
{赋值 | [[{'呼吸2'},1]] | 开关={'第二顺位'}}
{赋值 | [[{'变量_礼物1_优先级_中字'},'呼吸-中字']]}
{找图 | EGO礼物选择 | 跳出='F' | 范围=[[996,601,1562,825]] | 图片=['EGO礼物选择','EGO礼物选择2','EGO礼物选择3',85]}

{找图 | 图标 | 点击=['T',0,0,50] | 延时=50 | 组=['TEGO礼物选择3'] | 范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]] | 图片=['呼吸标识','呼吸文本',80]}
{跳出 | 'TF'}
)
[充能]=(
//{找色|图标|点击=['T',0,0,50]|延时=1000|范围=[[133,251,1464,507]]|颜色=['#12C5D0','-2,-1,#0286B3/3,3,#17D9D3',80]}
{赋值 | [[{'充能'},1]]}
{赋值 | [[{'充能1'},1]] | 开关={'第一顺位'}}
{赋值 | [[{'充能2'},1]] | 开关={'第二顺位'}}
{赋值 | [[{'变量_礼物1_优先级_中字'},'充能-中字']]}
{找图 | EGO礼物选择 | 跳出='F' | 范围=[[996,601,1562,825]] | 图片=['EGO礼物选择','EGO礼物选择2','EGO礼物选择3',85]}

{找图 | 图标 | 点击=['T',0,0,50] | 延时=50 | 组=['TEGO礼物选择3'] | 范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]] | 图片=['充能标识','充能文本',80]}
{跳出 | 'TF'}
)
[斩击]=(
//{找色|图标|点击=['T',0,0,50]|延时=1000|范围=[[133,251,1464,507]]|颜色=['#A47963','13,13,#A47862/16,11,#6E4420/13,10]}
{找图 | EGO礼物选择 | 跳出='F' | 范围=[[996,601,1562,825]] | 图片=['EGO礼物选择','EGO礼物选择2','EGO礼物选择3',85]}

{找图 | 切开的记忆 | 点击=['T',0,0,50] | 延时=50 | 组=['TEGO礼物选择3'] | 范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]] | 图片=['选择-切开的记忆1','选择-切开的记忆2',85]}

{找图 | 图标 | 点击=['T',0,0,50] | 延时=50 | 组=['TEGO礼物选择3'] | 范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]] | 图片=['斩击标识','斩击文本',80]}
{跳出 | 'TF'}
)
[突刺]=(
//{找色|图标|点击=['T',0,0,50]|延时=1000|范围=[[133,251,1464,507]]|颜色=['#A47963','13,13,#A47862/16,11,#6E4420/13,10]}
{找图 | EGO礼物选择 | 跳出='F' | 范围=[[996,601,1562,825]] | 图片=['EGO礼物选择','EGO礼物选择2','EGO礼物选择3',85]}

{找图 | 图标 | 点击=['T',0,0,50] | 延时=50 | 组=['TEGO礼物选择3'] | 范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]] | 图片=['突刺标识','突刺文本',80]}
{跳出 | 'TF'}
)
[打击]=(
//{找色|图标|点击=['T',0,0,50]|延时=1000|范围=[[133,251,1464,507]]|颜色=['#A47963','13,13,#A47862/16,11,#6E4420/13,10]}
{找图 | EGO礼物选择 | 跳出='F' | 范围=[[996,601,1562,825]] | 图片=['EGO礼物选择','EGO礼物选择2','EGO礼物选择3',85]}

{找图 | 图标 | 点击=['T',0,0,50] | 延时=50 | 组=['TEGO礼物选择3'] | 范围=[[{'礼物坐标X1'},175,{'礼物坐标X2'},551],[{'礼物坐标X3'},175,{'礼物坐标X4'},551],[{'礼物坐标X5'},175,{'礼物坐标X6'},551],[{'礼物坐标X7'},175,{'礼物坐标X8'},551]] | 图片=['打击标识','打击文本',80]}
{跳出 | 'TF'}
)

[礼物_空]=(
//测试用
//{跳出|'TF'}
{找图 | EGO礼物选择 | 跳出='F' | 范围=[[996,601,1562,825]] | 图片=['EGO礼物选择','EGO礼物选择2','EGO礼物选择3',85]}
{点击 | [675,475,50] | 延时=100}
{点击 | [1414,722,50] | 延时=100}
{跳出 | 'TF'}
)
[▰▰▰▰▰▰[罪人选择]▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰]=(
{跳出 | 'TF'}
)
[李箱]=(
{找图 | 已选人检测 | 赋值=['F',[{'重新选人'},1]] | 范围=[[290,283,450,324]] | 图片=['已选人1',85] | 开关={'已选人检测'}}
{跳出 | 'TF' | 开关={'已选人检测'}}
{点击 | [374,291,50] | 延时=50}
{找图 | 死亡检查 | 计算=['T',[{'死亡人数'},'+',1,{'死亡人数'}]] | 范围=[[77,857,136,894]] | 图片=['死亡确认',85]}
{跳出 | 'TF'}
)
[浮士德]=(
{找图 | 已选人检测 | 赋值=['F',[{'重新选人'},1]] | 范围=[[460,283,620,324]] | 图片=['已选人1',85] | 开关={'已选人检测'}}
{跳出 | 'TF' | 开关={'已选人检测'}}
{点击 | [534,291,50] | 延时=50}
{找图 | 死亡检查 | 计算=['T',[{'死亡人数'},'+',1,{'死亡人数'}]] | 范围=[[159,846,242,893]] | 图片=['死亡确认',85]}
{跳出 | 'TF'}
)
[堂吉诃德]=(
{找图 | 已选人检测 | 赋值=['F',[{'重新选人'},1]] | 范围=[[630,283,790,324]] | 图片=['已选人1',85] | 开关={'已选人检测'}}
{跳出 | 'TF' | 开关={'已选人检测'}}
{点击 | [694,291,50] | 延时=50}
{找图 | 死亡检查 | 计算=['T',[{'死亡人数'},'+',1,{'死亡人数'}]] | 范围=[[264,845,345,895]] | 图片=['死亡确认',85]}
{跳出 | 'TF'}
)
[良秀]=(
{找图 | 已选人检测 | 赋值=['F',[{'重新选人'},1]] | 范围=[[800,283,960,324]] | 图片=['已选人1',85] | 开关={'已选人检测'}}
{跳出 | 'TF' | 开关={'已选人检测'}}
{点击 | [854,291,50] | 延时=50}
{找图 | 死亡检查 | 计算=['T',[{'死亡人数'},'+',1,{'死亡人数'}]] | 范围=[[369,851,433,885]] | 图片=['死亡确认',85]}
{跳出 | 'TF'}
)
[默尔索]=(
{找图 | 已选人检测 | 赋值=['F',[{'重新选人'},1]] | 范围=[[970,283,1130,324]] | 图片=['已选人1',85] | 开关={'已选人检测'}}
{跳出 | 'TF' | 开关={'已选人检测'}}
{点击 | [1014,291,50] | 延时=50}
{找图 | 死亡检查 | 计算=['T',[{'死亡人数'},'+',1,{'死亡人数'}]] | 范围=[[461,852,531,891]] | 图片=['死亡确认',85]}
{跳出 | 'TF'}
)
[鸿璐]=(
{找图 | 已选人检测 | 赋值=['F',[{'重新选人'},1]] | 范围=[[1140,283,1300,324]] | 图片=['已选人1',85] | 开关={'已选人检测'}}
{跳出 | 'TF' | 开关={'已选人检测'}}
{点击 | [1174,291,50] | 延时=50}
{找图 | 死亡检查 | 计算=['T',[{'死亡人数'},'+',1,{'死亡人数'}]] | 范围=[[565,852,617,885]] | 图片=['死亡确认',85]}
{跳出 | 'TF'}
)
[希斯克里夫]=(
{找图 | 已选人检测 | 赋值=['F',[{'重新选人'},1]] | 范围=[[290,533,450,570]] | 图片=['已选人1',85] | 开关={'已选人检测'}}
{跳出 | 'TF' | 开关={'已选人检测'}}
{点击 | [374,542,50] | 延时=50}
{找图 | 死亡检查 | 计算=['T',[{'死亡人数'},'+',1,{'死亡人数'}]] | 范围=[[658,856,712,887]] | 图片=['死亡确认',85]}
{跳出 | 'TF'}
)
[以实玛利]=(
{找图 | 已选人检测 | 赋值=['F',[{'重新选人'},1]] | 范围=[[460,533,620,570]] | 图片=['已选人1',85] | 开关={'已选人检测'}}
{跳出 | 'TF' | 开关={'已选人检测'}}
{点击 | [534,542,50] | 延时=50}
{找图 | 死亡检查 | 计算=['T',[{'死亡人数'},'+',1,{'死亡人数'}]] | 范围=[[751,854,810,885]] | 图片=['死亡确认',85]}
{跳出 | 'TF'}
)
[罗佳]=(
{找图 | 已选人检测 | 赋值=['F',[{'重新选人'},1]] | 范围=[[630,533,790,570]] | 图片=['已选人1',85] | 开关={'已选人检测'}}
{跳出 | 'TF' | 开关={'已选人检测'}}
{点击 | [694,542,50] | 延时=50}
{找图 | 死亡检查 | 计算=['T',[{'死亡人数'},'+',1,{'死亡人数'}]] | 范围=[[846,854,901,888]] | 图片=['死亡确认',85]}
{跳出 | 'TF'}
)
[辛克莱]=(
{找图 | 已选人检测 | 赋值=['F',[{'重新选人'},1]] | 范围=[[800,533,960,570]] | 图片=['已选人1',85] | 开关={'已选人检测'}}
{跳出 | 'TF' | 开关={'已选人检测'}}
{点击 | [854,542,50] | 延时=50}
{找图 | 死亡检查 | 计算=['T',[{'死亡人数'},'+',1,{'死亡人数'}]] | 范围=[[945,854,999,885]] | 图片=['死亡确认',85]}
{跳出 | 'TF'}
)
[奥提斯]=(
{找图 | 已选人检测 | 赋值=['F',[{'重新选人'},1]] | 范围=[[970,533,1130,570]] | 图片=['已选人1',85] | 开关={'已选人检测'}}
{跳出 | 'TF' | 开关={'已选人检测'}}
{点击 | [1014,542,50] | 延时=50}
{找图 | 死亡检查 | 计算=['T',[{'死亡人数'},'+',1,{'死亡人数'}]] | 范围=[[1048,856,1095,885]] | 图片=['死亡确认',85]}
{跳出 | 'TF'}
)
[格里高尔]=(
{找图 | 已选人检测 | 赋值=['F',[{'重新选人'},1]] | 范围=[[1140,533,1300,570]] | 图片=['已选人1',85] | 开关={'已选人检测'}}
{跳出 | 'TF' | 开关={'已选人检测'}}
{点击 | [1174,542,50] | 延时=50}
{找图 | 死亡检查 | 计算=['T',[{'死亡人数'},'+',1,{'死亡人数'}]] | 范围=[[1141,855,1198,889]] | 图片=['死亡确认',85]}
{跳出 | 'TF'}
)
[空]=(
{跳出 | 'TF'}
)
[▰▰▰▰▰▰[彩蛋]▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰▰]=(
{跳出 | 'TF'}
)
[彩蛋]=(
{空参 | ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿}
{空参 | ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠿⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿}
{空参 | ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⢉⣴⣶⣷⣶⣤⠙⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿}
{空参 | ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢠⣿⣿⣿⣿⣿⣿⣧⠸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿}
{空参 | ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠸⣿⣿⣿⣿⣿⣿⡿⢠⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿}
{空参 | ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡧⠈⠻⢿⣿⠿⠟⡁⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿}
{空参 | ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⣰⢏⣶⠀⣶⡆⣎⢳⡘⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿}
{空参 | ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡏⣴⢣⣾⣿⠀⣿⡇⣿⣧⠻⡌⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿}
{空参 | ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠃⣡⣿⣿⣿⡄⣿⢇⣿⣿⣷⡡⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿}
{空参 | ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠡⣰⣿⣿⣿⣿⡇⡇⣾⣿⣿⣿⣷⡐⡹⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿}
{空参 | ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⡑⣰⣿⣿⣿⣿⣿⡇⡇⣿⣿⣿⣿⣿⣿⡄⠙⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿}
{空参 | ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⣛⠐⣼⣿⣿⣿⡿⢛⣡⣤⣦⣤⣉⠻⣿⣿⣿⣿⣌⢘⡛⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿}
{空参 | ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⣼⢋⣾⣿⣿⣿⣿⢡⣿⣿⣿⣿⣿⣿⣧⠹⣿⣿⣿⣿⣆⠻⡜⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿}
{空参 | ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢏⣼⢣⣾⣿⣿⣿⣿⣿⢸⣿⣿⣿⣿⣿⣿⣿⢠⣿⣿⣿⣿⣿⣧⠹⣎⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿}
{空参 | ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢏⡾⢡⣿⣿⣿⣿⣿⣿⣿⣆⠙⢿⣿⣿⣿⠿⢁⠾⣿⣿⣿⣿⣿⣿⣷⡘⣆⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿}
{空参 | ⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⢣⡞⣰⣿⣿⡿⠛⢁⣢⣬⣭⣴⣿⡆⢠⢠⣤⣾⣿⣧⣂⠝⠻⣿⣿⣿⣿⣷⡘⢧⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿}
{空参 | ⣿⣿⣿⣿⣿⡿⠟⣛⣛⣁⠋⢴⠿⠛⢁⢨⣶⣿⣿⣿⣿⣿⣿⣿⡇⢸⣿⣿⣿⣿⣿⣿⣮⣀⠉⡩⢙⠻⣿⠌⢓⣙⣛⡛⠿⣿⣿⣿⣿⣿}
{空参 | ⣿⣿⣿⣿⡏⣠⣾⣿⣿⣿⣷⣆⠀⣢⣵⣾⣿⣿⣿⣿⣿⣿⣿⣿⡇⢘⢻⣿⣿⣿⣿⣿⣿⣿⣷⣦⣄⠁⢠⣾⣿⣿⣿⣿⣶⡙⣿⣿⣿⣿}
{空参 | ⣿⣿⣿⣿⢰⣿⣿⣿⣿⣿⣿⣿⠈⣛⣛⣛⣛⣛⣛⣛⣛⣋⣉⣒⡂⢐⢐⣒⠒⢒⣒⣒⣒⣒⣒⣒⣒⡂⣾⣿⣿⣿⣿⣿⣿⡇⣿⣿⣿⣿}
{空参 | ⣿⣿⣿⣿⡄⢿⣿⣿⣿⣿⣿⡟⠀⠭⣭⣶⣶⣶⣶⣶⣶⣶⣶⡖⢢⢰⢰⣶⣶⣶⣮⣭⣭⣭⣭⣭⡭⠅⠸⣿⣿⣿⣿⣿⡿⢃⣿⣿⣿⣿}
{空参 | ⣿⣿⣿⣿⣿⣦⣉⢛⡛⣛⣩⣤⣕⡠⠈⠙⠻⣿⣿⣿⣿⣿⣿⡇⢸⢸⢸⣿⣿⣿⣿⣿⣿⣿⣿⠋⠀⢁⣤⣬⣙⡛⣛⢋⣤⣿⣿⣿⣿⣿}
{空参 | ⣿⣿⣿⣿⣿⣿⣿⡌⡇⣿⣿⣿⣿⣿⣾⣷⣮⣄⠝⠻⣿⣿⠟⢃⣬⣬⣈⠻⢿⣿⠿⣿⠟⠋⣁⣤⣾⣿⣿⣿⣿⡇⠉⣾⣿⣿⣿⣿⣿⣿}
{空参 | ⣿⣿⣿⣿⣿⣿⣿⡇⡇⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⣌⢡⣾⣿⣿⣿⣿⣿⡄⢴⣾⣶⣶⣾⣿⣿⣿⣿⣿⣿⣿⠇⠀⣿⣿⣿⣿⣿⣿⣿}
{空参 | ⣿⣿⣿⣿⣿⣿⣿⡇⡇⡇⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢸⣿⣿⣿⣿⣿⣿⣿⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⡇⠀⣿⣿⣿⣿⣿⣿⣿}
{空参 | ⣿⣿⣿⣿⣿⣿⣿⢃⡅⡇⣿⣿⣿⣿⣿⣿⣿⣿⠿⠛⠅⠈⢿⣿⣿⣿⣿⡿⠃⠀⠝⠻⢿⣿⣿⣿⣿⣿⣿⣿⡇⡇⣄⢿⣿⣿⣿⣿⣿⣿}
{空参 | ⣿⣿⣿⣿⣿⣿⣿⢸⡇⡇⣿⣿⣿⣿⣿⣿⡿⢏⠀⣠⣴⣾⣦⢩⡉⡋⣩⡔⢾⣶⣤⡊⢌⠻⣿⠿⣿⣿⣿⣿⡇⡇⣿⢸⣿⣿⣿⣿⣿⣿}
{空参 | ⣿⣿⣿⣿⣿⠿⢋⣬⣥⣥⡙⠿⢟⡉⣶⡖⣠⣴⣿⣿⣿⡿⣡⣿⡇⡇⣿⣿⠎⢿⣿⣿⣷⣮⣐⠦⡌⣝⠿⠛⣡⣥⣭⣌⠻⣿⣿⣿⣿⣿}
{空参 | ⣿⣿⣿⣿⠇⣾⣿⣿⣿⣿⣿⣦⠡⢖⣩⣴⣿⣿⣿⡿⣋⣴⣿⡿⢃⡇⣿⣿⣷⡀⡹⣿⣿⣿⣿⣷⣦⡘⢰⣿⣿⣿⣿⣿⣷⡌⣿⣿⣿⣿}
{空参 | ⣿⣿⣿⣿⠸⣿⣿⣿⣿⣿⣿⣿⢀⣛⣛⣛⣛⠛⢁⣒⣀⣀⣀⡀⢀⡀⢀⡀⠀⣀⣀⠀⢀⣀⣀⣒⣛⡃⣿⣿⣿⣿⣿⣿⣿⡇⣿⣿⣿⣿}
{空参 | ⣿⣿⣿⣿⣆⠻⣿⣿⣿⣿⣿⠏⣴⣶⣶⣶⠂⣠⣶⣶⣶⣶⣶⡆⢰⡆⢰⣶⣾⣿⣿⣦⢈⢿⣿⣿⣿⣷⡘⢿⣿⣿⣿⣿⡿⢡⣿⣿⣿⣿}
{空参 | ⣿⣿⣿⣿⣿⣷⣤⠩⡍⣭⣴⣾⣿⣿⡿⠃⣵⣿⣿⣿⣿⣿⠟⢃⣬⣥⣌⠛⢿⣿⣿⣿⣧⡁⠻⣿⣿⣿⣿⣦⣬⡍⡭⢡⣶⣿⣿⣿⣿⣿}
{空参 | ⣿⣿⣿⣿⣿⣿⣿⡇⡇⣿⣿⣿⣿⡿⠁⣼⣿⣿⣿⣿⣿⢃⣾⣿⣿⣿⣿⣿⣆⢻⣿⣿⣿⣿⡔⠘⠿⣿⣿⣿⣿⠇⡇⣿⣿⣿⣿⣿⣿⣿}
{空参 | ⣿⣿⣿⣿⣿⣿⣿⡇⡇⡆⣿⣿⠏⢀⢢⣿⣿⣿⣿⣿⣿⢸⣿⣿⣿⣿⣿⣿⣿⢀⣿⣿⣿⣿⣿⣆⢀⢈⢻⣿⡇⡆⡇⣿⣿⣿⣿⣿⣿⣿}
{空参 | ⣿⣿⣿⣿⣿⣿⣿⢡⡆⡇⣿⠏⠢⢢⣿⣿⡿⡛⣛⡻⣛⣌⠻⣿⣿⣿⣿⡿⢋⣴⡈⢛⠿⣿⣿⣿⣧⡀⢣⡹⡇⡇⣦⢹⣿⣿⣿⣿⣿⣿}
{空参 | ⣿⣿⣿⣿⣿⡿⠛⣈⣁⣃⠃⠐⣱⠟⠋⢁⣤⣾⣿⣿⣿⣿⣷⣬⢉⡉⣩⣴⣾⣿⣿⣷⣤⡊⠙⠛⠛⢷⡄⠑⢀⣁⣙⡘⠿⣿⣿⣿⣿⣿}
{空参 | ⣿⣿⣿⣿⠏⣴⣿⣿⣿⣿⣷⣆⠀⢐⣠⣾⣿⣿⣿⣿⣿⣿⣿⣿⡇⡇⣿⣿⣿⣿⣿⣿⣿⣿⣷⣦⣈⠐⢠⣾⣿⣿⣿⣿⣶⡘⣿⣿⣿⣿}
{空参 | ⣿⣿⣿⣿⢰⣿⣿⣿⣿⣿⣿⣿⠈⣛⣛⠛⠛⠛⠛⠛⠛⠁⠐⠒⠂⠂⠐⠒⠒⠒⣒⣒⣒⣒⣒⣒⣒⡂⣿⣿⣿⣿⣿⣿⣿⡇⣿⣿⣿⣿}
{空参 | ⣿⣿⣿⣿⡄⢻⣿⣿⣿⣿⣿⠟⣨⡙⠲⣾⣿⣿⣿⣿⣿⣿⣿⣿⠇⡃⢿⣿⣿⣿⣶⣶⣶⣶⡶⣒⡤⠆⠹⣿⣿⣿⣿⣿⡿⢃⣿⣿⣿⣿}
{空参 | ⣿⣿⣿⣿⣿⣦⣍⡛⠛⣛⣡⣴⣮⣅⠑⠢⠝⠻⣿⣿⣿⣿⣿⣿⢸⡇⣿⣿⣿⣿⣿⣿⡿⠛⠡⠿⢃⣭⣶⣬⣙⠛⢛⣋⣤⣾⣿⣿⣿⣿}
{空参 | ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣾⣷⣎⠐⠍⠻⢿⠿⢋⣨⣥⣉⡙⢿⠿⠋⢁⢀⣶⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿}
{空参 | ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣦⣀⠀⣾⣿⣿⣿⣿⣿⣆⠀⣪⣶⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿}
{空参 | ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢸⣿⣿⣿⣿⣿⣿⣿⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿}
{空参 | ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣆⠻⣿⣿⣿⣿⣿⠏⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿}
{空参 | ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣬⣉⣉⣩⣴⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿}
{空参 | ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿}
{空参 | ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿}
{延时 | 100}
{空参 | 所有SEPHIRAH的记忆均已同步}
{跳出 | 'TF'}
)